REPLACE INTO `tact_key` (`ID`, `Key1`, `Key2`, `Key3`, `Key4`, `Key5`, `Key6`, `Key7`, `Key8`, `Key9`, `Key10`, `Key11`, `Key12`, `Key13`, `Key14`, `Key15`, `Key16`, `VerifiedBuild`) VALUES
(67, 118, 88, 59, 218, 205, 82, 87, 163, 247, 61, 21, 152, 162, 202, 45, 153, 23857),
(58, 209, 172, 32, 253, 20, 149, 127, 171, 194, 113, 150, 233, 246, 231, 2, 74, 23857),
(66, 77, 208, 220, 130, 177, 1, 200, 10, 186, 192, 164, 213, 126, 103, 248, 89, 23857),
(71, 151, 43, 110, 116, 66, 14, 197, 25, 230, 249, 217, 125, 89, 74, 163, 124, 23857),
(75, 205, 12, 15, 250, 173, 147, 99, 236, 20, 221, 37, 236, 221, 42, 91, 98, 23857),
(62, 194, 80, 26, 114, 101, 75, 150, 248, 99, 80, 197, 169, 39, 150, 47, 122, 23857),
(60, 114, 169, 122, 36, 169, 152, 227, 165, 80, 15, 56, 113, 243, 118, 40, 192, 23857),
(69, 138, 206, 141, 177, 105, 226, 249, 138, 195, 106, 213, 44, 8, 142, 119, 193, 23857),
(70, 154, 137, 204, 126, 58, 203, 41, 207, 20, 198, 11, 193, 59, 30, 70, 22, 23857),
(74, 148, 109, 86, 89, 242, 250, 243, 39, 192, 183, 236, 130, 139, 116, 138, 219, 23857),
(61, 56, 50, 215, 196, 42, 172, 146, 104, 240, 11, 231, 182, 180, 142, 201, 175, 23857),
(72, 171, 85, 174, 27, 240, 199, 197, 25, 175, 240, 40, 193, 86, 16, 164, 91, 23857),
(59, 198, 197, 246, 199, 247, 53, 215, 217, 76, 135, 38, 127, 164, 153, 77, 69, 23857),
(63, 216, 59, 188, 180, 108, 196, 56, 177, 122, 72, 231, 108, 79, 86, 84, 163, 23857),
(65, 133, 112, 144, 217, 38, 187, 40, 174, 218, 75, 240, 40, 202, 204, 75, 163, 23857),
(64, 240, 253, 225, 210, 155, 39, 79, 110, 125, 189, 183, 255, 129, 95, 233, 16, 23857);


DELETE FROM `broadcast_text_locale` WHERE (`ID`=120065 AND `locale`='ruRU') OR (`ID`=116346 AND `locale`='ruRU') OR (`ID`=98814 AND `locale`='ruRU') OR (`ID`=99857 AND `locale`='ruRU') OR (`ID`=122032 AND `locale`='ruRU') OR (`ID`=114182 AND `locale`='ruRU') OR (`ID`=105597 AND `locale`='ruRU') OR (`ID`=117326 AND `locale`='ruRU');
REPLACE INTO `broadcast_text_locale` (`ID`, `locale`, `Text_lang`, `Text1_lang`, `VerifiedBuild`) VALUES
(120065, 'ruRU', 'Звуковой эффект для войск', '', 23857),
(116346, 'ruRU', 'Мы, сломленные, приветствуем тебя.', 'Мы, сломленные, приветствуем тебя.', 23857),
(98814, 'ruRU', 'Просмотреть доступные задания.', 'Просмотреть доступные задания.', 23857),
(99857, 'ruRU', '', 'Это было нелегко, но я раздобыла кое-какое оружие и припасы. Тебе что-нибудь нужно?', 23857),
(122032, 'ruRU', '', 'Мы – последняя преграда на пути Легиона.', 23857),
(114182, 'ruRU', 'Собрать нас всех вместе – твоя великая заслуга. Теперь, когда с твоей помощью мы разработали новую тактику и обрели веру в себя, я не сомневаюсь в нашей победе в этой войне.\n\nКогда все закончится, Пылающий Легион больше не будет представлять угрозу, и станет ясно, что все наши жертвы принесены не напрасно.', '', 23857),
(105597, 'ruRU', 'Возвращайся в Даларан, а затем немедленно отправляйся на Расколотые острова.', '', 23857),
(117326, 'ruRU', 'Никто не остановит иллидари!', '', 23857);

REPLACE INTO `area_group_member` (`ID`, `AreaGroupID`, `AreaID`, `VerifiedBuild`) VALUES
(11116, 5128, 7642, 22908),
(11118, 5128, 7778, 22908),
(11119, 5128, 7779, 22908),
(11120, 5128, 8273, 22908),
(11117, 5128, 7650, 22908),
(11121, 5128, 8365, 22908),
(11132, 5128, 7780, 22908);


REPLACE INTO `curve` (`ID`, `Type`, `Flags`, `VerifiedBuild`) VALUES
(2656, 0, 2, 22908),
(2518, 0, 2, 22908),
(2519, 0, 2, 22908),
(1720, 0, 2, 22908),
(2520, 0, 2, 22908),
(2655, 0, 2, 22908),
(1754, 0, 2, 24330),
(1755, 0, 2, 24330);


REPLACE INTO `spell_casting_requirements` (`ID`, `SpellID`, `MinFactionID`, `RequiredAreasID`, `RequiresSpellFocus`, `FacingCasterFlags`, `MinReputation`, `RequiredAuraVision`, `VerifiedBuild`) VALUES
(19521, 218367, 0, 5128, 0, 0, 0, 0, 22908);



REPLACE INTO `spell_interrupts` (`ID`, `SpellID`, `AuraInterruptFlags1`, `AuraInterruptFlags2`, `ChannelInterruptFlags1`, `ChannelInterruptFlags2`, `InterruptFlags`, `DifficultyID`, `VerifiedBuild`) VALUES
(67891, 204057, 541589504, 0, 0, 0, 0, 0, 22908),
(67893, 204059, 541589504, 0, 0, 0, 0, 0, 22908),
(67894, 204060, 541589504, 0, 0, 0, 0, 0, 22908),
(67892, 204058, 541589504, 0, 0, 0, 0, 0, 22908);


REPLACE INTO `curve_point` (`ID`, `PosX`, `PosY`, `CurveID`, `OrderIndex`, `VerifiedBuild`) VALUES
(11211, 0, -100, 2655, 0, 22908),
(11212, 1, 0, 2655, 1, 22908),
(11213, 0, -100, 2656, 0, 22908),
(11214, 1, 0, 2656, 1, 22908);



REPLACE INTO `modifier_tree` (`ID`, `Asset`, `SecondaryAsset`, `Parent`, `Type`, `TertiaryAsset`, `Operator`, `Amount`, `VerifiedBuild`) VALUES
(52361, 0, 0, 0, 0, 0, 4, 1, 22908),
(52362, 42080, 0, 52361, 73, 0, 2, 1, 22908),
(52363, 42076, 0, 52361, 73, 0, 2, 1, 22908),
(52364, 42072, 0, 52361, 73, 0, 2, 1, 22908),
(52365, 42068, 0, 52361, 73, 0, 2, 1, 22908),
(52366, 42064, 0, 52361, 73, 0, 2, 1, 22908),
(52367, 42060, 0, 52361, 73, 0, 2, 1, 22908),
(52368, 42056, 0, 52361, 73, 0, 2, 1, 22908),
(52369, 42052, 0, 52361, 73, 0, 2, 1, 22908),
(52370, 42048, 0, 52361, 73, 0, 2, 1, 22908),
(52371, 42044, 0, 52361, 73, 0, 2, 1, 22908),
(52380, 0, 0, 0, 0, 0, 4, 1, 22908),
(52381, 42064, 0, 52380, 73, 0, 2, 1, 22908),
(52382, 42048, 0, 52380, 73, 0, 2, 1, 22908),
(52383, 42080, 0, 52380, 73, 0, 2, 1, 22908),
(52384, 42072, 0, 52380, 73, 0, 2, 1, 22908),
(52385, 42044, 0, 52380, 73, 0, 2, 1, 22908),
(52386, 42068, 0, 52380, 73, 0, 2, 1, 22908),
(52387, 42052, 0, 52380, 73, 0, 2, 1, 22908),
(52388, 42056, 0, 52380, 73, 0, 2, 1, 22908),
(52389, 42076, 0, 52380, 73, 0, 2, 1, 22908),
(52390, 42060, 0, 52380, 73, 0, 2, 1, 22908),
(52391, 2, 810, 52380, 169, 4, 2, 1, 22908),
(52392, 42406, 0, 52380, 73, 0, 2, 1, 22908),
(52412, 0, 0, 0, 0, 0, 4, 1, 22908),
(52413, 42072, 0, 52412, 73, 0, 2, 1, 22908),
(52414, 42052, 0, 52412, 73, 0, 2, 1, 22908),
(52415, 42048, 0, 52412, 73, 0, 2, 1, 22908),
(52416, 42056, 0, 52412, 73, 0, 2, 1, 22908),
(52417, 42060, 0, 52412, 73, 0, 2, 1, 22908),
(52418, 42076, 0, 52412, 73, 0, 2, 1, 22908),
(52419, 42044, 0, 52412, 73, 0, 2, 1, 22908),
(52420, 42080, 0, 52412, 73, 0, 2, 1, 22908),
(52421, 42411, 0, 52412, 73, 0, 2, 1, 22908),
(52422, 2, 810, 52412, 169, 4, 2, 1, 22908),
(52423, 42064, 0, 52412, 73, 0, 2, 1, 22908),
(52424, 42068, 0, 52412, 73, 0, 2, 1, 22908),
(52323, 0, 0, 0, 0, 0, 4, 1, 22908),
(52324, 43811, 0, 52323, 2, 0, 2, 1, 22908);


REPLACE INTO `phase` (`ID`, `Flags`, `VerifiedBuild`) VALUES
(6944, 516, 22908);


REPLACE INTO `spell_class_options` (`ID`, `SpellID`, `SpellClassMask1`, `SpellClassMask2`, `SpellClassMask3`, `SpellClassMask4`, `SpellClassSet`, `ModalNextSpell`, `VerifiedBuild`) VALUES
(29434, 243223, 0, 0, 0, 67108864, 4, 0, 24330),
(29435, 243228, 0, 0, 0, 67108864, 4, 0, 24330),
(24995, 203155, 536870912, 16777216, 0, 0, 9, 0, 24330);



REPLACE INTO `item_x_bonus_tree` (`ID`, `ItemID`, `itemBonusTreeID`, `VerifiedBuild`) VALUES
(30593, 128705, 345, 24330),
(30595, 128709, 345, 24330),
(30597, 128710, 345, 24330),
(30599, 128711, 345, 24330),
(30601, 128885, 345, 24330),
(30605, 128887, 345, 24330),
(30607, 128888, 345, 24330),
(30609, 128889, 345, 24330),
(30482, 128884, 345, 24330),
(30611, 128890, 345, 24330),
(30484, 128900, 345, 24330),
(30613, 128891, 345, 24330),
(30615, 128901, 345, 24330),
(30617, 128902, 345, 24330),
(26526, 127033, 345, 24330),
(30623, 128905, 345, 24330),
(31520, 132505, 345, 24330),
(30627, 128907, 345, 24330),
(31526, 132507, 345, 24330),
(47912, 130229, 345, 24330),
(47915, 130231, 345, 24330),
(47918, 136713, 345, 24330),
(31517, 132504, 345, 24330),
(47921, 130230, 345, 24330),
(30579, 126997, 345, 24330),
(47924, 130244, 345, 24330),
(47927, 130238, 345, 24330),
(47930, 130239, 345, 24330),
(47933, 130240, 345, 24330),
(47936, 130233, 345, 24330),
(47939, 130237, 345, 24330),
(47942, 130242, 345, 24330),
(30625, 128906, 345, 24330),
(47945, 130234, 345, 24330),
(47948, 130236, 345, 24330),
(47951, 130241, 345, 24330),
(47954, 130235, 345, 24330),
(31523, 132506, 345, 24330),
(47957, 130243, 345, 24330),
(26454, 127019, 345, 24330),
(26457, 127020, 345, 24330),
(30567, 123913, 345, 24330),
(30569, 123914, 345, 24330),
(30571, 123915, 345, 24330),
(30573, 123916, 345, 24330),
(30575, 123917, 345, 24330),
(30577, 126996, 345, 24330),
(30583, 126999, 345, 24330),
(30585, 127000, 345, 24330),
(30587, 127001, 345, 24330),
(30589, 127002, 345, 24330),
(30591, 127842, 345, 24330),
(26529, 127034, 345, 24330),
(30563, 123911, 345, 24330),
(26434, 126995, 345, 24330),
(30619, 128903, 345, 24330),
(30581, 126998, 345, 24330),
(30603, 128886, 345, 24330),
(30565, 123912, 345, 24330),
(22003, 123910, 345, 24330),
(30621, 128904, 345, 24330);


REPLACE INTO `quest_v2` (`ID`, `UniqueBitFlag`, `VerifiedBuild`) VALUES
(46187, 27405, 24330),
(46766, 27929, 24330),
(46006, 27266, 24330),
(46008, 27267, 24330),
(46010, 27268, 24330),
(46011, 27269, 24330),
(46012, 27270, 24330),
(46013, 27271, 24330),
(46014, 27272, 24330),
(46015, 27273, 24330),
(46016, 27274, 24330),
(46021, 27280, 24330),
(46161, 27383, 24330),
(46162, 27384, 24330),
(46163, 27385, 24330),
(46164, 27386, 24330),
(46165, 27387, 24330),
(46166, 27388, 24330),
(46167, 27389, 24330),
(46168, 27390, 24330),
(46170, 27392, 24330),
(45921, 27183, 24330),
(45922, 27184, 24330),
(45923, 27185, 24330),
(45924, 27186, 24330),
(45925, 27187, 24330),
(45926, 27188, 24330),
(45927, 27189, 24330),
(45928, 27190, 24330),
(46185, 27403, 24330),
(46186, 27404, 24330),
(46183, 27401, 24330),
(46188, 27406, 24330),
(46189, 27407, 24330),
(46190, 27408, 24330),
(46191, 27409, 24330),
(46192, 27410, 24330),
(46184, 27402, 24330),
(45799, 27080, 24330),
(46213, 27428, 24330),
(46279, 27485, 24330),
(46763, 27928, 24330),
(46169, 27391, 24330),
(46017, 27275, 24330);

REPLACE INTO `item` (`ID`, `IconFileDataID`, `ClassID`, `SubClassID`, `SoundOverrideSubclassID`, `Material`, `InventoryType`, `SheatheType`, `ItemGroupSoundsID`, `VerifiedBuild`) VALUES
(115556, 0, 4, 2, -1, 8, 1, 0, 7, 24330);


REPLACE INTO `curve_point` (`ID`, `PosX`, `PosY`, `CurveID`, `OrderIndex`, `VerifiedBuild`) VALUES
(6600, 850, 0, 1755, 1, 24330),
(9246, 1035, 925, 1755, 2, 24330),
(9245, 1035, 925, 1754, 2, 24330),
(6598, 850, 0, 1754, 1, 24330);

REPLACE INTO `creature_difficulty` (`ID`, `CreatureID`, `Flags1`, `Flags2`, `Flags3`, `Flags4`, `Flags5`, `Flags6`, `Flags7`, `FactionTemplateID`, `Expansion`, `MinLevel`, `MaxLevel`, `VerifiedBuild`) VALUES
(121848, 117871, 268960096, 0, 0, 0, 16777216, 0, 0, 35, 6, 110, 110, 24330);


REPLACE INTO `item_modified_appearance` (`ItemID`, `ItemAppearanceID`, `ItemAppearanceModifierID`, `OrderIndex`, `TransmogSourceTypeEnum`, `ID`, `VerifiedBuild`) VALUES
(115556, 23471, 3, 2, 1, 67243, 24330),
(113845, 23471, 3, 2, 1, 67233, 24330);


REPLACE INTO `spell_aura_options` (`ID`, `SpellID`, `ProcCharges`, `ProcTypeMask`, `ProcCategoryRecovery`, `CumulativeAura`, `DifficultyID`, `ProcChance`, `SpellProcsPerMinuteID`, `VerifiedBuild`) VALUES
(22098, 216113, 0, 332116, 0, 0, 0, 100, 0, 24330),
(9073, 12292, 0, 332052, 0, 0, 0, 100, 0, 24330),
(20768, 204288, 4, 172712, 500, 0, 0, 100, 0, 24330),
(23152, 228224, 0, 536870912, 0, 30, 0, 100, 0, 24330),
(19697, 194310, 4294967295, 2147518464, 1000, 8, 0, 30, 0, 24330),
(20676, 203555, 0, 4, 0, 0, 0, 60, 0, 24330);


REPLACE INTO `spell_cooldowns` (`ID`, `SpellID`, `CategoryRecoveryTime`, `RecoveryTime`, `StartRecoveryTime`, `DifficultyID`, `VerifiedBuild`) VALUES
(24927, 215769, 0, 180000, 0, 0, 24330),
(24248, 210256, 0, 45000, 1500, 0, 24330);


REPLACE INTO `hotfix_data` (`Id`, `TableHash`, `RecordId`, `Deleted`) VALUES
(67, 20077728, 289011, 0), -- QuestObjective
(305, 2199425034, 1731, 0), -- ItemBonus
(86, 261693969, 46017, 0), -- QuestV2CliTask
(86, 986198281, 46017, 0), -- QuestV2
(97, 261693969, 46169, 0), -- QuestV2CliTask
(97, 986198281, 46169, 0), -- QuestV2
(452, 4030871717, 361388, 0), -- SpellEffect
(383, 492039028, 23221, 0), -- WorldStateExpression
(29, 4072756116, 115, 0), -- ItemLevelSelector
(149, 4030871717, 368345, 0), -- SpellEffect
(389, 4096770149, 20676, 0), -- SpellAuraOptions
(405, 3322146344, 206884, 0), -- SpellMisc
(75, 261693969, 46763, 0), -- QuestV2CliTask
(75, 986198281, 46763, 0), -- QuestV2
(325, 844464874, 30621, 0), -- ItemXBonusTree
(481, 2035710060, 14960, 0), -- JournalEncounterSection
(363, 844464874, 22003, 0), -- ItemXBonusTree
(272, 4030871717, 344114, 0), -- SpellEffect
(455, 4030871717, 323056, 0), -- SpellEffect
(356, 844464874, 30565, 0), -- ItemXBonusTree
(475, 184881520, 6615, 1), -- JournalSectionXDifficulty
(288, 2199425034, 4999, 0), -- ItemBonus
(314, 844464874, 30603, 0), -- ItemXBonusTree
(293, 2199425034, 5673, 0), -- ItemBonus
(37, 20077728, 288798, 0), -- QuestObjective
(364, 844464874, 30581, 0), -- ItemXBonusTree
(88, 261693969, 46279, 0), -- QuestV2CliTask
(88, 986198281, 46279, 0), -- QuestV2
(303, 2199425034, 1729, 0), -- ItemBonus
(12, 3322146344, 182635, 0), -- SpellMisc
(324, 844464874, 30619, 0), -- ItemXBonusTree
(47, 20077728, 289054, 0), -- QuestObjective
(343, 844464874, 26434, 0), -- ItemXBonusTree
(155, 367248955, 5089, 0), -- ArtifactPowerRank
(355, 844464874, 30563, 0), -- ItemXBonusTree
(329, 844464874, 26529, 0), -- ItemXBonusTree
(458, 4030871717, 323027, 0), -- SpellEffect
(237, 4030871717, 322515, 0), -- SpellEffect
(125, 2712461791, 12292, 0), -- SpellPower
(252, 3517652874, 96, 0), -- PvpScalingEffect
(498, 1880017466, 6598, 0), -- CurvePoint
(480, 184881520, 6620, 1), -- JournalSectionXDifficulty
(282, 3776013982, 193029, 0), -- Spell
(16, 3348406326, 11728, 0), -- ConversationLine
(217, 4030871717, 356255, 0), -- SpellEffect
(50, 20077728, 289057, 0), -- QuestObjective
(514, 1548466975, 16053, 1), -- AreaTriggerActionSet
(500, 1272569722, 1755, 0), -- Curve
(499, 1272569722, 1754, 0), -- Curve
(497, 1880017466, 9245, 0), -- CurvePoint
(496, 1880017466, 9246, 0), -- CurvePoint
(495, 1880017466, 6600, 0), -- CurvePoint
(494, 3108775943, 49401, 0), -- PlayerCondition
(493, 3108775943, 49404, 0), -- PlayerCondition
(492, 3108775943, 49403, 0), -- PlayerCondition
(491, 3108775943, 49402, 0), -- PlayerCondition
(490, 3108775943, 47897, 0), -- PlayerCondition
(482, 2035710060, 15321, 0), -- JournalEncounterSection
(479, 184881520, 6619, 1), -- JournalSectionXDifficulty
(478, 184881520, 6618, 1), -- JournalSectionXDifficulty
(477, 184881520, 6617, 1), -- JournalSectionXDifficulty
(476, 184881520, 6616, 1), -- JournalSectionXDifficulty
(474, 184881520, 6838, 0), -- JournalSectionXDifficulty
(473, 184881520, 6837, 0), -- JournalSectionXDifficulty
(472, 184881520, 6836, 0), -- JournalSectionXDifficulty
(471, 184881520, 6835, 0), -- JournalSectionXDifficulty
(470, 184881520, 6840, 0), -- JournalSectionXDifficulty
(469, 184881520, 6839, 0), -- JournalSectionXDifficulty
(465, 4096770149, 19697, 0), -- SpellAuraOptions
(463, 4030871717, 342169, 0), -- SpellEffect
(462, 4030871717, 342168, 0), -- SpellEffect
(461, 4030871717, 342167, 0), -- SpellEffect
(460, 4030871717, 323029, 0), -- SpellEffect
(459, 4030871717, 323028, 0), -- SpellEffect
(457, 4030871717, 323058, 0), -- SpellEffect
(456, 4030871717, 323057, 0), -- SpellEffect
(454, 4030871717, 361390, 0), -- SpellEffect
(453, 4030871717, 361389, 0), -- SpellEffect
(451, 4030871717, 339658, 0), -- SpellEffect
(450, 4030871717, 339657, 0), -- SpellEffect
(449, 4030871717, 339656, 0), -- SpellEffect
(448, 4030871717, 270037, 0), -- SpellEffect
(447, 4030871717, 270194, 0), -- SpellEffect
(404, 3322146344, 206832, 0), -- SpellMisc
(403, 4030871717, 351900, 0), -- SpellEffect
(402, 4030871717, 376954, 0), -- SpellEffect
(401, 4030871717, 352000, 0), -- SpellEffect
(399, 3386943305, 121848, 0), -- CreatureDifficulty
(397, 3322146344, 10412, 0), -- SpellMisc
(396, 3776013982, 23239, 0), -- Spell
(395, 3776013982, 23250, 0), -- Spell
(394, 3776013982, 23241, 0), -- Spell
(393, 2202435563, 829329, 1), -- QuestPOIPoint
(392, 2921112328, 383620, 1), -- QuestPOIBlob
(391, 986198281, 46213, 0), -- QuestV2
(391, 261693969, 46213, 1), -- QuestV2CliTask
(390, 4096770149, 23152, 0), -- SpellAuraOptions
(388, 2707547180, 33068, 1), -- ModelFileData
(387, 261693969, 45799, 1), -- QuestV2CliTask
(387, 986198281, 45799, 0), -- QuestV2
(386, 3386943305, 127770, 1), -- CreatureDifficulty
(385, 492039028, 23223, 0), -- WorldStateExpression
(384, 492039028, 23222, 0), -- WorldStateExpression
(382, 492039028, 23224, 0), -- WorldStateExpression
(369, 844464874, 30591, 0), -- ItemXBonusTree
(368, 844464874, 30589, 0), -- ItemXBonusTree
(367, 844464874, 30587, 0), -- ItemXBonusTree
(366, 844464874, 30585, 0), -- ItemXBonusTree
(365, 844464874, 30583, 0), -- ItemXBonusTree
(362, 844464874, 30577, 0), -- ItemXBonusTree
(361, 844464874, 30575, 0), -- ItemXBonusTree
(360, 844464874, 30573, 0), -- ItemXBonusTree
(359, 844464874, 30571, 0), -- ItemXBonusTree
(358, 844464874, 30569, 0), -- ItemXBonusTree
(357, 844464874, 30567, 0), -- ItemXBonusTree
(354, 844464874, 26457, 0), -- ItemXBonusTree
(353, 844464874, 26454, 0), -- ItemXBonusTree
(352, 844464874, 47957, 0), -- ItemXBonusTree
(351, 844464874, 31523, 0), -- ItemXBonusTree
(350, 844464874, 47954, 0), -- ItemXBonusTree
(349, 844464874, 47951, 0), -- ItemXBonusTree
(348, 844464874, 47948, 0), -- ItemXBonusTree
(347, 844464874, 47945, 0), -- ItemXBonusTree
(346, 844464874, 30625, 0), -- ItemXBonusTree
(345, 844464874, 47942, 0), -- ItemXBonusTree
(344, 844464874, 47939, 0), -- ItemXBonusTree
(342, 844464874, 47936, 0), -- ItemXBonusTree
(341, 844464874, 47933, 0), -- ItemXBonusTree
(340, 844464874, 47930, 0), -- ItemXBonusTree
(339, 844464874, 47927, 0), -- ItemXBonusTree
(338, 844464874, 47924, 0), -- ItemXBonusTree
(337, 844464874, 30579, 0), -- ItemXBonusTree
(336, 844464874, 47921, 0), -- ItemXBonusTree
(335, 844464874, 31517, 0), -- ItemXBonusTree
(334, 844464874, 47918, 0), -- ItemXBonusTree
(333, 844464874, 47915, 0), -- ItemXBonusTree
(332, 844464874, 47912, 0), -- ItemXBonusTree
(331, 844464874, 31526, 0), -- ItemXBonusTree
(330, 844464874, 30627, 0), -- ItemXBonusTree
(328, 844464874, 31520, 0), -- ItemXBonusTree
(327, 844464874, 30623, 0), -- ItemXBonusTree
(326, 844464874, 26526, 0), -- ItemXBonusTree
(323, 844464874, 30617, 0), -- ItemXBonusTree
(322, 844464874, 30615, 0), -- ItemXBonusTree
(321, 844464874, 30613, 0), -- ItemXBonusTree
(320, 844464874, 30484, 0), -- ItemXBonusTree
(319, 844464874, 30611, 0), -- ItemXBonusTree
(318, 844464874, 30482, 0), -- ItemXBonusTree
(317, 844464874, 30609, 0), -- ItemXBonusTree
(316, 844464874, 30607, 0), -- ItemXBonusTree
(315, 844464874, 30605, 0), -- ItemXBonusTree
(313, 844464874, 30601, 0), -- ItemXBonusTree
(312, 844464874, 30599, 0), -- ItemXBonusTree
(311, 844464874, 30597, 0), -- ItemXBonusTree
(310, 844464874, 30595, 0), -- ItemXBonusTree
(309, 844464874, 30593, 0), -- ItemXBonusTree
(308, 2199425034, 5465, 0), -- ItemBonus
(307, 2199425034, 5454, 0), -- ItemBonus
(306, 2199425034, 5451, 0), -- ItemBonus
(304, 2199425034, 1730, 0), -- ItemBonus
(302, 2199425034, 5001, 0), -- ItemBonus
(301, 2199425034, 5681, 0), -- ItemBonus
(300, 2199425034, 5680, 0), -- ItemBonus
(299, 2199425034, 5679, 0), -- ItemBonus
(298, 2199425034, 5678, 0), -- ItemBonus
(297, 2199425034, 5677, 0), -- ItemBonus
(296, 2199425034, 5676, 0), -- ItemBonus
(295, 2199425034, 5675, 0), -- ItemBonus
(294, 2199425034, 5674, 0), -- ItemBonus
(292, 2199425034, 5025, 0), -- ItemBonus
(291, 2199425034, 5337, 0), -- ItemBonus
(290, 2199425034, 5641, 0), -- ItemBonus
(289, 2199425034, 5000, 0), -- ItemBonus
(287, 2199425034, 5638, 0), -- ItemBonus
(286, 3776013982, 183442, 0), -- Spell
(285, 3776013982, 183441, 0), -- Spell
(284, 3776013982, 183440, 0), -- Spell
(283, 3776013982, 193030, 0), -- Spell
(281, 3776013982, 193028, 0), -- Spell
(280, 3776013982, 193027, 0), -- Spell
(276, 4030871717, 345951, 0), -- SpellEffect
(275, 4030871717, 265690, 0), -- SpellEffect
(274, 4030871717, 265688, 0), -- SpellEffect
(273, 4030871717, 265686, 0), -- SpellEffect
(271, 4030871717, 283180, 0), -- SpellEffect
(270, 4030871717, 283178, 0), -- SpellEffect
(269, 4030871717, 283176, 0), -- SpellEffect
(268, 4030871717, 283174, 0), -- SpellEffect
(264, 3322146344, 177175, 0), -- SpellMisc
(263, 3834752085, 67233, 0), -- ItemModifiedAppearance
(262, 680438657, 24995, 0), -- SpellClassOptions
(261, 4030871717, 299596, 0), -- SpellEffect
(260, 4030871717, 468467, 0), -- SpellEffect
(259, 4030871717, 468468, 0), -- SpellEffect
(258, 3517652874, 93, 0), -- PvpScalingEffect
(257, 3517652874, 115, 0), -- PvpScalingEffect
(256, 3517652874, 112, 0), -- PvpScalingEffect
(255, 3517652874, 107, 0), -- PvpScalingEffect
(254, 3517652874, 101, 0), -- PvpScalingEffect
(253, 3517652874, 97, 0), -- PvpScalingEffect
(250, 3322146344, 190398, 0), -- SpellMisc
(249, 3322146344, 220597, 0), -- SpellMisc
(248, 3322146344, 173443, 0), -- SpellMisc
(247, 3517652874, 63, 0), -- PvpScalingEffect
(246, 3517652874, 78, 0), -- PvpScalingEffect
(245, 3517652874, 52, 0), -- PvpScalingEffect
(244, 3517652874, 48, 0), -- PvpScalingEffect
(243, 2712461791, 11756, 0), -- SpellPower
(242, 3776013982, 216762, 0), -- Spell
(241, 4193483863, 24248, 0), -- SpellCooldowns
(240, 4030871717, 302493, 0), -- SpellEffect
(239, 4030871717, 321880, 0), -- SpellEffect
(238, 4030871717, 266740, 0), -- SpellEffect
(236, 4030871717, 321944, 0), -- SpellEffect
(235, 4030871717, 316999, 0), -- SpellEffect
(234, 4030871717, 344064, 0), -- SpellEffect
(233, 4030871717, 293474, 0), -- SpellEffect
(232, 4030871717, 335616, 0), -- SpellEffect
(231, 4030871717, 321952, 0), -- SpellEffect
(230, 4096770149, 22148, 1), -- SpellAuraOptions
(229, 3322146344, 187618, 0), -- SpellMisc
(228, 3322146344, 189793, 0), -- SpellMisc
(227, 3517652874, 188, 0), -- PvpScalingEffect
(226, 3517652874, 195, 0), -- PvpScalingEffect
(225, 3517652874, 196, 0), -- PvpScalingEffect
(224, 3517652874, 192, 0), -- PvpScalingEffect
(223, 3764692828, 30622, 0), -- SpellTargetRestrictions
(221, 2712461791, 11129, 0), -- SpellPower
(220, 4030871717, 95, 0), -- SpellEffect
(219, 4030871717, 321246, 0), -- SpellEffect
(218, 4030871717, 313660, 0), -- SpellEffect
(216, 4030871717, 303208, 0), -- SpellEffect
(215, 4030871717, 321234, 0), -- SpellEffect
(214, 4030871717, 3283, 0), -- SpellEffect
(213, 4030871717, 242, 0), -- SpellEffect
(212, 4030871717, 254257, 0), -- SpellEffect
(211, 4030871717, 302733, 0), -- SpellEffect
(210, 4030871717, 290126, 0), -- SpellEffect
(209, 4030871717, 25010, 0), -- SpellEffect
(208, 4030871717, 288648, 0), -- SpellEffect
(207, 4030871717, 289921, 0), -- SpellEffect
(206, 4030871717, 290246, 0), -- SpellEffect
(205, 4030871717, 7301, 0), -- SpellEffect
(204, 4030871717, 288322, 0), -- SpellEffect
(203, 4030871717, 288321, 0), -- SpellEffect
(202, 4030871717, 351200, 0), -- SpellEffect
(201, 4193483863, 24927, 0), -- SpellCooldowns
(200, 3517652874, 295, 0), -- PvpScalingEffect
(199, 3517652874, 297, 0), -- PvpScalingEffect
(198, 3517652874, 296, 0); -- PvpScalingEffect

REPLACE INTO `hotfix_data` (`Id`, `TableHash`, `RecordId`, `Deleted`) VALUES
(197, 4030871717, 68093, 0), -- SpellEffect
(196, 4030871717, 55128, 0), -- SpellEffect
(195, 4030871717, 55127, 0), -- SpellEffect
(194, 4030871717, 44468, 0), -- SpellEffect
(193, 4030871717, 301517, 0), -- SpellEffect
(192, 4030871717, 301448, 0), -- SpellEffect
(191, 4096770149, 20768, 0), -- SpellAuraOptions
(187, 3517652874, 25, 0), -- PvpScalingEffect
(186, 4030871717, 132982, 0), -- SpellEffect
(185, 3834752085, 67243, 0), -- ItemModifiedAppearance
(183, 1417785224, 115556, 1), -- TransmogHoliday
(183, 2442913102, 115556, 0), -- ItemSparse
(183, 1344507586, 115556, 0), -- Item
(182, 3322146344, 176869, 0), -- SpellMisc
(181, 3322146344, 176916, 0), -- SpellMisc
(171, 680438657, 29435, 0), -- SpellClassOptions
(170, 680438657, 29434, 0), -- SpellClassOptions
(168, 4096770149, 9073, 0), -- SpellAuraOptions
(167, 4030871717, 464923, 0), -- SpellEffect
(166, 4030871717, 465705, 0), -- SpellEffect
(165, 4030871717, 300653, 0), -- SpellEffect
(164, 4030871717, 300652, 0), -- SpellEffect
(163, 4030871717, 315241, 0), -- SpellEffect
(162, 4030871717, 315240, 0), -- SpellEffect
(161, 367248955, 7319, 0), -- ArtifactPowerRank
(160, 367248955, 7318, 0), -- ArtifactPowerRank
(159, 367248955, 5093, 0), -- ArtifactPowerRank
(158, 367248955, 5092, 0), -- ArtifactPowerRank
(157, 367248955, 5091, 0), -- ArtifactPowerRank
(156, 367248955, 5090, 0), -- ArtifactPowerRank
(154, 367248955, 5056, 0), -- ArtifactPowerRank
(152, 4030871717, 369239, 0), -- SpellEffect
(151, 4030871717, 368339, 0), -- SpellEffect
(150, 4030871717, 368338, 0), -- SpellEffect
(148, 3322146344, 140558, 0), -- SpellMisc
(142, 3108775943, 51413, 0), -- PlayerCondition
(141, 3108775943, 51412, 0), -- PlayerCondition
(140, 3108775943, 51410, 0), -- PlayerCondition
(139, 240389885, 3301, 0), -- UnitCondition
(138, 240389885, 3300, 0), -- UnitCondition
(137, 4030871717, 356287, 0), -- SpellEffect
(136, 4030871717, 356060, 0), -- SpellEffect
(135, 4030871717, 362042, 0), -- SpellEffect
(134, 4030871717, 356117, 0), -- SpellEffect
(133, 4030871717, 367015, 0), -- SpellEffect
(132, 4030871717, 356290, 0), -- SpellEffect
(131, 4030871717, 324569, 0), -- SpellEffect
(130, 3689412649, 55973, 0), -- SpellCategories
(129, 3517652874, 422, 0), -- PvpScalingEffect
(128, 3517652874, 421, 0), -- PvpScalingEffect
(127, 3517652874, 420, 0), -- PvpScalingEffect
(126, 4096770149, 22098, 0), -- SpellAuraOptions
(122, 1019780096, 349, 0), -- SpellDescriptionVariables
(121, 4030871717, 288995, 0), -- SpellEffect
(120, 4030871717, 3248, 0), -- SpellEffect
(117, 3322146344, 212421, 0), -- SpellMisc
(116, 3322146344, 212424, 0), -- SpellMisc
(115, 261693969, 46184, 0), -- QuestV2CliTask
(115, 986198281, 46184, 0), -- QuestV2
(114, 986198281, 46192, 0), -- QuestV2
(114, 261693969, 46192, 0), -- QuestV2CliTask
(113, 261693969, 46191, 0), -- QuestV2CliTask
(113, 986198281, 46191, 0), -- QuestV2
(112, 261693969, 46190, 0), -- QuestV2CliTask
(112, 986198281, 46190, 0), -- QuestV2
(111, 986198281, 46189, 0), -- QuestV2
(111, 261693969, 46189, 0), -- QuestV2CliTask
(110, 261693969, 46188, 0), -- QuestV2CliTask
(110, 986198281, 46188, 0), -- QuestV2
(109, 986198281, 46183, 0), -- QuestV2
(109, 261693969, 46183, 0), -- QuestV2CliTask
(108, 986198281, 46186, 0), -- QuestV2
(108, 261693969, 46186, 0), -- QuestV2CliTask
(107, 986198281, 46185, 0), -- QuestV2
(107, 261693969, 46185, 0), -- QuestV2CliTask
(106, 261693969, 45928, 0), -- QuestV2CliTask
(106, 986198281, 45928, 0), -- QuestV2
(105, 261693969, 45927, 0), -- QuestV2CliTask
(105, 986198281, 45927, 0), -- QuestV2
(104, 261693969, 45926, 0), -- QuestV2CliTask
(104, 986198281, 45926, 0), -- QuestV2
(103, 986198281, 45925, 0), -- QuestV2
(103, 261693969, 45925, 0), -- QuestV2CliTask
(102, 986198281, 45924, 0), -- QuestV2
(102, 261693969, 45924, 0), -- QuestV2CliTask
(101, 986198281, 45923, 0), -- QuestV2
(101, 261693969, 45923, 0), -- QuestV2CliTask
(100, 986198281, 45922, 0), -- QuestV2
(100, 261693969, 45922, 0), -- QuestV2CliTask
(99, 986198281, 45921, 0), -- QuestV2
(99, 261693969, 45921, 0), -- QuestV2CliTask
(98, 986198281, 46170, 0), -- QuestV2
(98, 261693969, 46170, 0), -- QuestV2CliTask
(96, 986198281, 46168, 0), -- QuestV2
(96, 261693969, 46168, 0), -- QuestV2CliTask
(95, 986198281, 46167, 0), -- QuestV2
(95, 261693969, 46167, 0), -- QuestV2CliTask
(94, 986198281, 46166, 0), -- QuestV2
(94, 261693969, 46166, 0), -- QuestV2CliTask
(93, 261693969, 46165, 0), -- QuestV2CliTask
(93, 986198281, 46165, 0), -- QuestV2
(92, 261693969, 46164, 0), -- QuestV2CliTask
(92, 986198281, 46164, 0), -- QuestV2
(91, 986198281, 46163, 0), -- QuestV2
(91, 261693969, 46163, 0), -- QuestV2CliTask
(90, 986198281, 46162, 0), -- QuestV2
(90, 261693969, 46162, 0), -- QuestV2CliTask
(89, 986198281, 46161, 0), -- QuestV2
(89, 261693969, 46161, 0), -- QuestV2CliTask
(87, 986198281, 46021, 0), -- QuestV2
(87, 261693969, 46021, 0), -- QuestV2CliTask
(85, 261693969, 46016, 0), -- QuestV2CliTask
(85, 986198281, 46016, 0), -- QuestV2
(84, 986198281, 46015, 0), -- QuestV2
(84, 261693969, 46015, 0), -- QuestV2CliTask
(83, 261693969, 46014, 0), -- QuestV2CliTask
(83, 986198281, 46014, 0), -- QuestV2
(82, 261693969, 46013, 0), -- QuestV2CliTask
(82, 986198281, 46013, 0), -- QuestV2
(81, 261693969, 46012, 0), -- QuestV2CliTask
(81, 986198281, 46012, 0), -- QuestV2
(80, 986198281, 46011, 0), -- QuestV2
(80, 261693969, 46011, 0), -- QuestV2CliTask
(79, 986198281, 46010, 0), -- QuestV2
(79, 261693969, 46010, 0), -- QuestV2CliTask
(78, 261693969, 46008, 0), -- QuestV2CliTask
(78, 986198281, 46008, 0), -- QuestV2
(77, 261693969, 46006, 0), -- QuestV2CliTask
(77, 986198281, 46006, 0), -- QuestV2
(76, 261693969, 46766, 0), -- QuestV2CliTask
(76, 986198281, 46766, 0), -- QuestV2
(74, 986198281, 46187, 0), -- QuestV2
(74, 261693969, 46187, 0), -- QuestV2CliTask
(73, 20077728, 289017, 0), -- QuestObjective
(72, 20077728, 289016, 0), -- QuestObjective
(71, 20077728, 289015, 0), -- QuestObjective
(70, 20077728, 289014, 0), -- QuestObjective
(69, 20077728, 289013, 0), -- QuestObjective
(68, 20077728, 289012, 0), -- QuestObjective
(66, 20077728, 289010, 0), -- QuestObjective
(65, 20077728, 289009, 0), -- QuestObjective
(64, 20077728, 289008, 0), -- QuestObjective
(63, 20077728, 289062, 0), -- QuestObjective
(62, 20077728, 288740, 0), -- QuestObjective
(61, 20077728, 288739, 0), -- QuestObjective
(60, 20077728, 288738, 0), -- QuestObjective
(59, 20077728, 288737, 0), -- QuestObjective
(58, 20077728, 288736, 0), -- QuestObjective
(57, 20077728, 288735, 0), -- QuestObjective
(56, 20077728, 288734, 0), -- QuestObjective
(55, 20077728, 288733, 0), -- QuestObjective
(54, 20077728, 289570, 0), -- QuestObjective
(53, 20077728, 289572, 0), -- QuestObjective
(52, 20077728, 289059, 0), -- QuestObjective
(51, 20077728, 289058, 0), -- QuestObjective
(49, 20077728, 289056, 0), -- QuestObjective
(48, 20077728, 289055, 0), -- QuestObjective
(46, 20077728, 289063, 0), -- QuestObjective
(45, 20077728, 288806, 0), -- QuestObjective
(44, 20077728, 289061, 0), -- QuestObjective
(43, 20077728, 289060, 0), -- QuestObjective
(42, 20077728, 288803, 0), -- QuestObjective
(41, 20077728, 288802, 0), -- QuestObjective
(40, 20077728, 288801, 0), -- QuestObjective
(39, 20077728, 288800, 0), -- QuestObjective
(38, 20077728, 288799, 0), -- QuestObjective
(36, 20077728, 288797, 0), -- QuestObjective
(35, 20077728, 288796, 0), -- QuestObjective
(34, 20077728, 288795, 0), -- QuestObjective
(33, 20077728, 288794, 0), -- QuestObjective
(32, 20077728, 289168, 0), -- QuestObjective
(31, 4072756116, 229, 0), -- ItemLevelSelector
(30, 4072756116, 168, 0), -- ItemLevelSelector
(28, 4072756116, 113, 0), -- ItemLevelSelector
(27, 4072756116, 46, 0), -- ItemLevelSelector
(26, 4072756116, 136, 0), -- ItemLevelSelector
(25, 4072756116, 135, 0), -- ItemLevelSelector
(24, 4072756116, 134, 0), -- ItemLevelSelector
(23, 4072756116, 166, 0), -- ItemLevelSelector
(22, 4072756116, 34, 0), -- ItemLevelSelector
(20, 3348406326, 11727, 0), -- ConversationLine
(19, 3348406326, 12689, 0), -- ConversationLine
(18, 3348406326, 12687, 0), -- ConversationLine
(17, 3348406326, 12688, 0), -- ConversationLine
(14, 1972272076, 696, 0), -- Holidays
(13, 2534865996, 1303, 0), -- ScheduledWorldStateXUniqCat
(11, 3322146344, 180529, 0), -- SpellMisc
(10, 3517652874, 485, 0), -- PvpScalingEffect
(9, 3517652874, 492, 0), -- PvpScalingEffect
(8, 3517652874, 491, 0), -- PvpScalingEffect
(7, 3517652874, 490, 0), -- PvpScalingEffect
(6, 4030871717, 312614, 0), -- SpellEffect
(5, 4030871717, 305378, 0), -- SpellEffect
(4, 4030871717, 464520, 0), -- SpellEffect
(2, 1972272076, 732, 0), -- Holidays
(1, 1972272076, 731, 0); -- Holidays



