# TrinityCore - WowPacketParser
# File name: 7.3.5_26124_三月-01-1957 -艾萨拉之眼.awps.pkt
# Detected build: V7_3_5_26124
# Detected locale: zhCN
# Targeted database: Legion
# Parsing date: 03/04/2018 13:58:25

UPDATE `areatrigger_template` SET `Type`=1, `Flags`=0, `Data0`=2.5, `Data1`=2.5, `Data2`=3, `Data3`=2.5, `Data4`=2.5, `Data5`=3 WHERE `Id`=6197;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=9960;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=9671;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=9647;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=9640;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=9683;
UPDATE `areatrigger_template` SET `Flags`=0 WHERE `Id`=9482;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=10655;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=9962;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=9574;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=9878;



DELETE FROM `spell_areatrigger` WHERE (`AreaTriggerId`=10727) OR (`AreaTriggerId`=10665) OR (`AreaTriggerId`=14691) OR (`AreaTriggerId`=9671) OR (`AreaTriggerId`=9647) OR (`AreaTriggerId`=16713) OR (`AreaTriggerId`=6197) OR (`AreaTriggerId`=10713) OR (`AreaTriggerId`=9640) OR (`AreaTriggerId`=11908) OR (`AreaTriggerId`=9683) OR (`AreaTriggerId`=9482) OR (`AreaTriggerId`=13120) OR (`AreaTriggerId`=10655) OR (`AreaTriggerId`=11266) OR (`AreaTriggerId`=9962) OR (`AreaTriggerId`=9960) OR (`AreaTriggerId`=11023) OR (`AreaTriggerId`=9574) OR (`AreaTriggerId`=9878);
INSERT INTO `spell_areatrigger` (`SpellMiscId`, `AreaTriggerId`, `MoveCurveId`, `ScaleCurveId`, `MorphCurveId`, `FacingCurveId`, `DecalPropertiesId`, `TimeToTarget`, `TimeToTargetScale`, `VerifiedBuild`) VALUES
(6039, 10727, 0, 0, 0, 0, 0, 0, 1000, 26124), -- SpellId : 228973
(5977, 10665, 0, 0, 0, 0, 0, 0, 20000, 26124), -- SpellId : 204255
(9769, 14691, 0, 0, 0, 0, 0, 0, 18000, 26124), -- SpellId : 206817
(4950, 9671, 0, 1574, 0, 0, 0, 180000, 180000, 26124), -- SpellId : 192753
(4930, 9647, 0, 0, 0, 0, 0, 0, 0, 26124), -- SpellId : 192673
(12002, 16713, 0, 0, 0, 0, 0, 0, 6000, 26124), -- SpellId : 256820
(8284, 6197, 0, 0, 0, 0, 0, 0, 5000, 26124), -- SpellId : 223114
(6026, 10713, 0, 0, 0, 0, 0, 0, 5000, 26124), -- SpellId : 204475
(4923, 9640, 0, 0, 0, 0, 0, 0, 0, 26124), -- SpellId : 192632
(7478, 11908, 0, 0, 0, 0, 0, 0, 90000, 26124), -- SpellId : 216721
(4968, 9683, 0, 0, 0, 0, 0, 0, 20000, 26124), -- SpellId : 193054
(4756, 9482, 0, 0, 0, 0, 0, 0, 8000, 26124), -- SpellId : 191034
(9080, 13120, 0, 0, 0, 0, 0, 6500, 10000, 26124), -- SpellId : 230241
(5966, 10655, 0, 0, 0, 0, 0, 0, 3000, 26124), -- SpellId : 195828
(6710, 11266, 0, 0, 0, 0, 0, 0, 20000, 26124), -- SpellId : 203795
(5238, 9962, 0, 0, 0, 0, 0, 0, 11999, 26124), -- SpellId : 196144
(5236, 9960, 0, 0, 0, 0, 0, 0, 0, 26124), -- SpellId : 196107
(6351, 11023, 0, 0, 0, 0, 0, 0, 1000, 26124), -- SpellId : 207684
(4856, 9574, 0, 0, 0, 0, 22, 0, 120000, 26124), -- SpellId : 191856
(5149, 9878, 0, 0, 0, 0, 0, 0, 15000, 26124); -- SpellId : 195046

/*
DELETE FROM `conversation_actors` WHERE (`ConversationId`=2900 AND `Idx`=0);
INSERT INTO `conversation_actors` (`ConversationId`, `ConversationActorId`, `Idx`, `VerifiedBuild`) VALUES
(2900, UNKNOWN, 0, 26124);
*/

SET NAMES 'utf8';
SET NAMES 'latin1';


SET @CGUID=442499; -- 800
SET @OGUID=100505; -- 50

DELETE FROM `creature` WHERE `map`=1456 AND `VerifiedBuild`<26124;
DELETE FROM `gameobject` WHERE `map`=1456 AND `VerifiedBuild`<26124;

DELETE FROM `creature` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+682;
INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
(@CGUID+61, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3884.863, 4509.048, 81.78993, 2.507887, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2)
(@CGUID+62, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3878.79, 4519.562, 82.59285, 3.418034, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2)
(@CGUID+63, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3804.725, 4527.355, 55.62777, 1.423784, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+64, 99901, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3934.627, 4566.394, 198.6553, 5.252301, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (possible waypoints or random movement)
(@CGUID+65, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3833.797, 4549.335, 61.19432, 4.630162, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-) (possible waypoints or random movement)
(@CGUID+66, 100216, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3848.38, 4424.694, 69.92361, 0.09952233, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨牧鱼者 (Area: -Unknown- - Difficulty: 2)
(@CGUID+67, 111639, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3888.788, 4502.015, 85.75974, 0.9596546, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- -Unknown- (Area: -Unknown- - Difficulty: 2)
(@CGUID+68, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3838.712, 4518.197, 62.48258, 2.142091, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+69, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3798.97, 4470.787, 53.72005, 4.594562, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2)
(@CGUID+70, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3818.846, 4466.399, 57.15327, 3.827921, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+71, 100216, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3787.993, 4505.816, 52.09363, 3.294533, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨牧鱼者 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+72, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3903.317, 4521.511, 86.5155, 4.195291, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+73, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3876.953, 4530.721, 80.53241, 5.981532, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-)
(@CGUID+74, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3846.186, 4436.043, 67.00784, 6.080897, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+75, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3846.71, 4443.565, 64.93796, 5.898069, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2)
(@CGUID+76, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3893.068, 4503.733, 87.47307, 2.078304, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-)
(@CGUID+77, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3851.622, 4493.726, 68.05283, 5.776491, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2)
(@CGUID+78, 100216, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3800.632, 4463.458, 54.46222, 0.8604679, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨牧鱼者 (Area: -Unknown- - Difficulty: 2)
(@CGUID+79, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3833.8, 4528.042, 61.52602, 1.611757, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2) (Auras: 115385 - -Unknown-)
(@CGUID+80, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3783.972, 4544.173, 52.99039, 4.556291, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2) (Auras: 115385 - -Unknown-)
(@CGUID+81, 95861, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3849.087, 4430.978, 69.19271, 6.221852, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨神谕者 (Area: -Unknown- - Difficulty: 2)
(@CGUID+82, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3845.988, 4495.856, 65.28819, 4.809277, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+83, 100216, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3873.186, 4495.281, 78.28262, 2.413152, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨牧鱼者 (Area: -Unknown- - Difficulty: 2)
(@CGUID+84, 100216, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3814.583, 4506.3, 56.9316, 2.82829, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨牧鱼者 (Area: -Unknown- - Difficulty: 2)
(@CGUID+85, 95861, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3804.625, 4467.744, 55.33065, 5.817456, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨神谕者 (Area: -Unknown- - Difficulty: 2)
(@CGUID+86, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3780.99, 4531.944, 51.76878, 2.23505, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+87, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3843.46, 4390.252, 72.80383, 5.426136, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2)
(@CGUID+88, 95861, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3781.459, 4477.3, 48.79967, 1.939901, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨神谕者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+89, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3826.151, 4406.727, 66.1554, 1.624754, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+90, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3738.21, 4528.859, 42.23631, 3.586396, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+91, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3753.447, 4562.333, 42.30847, 4.098383, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+92, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3810.323, 4367.945, 45.52257, 4.884998, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2)
(@CGUID+93, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3761.301, 4464.403, 44.3979, 5.103421, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-)
(@CGUID+94, 99901, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -4015.564, 4523.866, 264.9584, 6.254206, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (possible waypoints or random movement)
(@CGUID+95, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3840.384, 4384.999, 73.26563, 1.897439, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+96, 97171, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3737.581, 4602.676, 40.19577, 0.6579589, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 积怨奥术师 (Area: -Unknown- - Difficulty: 2) (Auras: 199865 - -Unknown-, 197115 - -Unknown-) (possible waypoints or random movement)
(@CGUID+97, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3756.955, 4431.997, 42.39997, 3.143989, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2) (Auras: 115385 - -Unknown-)
(@CGUID+98, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3793.21, 4399.177, 46.63749, 6.011243, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+99, 95861, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3736.434, 4491.454, 43.52844, 0.1484137, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 积怨神谕者 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+100, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3775.851, 4445.05, 44.43395, 4.557513, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+101, 100216, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3758.625, 4413.126, 44.11684, 2.617293, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨牧鱼者 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+102, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3756.431, 4424.475, 42.46479, 2.785439, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+103, 91782, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3775.543, 4459.521, 45.74858, 4.74371, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 积怨碾压者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+104, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3794.165, 4464.7, 52.22652, 3.121929, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+105, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3795.213, 4489.428, 52.68611, 3.982456, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+106, 95861, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3759.332, 4419.409, 43.75779, 2.650062, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 积怨神谕者 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+107, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3784.903, 4481.863, 50.04811, 5.401907, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+108, 91782, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3754.115, 4479.903, 44.06279, 1.474918, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 积怨碾压者 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+109, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3733.577, 4497.911, 43.70977, 5.311149, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-) (possible waypoints or random movement)
(@CGUID+110, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3827.696, 4412.619, 66.46181, 5.15345, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2)
(@CGUID+111, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3765.915, 4405.832, 44.93604, 3.437147, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+112, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3744.734, 4346.835, 39.07639, 2.042952, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+113, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3748.175, 4384.482, 46.40156, 5.513045, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+114, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3787.188, 4371.109, 43.73335, 0, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+115, 100216, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3754.026, 4339.96, 36.1684, 1.874807, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨牧鱼者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+116, 91786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3661.115, 4596.637, 21.74515, 2.035127, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+117, 95861, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3726.943, 4435.109, 34.91647, 1.02457, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨神谕者 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+118, 99901, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -4073.649, 4475.049, 253.1595, 0.2895395, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (possible waypoints or random movement)
(@CGUID+119, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3744.651, 4379.51, 46.47743, 1.984351, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+120, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3696.061, 4622.279, 29.16802, 5.002584, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-)
(@CGUID+121, 91782, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3788.86, 4325.575, 33.10938, 0.6181048, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨碾压者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+122, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3779.762, 4334.503, 33.99703, 3.016714, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+123, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3784.502, 4341.554, 36.2691, 4.528144, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+124, 91784, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3682.653, 4417.024, 32.44474, 5.828131, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 督军帕杰什 (Area: -Unknown- - Difficulty: 2) (Auras: 202146 - -Unknown-) (possible waypoints or random movement)
(@CGUID+125, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3810.391, 4361.857, 44.66529, 1.356302, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+126, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3757.785, 4352.339, 38.29422, 1.461217, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+127, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3721.233, 4438.389, 34.12246, 3.141301, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2) (Auras: 115385 - -Unknown-)
(@CGUID+128, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3809.693, 4301.683, 26.56597, 5.856925, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+129, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3770.711, 4320.477, 29.89547, 1.242558, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+130, 95861, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3750.299, 4345.063, 37.72743, 1.907576, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨神谕者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+131, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3728.144, 4440.523, 35.77597, 5.694541, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+132, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3804.702, 4298.192, 25.61675, 2.32823, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+133, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3756.567, 4376.771, 43.73734, 3.669225, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+134, 100216, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3782.221, 4328.304, 32.57986, 2.04423, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨牧鱼者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+135, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3740.038, 4352.73, 41.42014, 2.401503, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+136, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3699.177, 4398.903, 32.60895, 3.913966, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+137, 91786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3587.659, 4617.206, 8.496846, 2.054546, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+138, 99901, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -4118, 4606.085, 300.4511, 5.884043, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (possible waypoints or random movement)
(@CGUID+139, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3784.767, 4291.497, 24.42724, 5.309598, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+140, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3644.307, 4633.536, 12.40173, 5.173083, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+141, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3777.894, 4209.539, 22.09402, 0.4880871, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+142, 91783, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3775.274, 4215.726, 22.55362, 5.497424, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨织雷者 (Area: -Unknown- - Difficulty: 2) (Auras: 196786 - -Unknown-)
(@CGUID+143, 97173, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3574.733, 4640.824, 6.057992, 0.2703483, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 焦躁的海潮元素 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+144, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3645.512, 4601.574, 17.78872, 5.881327, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+145, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3662.277, 4630.413, 19.2349, 3.988877, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+146, 91787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3787.719, 4246.005, 55.72623, 6.066226, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-, 194899 - -Unknown-) (possible waypoints or random movement)
(@CGUID+147, 91781, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3773.689, 4204.907, 22.96354, 1.421279, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨战士 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+148, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3654.487, 4627.489, 15.97487, 4.897095, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+149, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3647.881, 4646.236, 15.46202, 3.934594, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+150, 91786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3803.742, 4251.587, 20.20927, 2.589669, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+151, 91787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3576.689, 4668.416, 9.675158, 4.864726, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-) (possible waypoints or random movement)
(@CGUID+152, 91787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3645.281, 4627.766, 20.45248, 1.425675, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-) (possible waypoints or random movement)
(@CGUID+153, 99901, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -4182.502, 4518.975, 347.6044, 6.272351, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (possible waypoints or random movement)
(@CGUID+154, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3761.605, 4290.016, 22.03278, 1.877929, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+155, 91782, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3768.167, 4210.849, 23.19097, 3.625388, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨碾压者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+156, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3659.125, 4643.65, 19.31847, 2.844025, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+157, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3776.589, 4283.423, 22.05703, 4.613958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+158, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3552.116, 4629.005, 0.2194147, 3.362124, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+159, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3794.797, 4218.883, 21.06316, 4.620492, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+160, 91785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3795.963, 4261.818, 21.08109, 5.316548, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 游荡的硬壳龟 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+161, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3656.052, 4638.271, 17.42567, 2.810345, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+162, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3544.592, 4629.798, 0.2627155, 2.103511, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+163, 99901, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -4204.414, 4459.571, 356.0724, 0.2175409, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (possible waypoints or random movement)
(@CGUID+164, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3543.563, 4632.648, 0.6023731, 4.325715, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+165, 91789, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3436.21, 4573.153, 14.75381, 5.208306, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 积怨夫人 (Area: -Unknown- - Difficulty: 2) (Auras: 197868 - -Unknown-) (possible waypoints or random movement)
(@CGUID+166, 99901, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -4133.625, 4754.878, 350.6639, 5.498945, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (possible waypoints or random movement)
(@CGUID+167, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3545.539, 4640.858, 3.11862, 5.886796, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+168, 97063, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3486.264, 4386.87, -3.580416, 0.008037953, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Weatherman (Area: -Unknown- - Difficulty: 2) (Auras: 191792 - -Unknown-)
(@CGUID+169, 97171, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3555.446, 4740.427, 4.846405, 5.243535, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨奥术师 (Area: -Unknown- - Difficulty: 2) (Auras: 199865 - -Unknown-, 197115 - -Unknown-, 161837 - -Unknown-)
(@CGUID+170, 99901, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -4225.706, 4596.162, 348.2015, 6.00287, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (possible waypoints or random movement)
(@CGUID+171, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3536.345, 4632.375, 0.3882884, 3.383926, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+172, 98173, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3511.696, 4479.835, 1.610608, 5.007444, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 秘术师萨维 (Area: -Unknown- - Difficulty: 2) (Auras: 193491 - -Unknown-)
(@CGUID+173, 97713, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3486.74, 4386.188, -3.587721, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Lightning Stalker (Area: -Unknown- - Difficulty: 2) (Auras: 192732 - -Unknown-, 192737 - -Unknown-, 192736 - -Unknown-)
(@CGUID+174, 97171, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3457.63, 4760.196, 4.364822, 3.508651, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨奥术师 (Area: -Unknown- - Difficulty: 2) (Auras: 199865 - -Unknown-, 197115 - -Unknown-, 161837 - -Unknown-)
(@CGUID+175, 91797, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3432.059, 4199.837, 29.26819, 3.783823, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 深须国王 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+176, 97171, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3340.005, 4627.243, -0.3713874, 2.761095, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨奥术师 (Area: -Unknown- - Difficulty: 2) (Auras: 199865 - -Unknown-, 197115 - -Unknown-)
(@CGUID+177, 99901, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -4293.015, 4744.718, 323.0714, 5.751081, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (possible waypoints or random movement)
(@CGUID+178, 100250, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3415.229, 4442.797, 1.090063, 3.796594, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 束缚者阿什奥伊 (Area: -Unknown- - Difficulty: 2) (Auras: 193491 - -Unknown-)
(@CGUID+179, 100248, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3474.943, 4281.457, 1.896028, 1.654033, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 祭祀者勒莎 (Area: -Unknown- - Difficulty: 2) (Auras: 193491 - -Unknown-)
(@CGUID+180, 100249, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3382.712, 4354.069, 1.395864, 2.832155, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 导魔者瓦里兹 (Area: -Unknown- - Difficulty: 2) (Auras: 193491 - -Unknown-)
(@CGUID+181, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3539.53, 4646.788, 3.040744, 2.867719, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+182, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3771.328, 4396.896, 43.96159, 3.227207, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+183, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3729.533, 4516.378, 43.38161, 4.544586, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+184, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3805.887, 4318.764, 34.73658, 5.935711, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+185, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3729.243, 4340.263, 43.07151, 0.08800738, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+186, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3922.88, 4525.264, 89.46413, 2.613534, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+187, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3710.014, 4557.262, -0.6373726, 5.882569, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+188, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3778.894, 4422.962, 44.28867, 3.361955, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+189, 99901, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -4421.236, 4666.478, 296.812, 5.975992, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (possible waypoints or random movement)
(@CGUID+190, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3840.395, 4484.298, 62.46397, 1.170443, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+191, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3879.186, 4520.257, 82.20667, 2.670082, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+192, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3743.473, 4435.556, 38.06525, 4.549675, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+193, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3737.525, 4482.691, 43.41352, 0.4636476, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+194, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3663.665, 4627.921, 19.0063, 3.906783, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+195, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3808.038, 4471.149, 56.18052, 1.391816, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+196, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3805.625, 4510.316, 55.36877, 5.719826, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+197, 91787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3544.135, 4713.196, 29.26225, 5.018749, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-) (possible waypoints or random movement)
(@CGUID+198, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3608.211, 4562.433, -4.354442, 3.749918, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+199, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3647.451, 4655.227, 15.79811, 2.857251, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+200, 91786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3528.99, 4653.86, 4.501997, 3.04678, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+201, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3615.197, 4503.747, 0.8996092, 2.919752, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+202, 97173, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3510.163, 4643.041, 3.205296, 4.981659, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 焦躁的海潮元素 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+203, 91796, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3724.799, 4186.074, 28.4885, 2.333246, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海巨人弄潮者 (Area: -Unknown- - Difficulty: 2) (Auras: 18950 - -Unknown-)
(@CGUID+204, 97170, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3568.38, 4789.196, 5.626736, 5.076961, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨缚潮者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+205, 97170, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3537.386, 4748.604, 2.457347, 2.938291, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨缚潮者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+206, 95920, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3538.559, 4744.325, 2.555609, 2.580513, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 活体风暴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+207, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3593.316, 4530.43, 0.2259865, 1.976329, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+208, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3589.674, 4575.156, -4.041022, 4.17965, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+209, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3598.658, 4577.333, -6.651322, 2.820286, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+210, 97173, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3505.843, 4691.879, 4.857439, 1.621499, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 焦躁的海潮元素 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+211, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3584.57, 4588.699, -6.189111, 3.221648, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+212, 95920, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3564.141, 4790.51, 6.098958, 4.719182, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 活体风暴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+213, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3465.96, 4582.65, -0.3546312, 2.598541, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+214, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3471.262, 4568.861, -0.3546312, 4.729331, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+215, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3478.828, 4596.364, -0.3546312, 4.729331, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+216, 97170, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3479.042, 4662.354, 3.767857, 2.525702, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨缚潮者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+217, 95920, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3480.215, 4658.075, 2.118856, 2.169841, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 活体风暴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+218, 97173, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3487.674, 4641.347, 2.774509, 0.9750239, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 焦躁的海潮元素 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+219, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3574.412, 4486.246, 1.443358, 3.572021, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+220, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3437.391, 4609.057, -0.3529785, 6.214393, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+221, 106786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3674.028, 4180.639, 26.33859, 0.9816417, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+222, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3452.926, 4569.124, -0.354621, 1.65257, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+223, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3443.344, 4590.651, -0.3546312, 5.586637, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+224, 91786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3519.067, 4783.301, 3.649835, 4.012024, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+225, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3617.448, 4341.229, -3.346528, 2.045361, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+226, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3463.75, 4596.378, -0.3546312, 3.916662, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+227, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3440.318, 4553.862, -0.3546143, 0.4733268, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+228, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3569.082, 4597.466, -4.837087, 2.213939, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+229, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3562.604, 4451.469, 1.603922, 0.06179932, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+230, 91808, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3250.663, 4429.41, -2.768002, 3.25353, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 瑟芬崔斯克 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+231, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3543.289, 4593.667, -7.738005, 5.17167, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+232, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3474.113, 4727.397, 3.061378, 4.358144, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+233, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3447.143, 4603.747, -0.3546312, 5.99311, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+234, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3440.594, 4620.173, -0.3546311, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+235, 91786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3672.235, 4177.302, 25.13663, 1.868053, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+236, 106786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3669.955, 4176.705, 24.66907, 0.07111599, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+237, 106787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3669.17, 4172.911, 24.15917, 0.02354234, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+238, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3450.299, 4579.592, -0.3546312, 0.6305524, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+239, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3462.639, 4552.489, -0.354621, 6.211546, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+240, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3434.94, 4608.426, -0.3576534, 6.156785, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+241, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3426.301, 4560.194, -0.3546143, 1.275967, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+242, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3464.789, 4614.286, -0.3546312, 2.285688, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+243, 106787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3664.184, 4166.477, 24.46101, 1.544655, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+244, 106785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3667.841, 4170.754, 23.86916, 5.922029, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+245, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3423.009, 4627.773, -0.245584, 4.254733, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+246, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3420.625, 4616.911, -0.3546244, 1.65257, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+247, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3473.353, 4741.565, 1.999609, 4.915628, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+248, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3433.381, 4622.195, -0.3870599, 3.372001, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+249, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3430.131, 4609.837, -0.4237386, 5.887989, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124); -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)

INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
(@CGUID+250, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3521.847, 4484.507, 1.253721, 4.574681, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+251, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3590.346, 4354.255, -3.23943, 6.214231, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+252, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3415.414, 4570.519, -0.3546142, 2.578939, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+253, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3425.115, 4604.109, -0.3546278, 4.435446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+254, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3424.645, 4623.333, -0.4237386, 1.755688, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+255, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3425.966, 4586.567, -0.3546265, 2.285688, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+256, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3587.669, 4345.889, -3.318647, 1.014075, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+257, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3474.19, 4744.083, 1.936856, 0.9767157, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+258, 106785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3660.952, 4167.449, 24.71016, 2.059581, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+259, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3525.412, 4605.505, -5.140559, 3.145499, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+260, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3424.193, 4674.749, 2.987832, 4.099653, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+261, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3669.501, 4163.815, 23.76771, 2.744446, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+262, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3402.368, 4589.106, -0.3546078, 5.488472, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+263, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3671.694, 4161.954, 23.46203, 2.732031, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+264, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3732.335, 4241.239, 8.421116, 5.816817, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+265, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3671.205, 4160.128, 23.46967, 2.749467, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+266, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3670.046, 4163.295, 23.6216, 2.730153, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+267, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3425.288, 4661.191, 2.953304, 6.165396, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+268, 101414, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3668.453, 4163.928, 23.95561, 2.743664, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜伏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196107 - -Unknown-) (possible waypoints or random movement)
(@CGUID+269, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3547.333, 4690.605, 5.124503, 6.189576, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+270, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3427.003, 4660.449, 3.058873, 3.338063, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+271, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3671.445, 4161.036, 23.46289, 2.740646, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+272, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3671.768, 4163.616, 23.64229, 2.814961, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+273, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3476.62, 4764.453, 3.083278, 5.063162, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+274, 97853, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3408.969, 4608.918, -0.3546075, 0.2561045, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) (Auras: 193060 - -Unknown-, 193064 - -Unknown-)
(@CGUID+275, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3594.371, 4321.165, -3.401957, 5.382812, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+276, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3430.702, 4677.174, 2.846809, 0.04485401, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+277, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3671.289, 4163.295, 23.5311, 2.733251, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+278, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3410.509, 4657.009, 2.36822, 2.522776, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+279, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3578.145, 4302.756, -2.51292, 5.566734, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+280, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3453.548, 4749.479, 4.538485, 5.182201, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+281, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3422.145, 4677.536, 3.405093, 3.379083, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+282, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3485.717, 4613.573, 0.8138538, 1.358271, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+283, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3362.8, 4567.623, -0.4030495, 2.595639, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+284, 111936, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3477.292, 4389.307, -2.797314, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 萨奇尔 (Area: -Unknown- - Difficulty: 2)
(@CGUID+285, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3458.76, 4479.44, 3.487017, 1.485659, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+286, 106786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3676.446, 4107.291, 27.03394, 4.159023, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+287, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3451.73, 4754.894, 4.532342, 2.912555, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+288, 111374, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3477.292, 4389.307, -2.797314, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- -Unknown- (Area: -Unknown- - Difficulty: 2)
(@CGUID+289, 106785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3667.873, 4109.456, 26.23035, 3.72452, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+290, 91786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3415.527, 4705.049, 5.718899, 5.923109, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+291, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3751.816, 4197.573, 23.63609, 0.521815, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+292, 106787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3670.155, 4104.155, 25.89241, 3.411583, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+293, 100688, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3551.988, 4275.067, -2.511133, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+294, 106785, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3671.995, 4095.664, 25.29602, 3.001131, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+295, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3724.839, 4195.437, 26.38649, 0.148353, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+296, 106786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3675.811, 4100.433, 26.83898, 2.916851, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+297, 106787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3668.151, 4100.979, 25.49062, 3.314258, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+298, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3357.061, 4563.299, -0.5580564, 5.914975, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+299, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3451.612, 4493.198, 3.943889, 1.664858, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+300, 101414, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3601.965, 4106.956, 26.26196, 2.463483, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜伏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196107 - -Unknown-) (possible waypoints or random movement)
(@CGUID+301, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3603.674, 4099.534, 26.17379, 0.8251943, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+302, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3594.95, 4098.658, 27.37347, 5.351065, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+303, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3730.275, 4172.11, 30.41823, 0.148353, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+304, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3596.809, 4098.207, 26.81412, 0.8744081, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+305, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3599.21, 4097.446, 26.30661, 4.656197, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+306, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3597.87, 4098.466, 26.53912, 0.6884573, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+307, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3591.888, 4097.022, 27.27552, 2.978268, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+308, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3667.276, 4167.439, 22.27694, 0.148353, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+309, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3353.726, 4578.734, -0.543166, 3.61871, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+310, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3346.619, 4568.587, -0.9085642, 4.054951, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+311, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3353.275, 4570.753, -0.5737922, 3.863735, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+312, 91794, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3594.983, 4091.511, 26.32535, 3.410588, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+313, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3353.572, 4580.31, -0.6061831, 3.359217, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+314, 91787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3470.981, 4127.972, 62.04016, 4.984948, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-) (possible waypoints or random movement)
(@CGUID+315, 111221, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3468.021, 4604.681, -0.3405454, 4.2138, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- -Unknown- (Area: -Unknown- - Difficulty: 2) (possible waypoints or random movement)
(@CGUID+316, 95947, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3327.991, 4457.614, 2.253357, 5.996032, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 玛拉纳硬壳战士 (Area: -Unknown- - Difficulty: 2) (Auras: 196201 - -Unknown-) (possible waypoints or random movement)
(@CGUID+317, 91787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3413.825, 4674.838, 32.17802, 4.392907, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+318, 91787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3387.993, 4637.434, 30.07792, 4.414587, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+319, 91787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3436.489, 4699.607, 24.0338, 4.541832, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-) (possible waypoints or random movement)
(@CGUID+320, 91787, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3458.648, 4131.025, 49.1558, 3.486797, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-, 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+321, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3459.748, 4278.558, 0.0481593, 0.2023706, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+322, 91786, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3392.645, 4657.292, 2.213178, 3.201209, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+323, 97173, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3413.56, 4714.881, 4.913117, 1.506909, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 焦躁的海潮元素 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+324, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3451.781, 4578.362, -0.3129646, 4.3253, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+325, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3541.553, 4746.875, 3.547975, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+326, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3457.207, 4805.519, 4.177526, 5.25867, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+327, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3459.971, 4814.701, 3.57935, 3.092223, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+328, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3459.544, 4813.627, 3.620478, 1.098415, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+329, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3452.201, 4819.687, 2.929165, 2.701542, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+330, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3451.515, 4825.899, 2.560701, 3.404588, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+331, 97170, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3436.413, 4811.167, 3.269347, 2.430082, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 积怨缚潮者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+332, 95920, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3433.064, 4815.607, 2.907986, 2.862431, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 活体风暴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+333, 97172, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3441.902, 4808.623, 3.677193, 4.938895, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐海小水滴 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+334, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3460.325, 4640.67, 1.530615, 0.5854119, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+335, 99908, 1456, 8040, 8081, 8388870, '0', 0, 0, 0, -3526.292, 4771.735, 2.890716, 0.740567, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+336, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3330.452, 4548.223, -1.652669, 4.886739, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+337, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3326.669, 4541.278, -0.8458202, 0.6857011, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+338, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3321.621, 4548.408, -1.13872, 6.045781, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+339, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3321.438, 4536.475, -0.2163162, 2.647674, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+340, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3316.566, 4538.711, -0.04422361, 2.421844, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+341, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3307.071, 4615.207, 0.8810644, 3.911239, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 55701 - -Unknown-) (possible waypoints or random movement)
(@CGUID+342, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3308.222, 4623.484, 0.7796806, 3.214983, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 55701 - -Unknown-)
(@CGUID+343, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3303.116, 4613.609, 0.8809491, 5.08411, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 55701 - -Unknown-) (possible waypoints or random movement)
(@CGUID+344, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3410.078, 4666.265, 2.492391, 4.636115, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+345, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3307.199, 4629.25, 0.7819973, 3.892038, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 55701 - -Unknown-)
(@CGUID+346, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3335.028, 4764.278, -0.5106739, 3.158624, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+347, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3337.786, 4756.193, -0.1927083, 1.200173, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+348, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3334.024, 4756.088, -0.626847, 2.312864, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+349, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3334.205, 4760.054, -0.6523423, 2.926418, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+350, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3450.555, 4764.667, 4.345965, 6.126451, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+351, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3297.212, 4617.972, 0.5894567, 5.296845, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 55701 - -Unknown-) (possible waypoints or random movement)
(@CGUID+352, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3292.945, 4621.749, 0.8800107, 3.828546, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 55701 - -Unknown-)
(@CGUID+353, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3326.851, 4766.614, -0.8521638, 0.5838565, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+354, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3325.158, 4763.402, -0.9929094, 1.152026, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+355, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3419.082, 4487.02, 3.66689, 5.995095, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+356, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3279.328, 4726.264, 2.209354, 0.3138604, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+357, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3281.835, 4734.601, 2.140069, 0.3171377, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+358, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3276.17, 4721.163, 1.776169, 2.656085, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+359, 97263, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3294.204, 4460.524, -0.6337841, 3.928019, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 渗穴 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+360, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3279.96, 4729.932, 2.144609, 0.05241314, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+361, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3283.958, 4742.942, 2.023092, 0.3658022, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+362, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3249.358, 4664.775, 9.220741, 4.019757, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+363, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3245.887, 4651.294, 12.38433, 5.281934, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+364, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3375.281, 4480.239, 0.9732921, 3.826681, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+365, 97263, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3304.172, 4405.53, 0.08727819, 3.246478, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 渗穴 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+366, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3249.111, 4655.201, 13.36304, 2.705386, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+367, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3246.979, 4659.916, 8.437593, 4.608415, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+368, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3278.267, 4750.509, 1.793426, 4.412449, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+369, 95947, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3251.489, 4536.071, 0.7853099, 6.065681, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 玛拉纳硬壳战士 (Area: -Unknown- - Difficulty: 2) (Auras: 196201 - -Unknown-) (possible waypoints or random movement)
(@CGUID+370, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3269.568, 4438.521, 1.035043, 0.9934856, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+371, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3266.404, 4449.552, 1.240314, 0.5753369, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+372, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3238.245, 4665.409, 7.17244, 0.6377962, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+373, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3266.404, 4449.552, 1.240314, 0.5753369, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+374, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3266.404, 4449.552, 1.240314, 0.5753369, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+375, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3374.695, 4474.102, 1.513364, 2.82355, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+376, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3240.137, 4655.733, 6.74981, 2.818599, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+377, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3251.139, 4446.768, 2.731421, 5.809948, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+378, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3222.972, 4677.233, 2.34941, 0.9947546, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+379, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3216.828, 4670.143, 1.234164, 2.247277, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+380, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3222.925, 4671.67, 1.40218, 0.1388221, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+381, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3215.941, 4675.674, 6.754994, 5.886783, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+382, 97263, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3246.707, 4479.649, 0.2666751, 3.287955, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 渗穴 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+383, 91792, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3221.078, 4484.218, 1.306437, 2.105563, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 唤雷多头蛇 (Area: -Unknown- - Difficulty: 2) (Auras: 202314 - -Unknown-) (possible waypoints or random movement)
(@CGUID+384, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3189.962, 4611.079, 2.665328, 0.1887254, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+385, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3190.07, 4622.371, 3.30207, 5.647364, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+386, 91790, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3256.209, 4394.037, 2.978035, 4.024435, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 玛拉纳沙地行者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+387, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3210.563, 4677.778, 1.919626, 2.41322, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+388, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3323.313, 4707.619, -0.5615882, 2.412114, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+389, 91792, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3268.63, 4394.8, 1.374246, 0.4356749, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 唤雷多头蛇 (Area: -Unknown- - Difficulty: 2) (Auras: 202314 - -Unknown-)
(@CGUID+390, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3213.439, 4672.081, 1.557943, 2.452884, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+391, 91787, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3204.741, 4553.279, 21.35262, 5.141049, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-) (possible waypoints or random movement)
(@CGUID+392, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3345.07, 4419.706, 2.737703, 0.0939362, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+393, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3289.975, 4539.837, 1.178985, 5.780253, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+394, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3301.371, 4492.514, 1.069844, 0.7565063, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+395, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3179.832, 4624.41, 2.296847, 4.886386, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+396, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3180.446, 4606.571, 2.513917, 5.407036, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+397, 97263, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3256.363, 4370.386, 0.3748484, 2.721399, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 渗穴 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+398, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3181.64, 4602.248, 2.180275, 1.246277, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+399, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3182.029, 4478.807, 1.74499, 0.01855256, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+400, 91787, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3176.42, 4502.254, 25.82148, 5.016421, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-) (possible waypoints or random movement)
(@CGUID+401, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3191.557, 4492.507, 1.042781, 0.172508, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+402, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3168.256, 4617.456, 0.8908861, 3.541302, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+403, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3193.699, 4493.742, 1.042781, 0.4288154, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+404, 95947, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3285.96, 4326.377, 0.952469, 3.906952, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 玛拉纳硬壳战士 (Area: -Unknown- - Difficulty: 2) (Auras: 196201 - -Unknown-)
(@CGUID+405, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3286.912, 4636.746, 2.152677, 1.797178, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+406, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3188.036, 4489.02, 1.042781, 1.767515, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+407, 97263, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3192.243, 4440.179, -0.648342, 3.349827, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 渗穴 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+408, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3175.351, 4488.829, 1.042781, 2.967228, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+409, 91786, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3357.288, 4256.319, 0.1160504, 3.638417, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-)
(@CGUID+410, 97263, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3199.404, 4384.951, 0.1613097, 3.025057, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 渗穴 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+411, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3228.693, 4344.335, 1.270203, 5.699846, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+412, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3224.364, 4341.963, 1.139588, 1.446244, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+413, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3161.6, 4428.575, 3.534082, 6.267562, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+414, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3159.041, 4437.114, 3.279236, 0.9500482, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+415, 91787, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3132.2, 4505.857, 36.70028, 2.177421, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+416, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3231.446, 4338.416, 2.092103, 3.102766, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+417, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3121.651, 4522.152, -0.09260836, 2.598304, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+418, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3157.158, 4422.892, 4.553125, 3.221803, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+419, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3118.188, 4513.528, -0.1630024, 0.5153176, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+420, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3153.159, 4429.805, 4.561761, 4.502813, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+421, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3363.618, 4350.424, 2.534236, 2.122532, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+422, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3116.041, 4524.025, -0.09260836, 3.680448, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+423, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3218.672, 4323.941, 1.186604, 1.814937, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+424, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3106.665, 4510.372, -0.2176084, 5.146592, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+425, 91787, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3194.586, 4364.893, 19.94741, 2.333798, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-)
(@CGUID+426, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3202.94, 4614.922, 2.051861, 0.2680299, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+427, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3216.582, 4327.591, 1.072834, 4.895582, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+428, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3110.443, 4509.115, -0.2176084, 2.915576, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+429, 91787, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3220.853, 4325.719, 22.08173, 4.989211, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-)
(@CGUID+430, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3151.194, 4420.586, 5.856781, 4.904553, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+431, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3188.44, 4664.746, 3.552022, 2.486463, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+432, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3220.89, 4740.078, -5.276441, 1.527812, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+433, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3242.056, 4776.288, -8.124022, 1.920356, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+434, 91790, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3246.423, 4280.355, 1.249714, 1.431662, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 玛拉纳沙地行者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+435, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3194.813, 4630.817, 2.721933, 2.948892, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+436, 91787, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3178.818, 4344.555, 32.69563, 1.855101, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+437, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3106.014, 4422.772, 8.484892, 2.29106, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+438, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3251.871, 4808.007, -6.678323, 4.862513, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+439, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3113.093, 4421.504, 8.466948, 3.009559, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+440, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3073.555, 4469.194, 5.8995, 0.1077943, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+441, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3192.395, 4455.422, 1.579677, 0.5047264, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+442, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3106.254, 4412.893, 8.920151, 1.690187, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+443, 91787, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3142.53, 4364.888, 24.5075, 4.353067, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-) (possible waypoints or random movement)
(@CGUID+444, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3114.798, 4416.55, 8.686308, 5.283024, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+445, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3110.331, 4404.071, 9.506742, 5.626117, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+446, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3071.895, 4469.189, 5.960643, 5.930581, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+447, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3074.069, 4461.82, 5.626812, 1.615624, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+448, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3067.715, 4453.389, 5.98799, 2.266613, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+449, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3045.097, 4560.266, 2.632426, 1.585958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+450, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3183.597, 4779.651, -9.214612, 5.528826, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+451, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3048.919, 4554.018, 2.10099, 1.246277, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+452, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3060.674, 4466.703, 6.261096, 1.445426, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+453, 91792, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3120.747, 4354.84, 8.683679, 2.114716, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 唤雷多头蛇 (Area: -Unknown- - Difficulty: 2) (Auras: 202314 - -Unknown-) (possible waypoints or random movement)
(@CGUID+454, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3057.24, 4562.847, 2.772485, 0.1887254, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+455, 99630, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3043.875, 4567.159, 3.214764, 3.541302, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+456, 99629, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3057.347, 4574.139, 3.718152, 5.647364, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+457, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3139.12, 4342.729, 7.096476, 4.234964, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+458, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3135.925, 4705.513, -4.001187, 4.083288, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+459, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3294.044, 4357.051, 1.159436, 0.4983906, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+460, 95940, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3047.11, 4576.179, 3.967452, 4.886386, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水清道夫 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+461, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3137.199, 4329.584, 6.046682, 4.781887, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+462, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3129.957, 4341.893, 7.361984, 0.8975769, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+463, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3277.131, 4356.142, 2.003747, 4.525818, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+464, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3096.63, 4612.376, -3.196967, 1.665183, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+465, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3132.098, 4326.953, 6.299193, 0.9362294, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+466, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3139.054, 4795.576, -9.10916, 3.202858, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+467, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3174.619, 4293.061, 5.452824, 4.069791, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+468, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3182.531, 4286.47, 2.720402, 4.48361, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+469, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3124.635, 4331.159, 6.681604, 0.1432582, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+470, 91793, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3184.285, 4287.253, 2.94025, 2.651767, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+471, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3116.3, 4774.282, -9.245193, 6.146761, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+472, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3077.473, 4652.42, -3.103358, 3.776759, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+473, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3083.713, 4683.919, -2.740586, 2.634675, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+474, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3084.556, 4550.378, -0.2726217, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+475, 91793, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3179.597, 4279.584, 3.38988, 2.716641, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+476, 91793, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3171.354, 4282.839, 3.219913, 6.253728, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 逐潮蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-) (possible waypoints or random movement)
(@CGUID+477, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3382.516, 4316.084, 2.390193, 4.842993, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+478, 100688, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3427.438, 4264.591, -2.074888, 1.338103, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+479, 91786, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3271.416, 4180.522, 5.561533, 2.037481, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-)
(@CGUID+480, 91796, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3224.79, 4183.415, 6.508303, 1.351387, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海巨人弄潮者 (Area: -Unknown- - Difficulty: 2) (Auras: 18950 - -Unknown-, 191798 - -Unknown-)
(@CGUID+481, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3126.116, 4401.833, 7.612063, 0.1619358, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+482, 91786, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3385.999, 4143.492, 28.59308, 3.867846, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-, 191798 - -Unknown-)
(@CGUID+483, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3351.141, 4247.182, 2.492634, 0.7522612, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+484, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3275.208, 4267.449, 3.127092, 5.307434, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+485, 99908, 1456, 8040, 8084, 8388870, '0', 0, 0, 0, -3162.48, 4311.241, 6.190322, 0.5274535, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+486, 106786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3197.05, 4134.154, 7.380984, 0.7688813, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+487, 106785, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3201.486, 4122.568, 6.95211, 5.919156, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+488, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3106.574, 4358.441, 8.998403, 2.016984, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+489, 106786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3199.231, 4137.647, 6.305386, 0.3064808, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+490, 106785, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3200.269, 4141.491, 5.645268, 0.4157418, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+491, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3217.592, 4224.978, 6.753133, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+492, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3381.357, 4190.526, 28.81521, 1.584366, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+493, 106787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3219.63, 4107.372, 5.081669, 4.562804, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+494, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3454.808, 4211.94, 30.4642, 3.907326, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+495, 106787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3217.351, 4110.157, 5.436661, 5.565156, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+496, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3443.133, 4206.106, 29.19917, 4.635937, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+497, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3370.849, 4187.685, 28.68911, 2.051627, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+498, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3466.073, 4207.396, 30.40729, 3.674484, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+499, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3425.482, 4191.095, 30.27352, 4.861548, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124); -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)

INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
(@CGUID+500, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3438.133, 4192.877, 30.30978, 2.040222, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+501, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3446.596, 4192.903, 29.30978, 2.958518, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+502, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3451.305, 4196.683, 30.30978, 3.482216, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+503, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3443.922, 4179.948, 30.30978, 1.579136, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+504, 95939, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3442.753, 4082.734, 18.75269, 4.450808, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 踏浪巨人 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-, 18950 - -Unknown-)
(@CGUID+505, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3450.401, 4181.708, 30.30978, 0.2071159, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+506, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3274.773, 4052.867, 3.82915, 2.484199, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-, 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+507, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3274.773, 4052.867, 3.82915, 2.484199, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-, 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+508, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3466.885, 4192.208, 30.30978, 0.1319915, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+509, 106786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3274.321, 4072.387, 2.660866, 0.5679303, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+510, 106785, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3294.092, 4075.407, 3.237128, 3.253065, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+511, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3274.773, 4052.867, 3.82915, 2.484199, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-, 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+512, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3459.903, 4190.458, 29.30978, 4.813504, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+513, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3420.715, 4169.912, 29.27265, 2.99562, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+514, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3428.659, 4188.269, 29.27265, 5.991471, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+515, 106786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3286.432, 4072.236, 3.995488, 4.040922, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+516, 106785, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3272.408, 4069.178, 3.080481, 1.220619, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+517, 101414, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3274.773, 4052.867, 3.82915, 2.484199, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜伏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196107 - -Unknown-, 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+518, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3274.773, 4052.867, 3.82915, 2.484199, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-, 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+519, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3426.168, 4176.897, 30.26485, 4.878479, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+520, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3440.036, 4176.879, 29.30797, 0.1013048, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+521, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3276.702, 4060.756, 3.489576, 1.810616, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-, 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+522, 91796, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3459.071, 4084.908, 20.0094, 4.959829, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海巨人弄潮者 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-, 18950 - -Unknown-)
(@CGUID+523, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3180.481, 4191.952, 5.305609, 5.563639, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+524, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3436.448, 4179.966, 30.30987, 2.064009, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+525, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3274.773, 4052.867, 3.82915, 2.484199, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-, 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+526, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3448.805, 4183.06, 29.30978, 0.9084146, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+527, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3274.773, 4052.867, 3.82915, 2.484199, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-, 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+528, 106787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3289.885, 4049.57, 6.288845, 5.822946, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-) (possible waypoints or random movement)
(@CGUID+529, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3430.317, 4164.896, 30.24961, 1.867552, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+530, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3413.419, 4154.858, 29.21781, 5.240136, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+531, 91786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3267.047, 4039.671, 4.747573, 1.487621, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-, 191798 - -Unknown-)
(@CGUID+532, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3387.205, 4151.181, 28.64769, 1.704785, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+533, 106787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3276.814, 4047.804, 4.691113, 3.347945, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+534, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3458.985, 4176.671, 30.30978, 3.925688, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+535, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3455.626, 4181.145, 29.30978, 0.690681, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+536, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3453.782, 4174.784, 29.30978, 3.501794, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+537, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3447.873, 4173.4, 30.30978, 5.858311, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+538, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3432.218, 4168.052, 30.23802, 1.486378, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+539, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3437.35, 4163.929, 29.29103, 0.6509498, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+540, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3472.769, 4178.395, 30.30977, 6.251776, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+541, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3465.609, 4168.891, 29.30978, 0.6942904, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+542, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3473.879, 4186.259, 30.30976, 0.8818197, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+543, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3423.624, 4156.438, 29.21781, 1.123043, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+544, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3451.175, 4162.117, 29.30541, 3.089124, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+545, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3455.459, 4166.286, 30.30631, 4.888133, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+546, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3409.138, 4147.884, 30.21113, 2.30562, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+547, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3474.353, 4178.773, 30.30977, 4.945975, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+548, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3445.094, 4160.482, 30.30541, 1.852942, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+549, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3475.168, 4184.515, 29.30977, 2.500115, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+550, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3476.85, 4181.419, 29.30977, 4.99971, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+551, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3239.499, 4120.091, 4.760602, 0.3258582, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+552, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3472.29, 4172.829, 30.30978, 1.576494, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+553, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3478.888, 4176.648, 30.30944, 0.6219559, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+554, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3451.153, 4156.918, 30.30541, 0.8472924, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+555, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3449.614, 4156.487, 30.30525, 0.6524165, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+556, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3422.954, 4139.712, 30.21795, 1.790753, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+557, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3418.721, 4137.862, 30.2179, 0.981509, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+558, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3407.678, 4134.456, 30.4582, 0.9690852, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+559, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3419.216, 4137.558, 30.21798, 1.676715, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+560, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3455.582, 4155.498, 29.30541, 4.610363, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+561, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3481.455, 4172.484, 29.30977, 1.935144, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+562, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3461.302, 4156.721, 29.30541, 2.517692, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+563, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3428.492, 4138.598, 30.21781, 1.906738, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+564, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3432.956, 4136.311, 29.23304, 2.6685, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-, 191798 - -Unknown-)
(@CGUID+565, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3442.907, 4143.527, 30.30601, 0.002426063, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: ) (possible waypoints or random movement)
(@CGUID+566, 97259, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3199.404, 4384.951, 0.244643, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 烈焰多头蛇子嗣 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+567, 97260, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3304.172, 4405.53, 0.1706115, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 奥术多头蛇子嗣 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+568, 97259, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3246.707, 4479.649, 0.3500085, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 烈焰多头蛇子嗣 (Area: -Unknown- - Difficulty: 2)
(@CGUID+569, 97260, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3256.363, 4370.386, 0.4581818, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 奥术多头蛇子嗣 (Area: -Unknown- - Difficulty: 2) (Auras: 192007 - -Unknown-)
(@CGUID+570, 100688, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3006.481, 4582.303, -5.635878, 5.838029, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辉鳞鲈鱼 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+571, 101414, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3331.838, 3985.792, 3.660685, 4.608663, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜伏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196107 - -Unknown-)
(@CGUID+572, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3455.553, 4145.425, 29.30541, 3.167528, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+573, 106786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3361.908, 3993.01, 8.821019, 2.862892, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+574, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3440.767, 4132.512, 30.30112, 1.763922, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+575, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3445.372, 4124.819, 30.00185, 4.553037, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+576, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3271.978, 4071.533, 3.551418, 5.807698, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+577, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3485.039, 4167.496, 29.30977, 1.863109, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+578, 95939, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3379.122, 4000.003, 6.719096, 5.613141, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 踏浪巨人 (Area: -Unknown- - Difficulty: 2) (Auras: 18950 - -Unknown-)
(@CGUID+579, 106786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3360.63, 3987.868, 5.304278, 2.60903, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+580, 106785, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3360.345, 3998.028, 14.62426, 3.196067, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+581, 91796, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3272.409, 3975.514, 3.31372, 4.280911, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海巨人弄潮者 (Area: -Unknown- - Difficulty: 2) (Auras: 18950 - -Unknown-)
(@CGUID+582, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3464.054, 4135.329, 30.30936, 3.898282, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+583, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3453.002, 4128.221, 29.21268, 3.246654, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+584, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3337.209, 3975.19, 2.027769, 1.471589, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+585, 106787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3365.731, 3982.601, 3.887338, 2.202696, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+586, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3481.782, 4027.272, 7.332756, 5.980883, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+587, 106785, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3366.773, 3987.995, 5.240522, 2.380314, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+588, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3347.205, 3979.047, 2.46136, 0.3611356, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+589, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3486.459, 4038.541, 9.892651, 2.078241, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+590, 101414, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3479.566, 4028.95, 7.506049, 3.268572, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜伏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196107 - -Unknown-) (possible waypoints or random movement)
(@CGUID+591, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3329.688, 3979.688, 2.338419, 4.799902, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+592, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3481.961, 4033.648, 8.718208, 5.657473, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+593, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3490.824, 4029.451, 8.452201, 0.7533293, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+594, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3482.283, 4036.414, 9.382397, 3.877641, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+595, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3336.966, 3974.096, 1.917746, 5.431884, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+596, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3342.143, 3972.108, 1.818275, 3.459458, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+597, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3323.959, 3978.646, 2.213419, 3.713569, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+598, 106787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3372.386, 3981.233, 3.912815, 1.816848, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+599, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3336.168, 3978.895, 2.108717, 3.922769, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+600, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3463.561, 4125.286, 30.00856, 2.426254, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+601, 91786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3386.865, 3972.962, 4.580527, 1.143846, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-)
(@CGUID+602, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3492.336, 4030.399, 8.935519, 1.210562, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+603, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3478.782, 4147.848, 29.30982, 0.01114299, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+604, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3488.637, 4028.024, 7.978366, 2.411963, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+605, 91787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3345.419, 3949.099, 2.392849, 0.4889808, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-)
(@CGUID+606, 91786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3454.486, 3983.935, 1.470776, 4.825371, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+607, 91787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3424.997, 3964.152, 15.23021, 1.578062, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-)
(@CGUID+608, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3241.957, 3916.847, 3.725687, 0.3560281, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+609, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3420.32, 4076.02, 14.77811, 2.567674, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+610, 91786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3340.019, 3928.7, 3.804604, 4.325715, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-)
(@CGUID+611, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3238.841, 3921.729, 3.766502, 5.600205, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+612, 97844, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3469.057, 4119.941, 29.34134, 1.853494, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 呼潮引浪 (Area: -Unknown- - Difficulty: 2) (Auras: )
(@CGUID+613, 101414, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3247.084, 3918.252, 2.827471, 0.06643828, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜伏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196107 - -Unknown-)
(@CGUID+614, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3246.632, 3918.054, 2.921674, 1.286785, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+615, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3252.339, 3911.799, 2.67594, 1.469413, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+616, 106786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3528.849, 4021.309, 21.39505, 0.05597325, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+617, 106785, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3524.62, 4015.74, 18.41521, 0.5243072, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+618, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3235.555, 3918.055, 4.292227, 3.713655, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+619, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3243.332, 3914.253, 3.715503, 0.2004583, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+620, 99908, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3464.215, 4103.805, 28.95331, 0.9338311, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+621, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3245.786, 3913.902, 3.256338, 2.474683, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+622, 106787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3541.512, 4026.94, 26.57369, 1.193464, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+623, 106787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3531.677, 4017.014, 20.95422, 2.399115, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+624, 106785, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3540.667, 4021.003, 24.57346, 6.150303, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+625, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3359.58, 3886.406, 0.649071, 5.91516, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+626, 91787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3536.674, 4017.502, 22.62322, 6.037734, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-) (possible waypoints or random movement)
(@CGUID+627, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3362.629, 3895.96, 1.748136, 5.013862, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+628, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3357.187, 3888.844, 0.9683385, 0.6680674, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+629, 106786, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3552.66, 4032.266, 28.59006, 0.949516, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2) (Auras: 191798 - -Unknown-)
(@CGUID+630, 101414, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3353.477, 3882.398, 0.4573213, 1.145939, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜伏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196107 - -Unknown-)
(@CGUID+631, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3359.658, 3875.78, 0.3731362, 0.5962633, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+632, 91787, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3540.445, 4001.821, 19.97053, 1.686307, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 海湾沙鸥 (Area: -Unknown- - Difficulty: 2) (Auras: 194899 - -Unknown-) (possible waypoints or random movement)
(@CGUID+633, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3359.07, 3875.994, 0.3731362, 1.279299, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+634, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3355.149, 3878.911, 0.3731362, 1.257327, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+635, 91794, 1456, 8040, 8082, 8388870, '0', 0, 0, 0, -3362.334, 3876.996, 0.8100609, 2.723659, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+636, 106786, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3294.085, 3847.82, 0.5480171, 3.972519, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2)
(@CGUID+637, 106787, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3283.485, 3856.222, 0.2160806, 5.830033, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2)
(@CGUID+638, 106785, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3295.931, 3840.658, 2.179854, 2.100641, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2)
(@CGUID+639, 95939, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3325.989, 3865.13, 0.4769716, 4.058307, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 踏浪巨人 (Area: -Unknown- - Difficulty: 2) (Auras: 18950 - -Unknown-)
(@CGUID+640, 106786, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3269.681, 3837.354, 2.388796, 0.6390287, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2)
(@CGUID+641, 106787, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3283.111, 3843.538, 1.305859, 3.72131, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2)
(@CGUID+642, 106785, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3271.808, 3844.651, 2.34276, 6.11002, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 苦水奴隶 (Area: -Unknown- - Difficulty: 2)
(@CGUID+643, 91786, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3478.116, 3929.937, 3.473909, 5.550951, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-)
(@CGUID+644, 91796, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3438.064, 3899.995, 8.846745, 4.572856, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海巨人弄潮者 (Area: -Unknown- - Difficulty: 2) (Auras: 18950 - -Unknown-)
(@CGUID+645, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3522.881, 3949.562, 8.466503, 4.825264, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+646, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3524.945, 3940.352, 7.802075, 1.087808, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+647, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3520.381, 3938.136, 7.11372, 2.878627, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+648, 101414, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3527.125, 3948.384, 8.460033, 5.492095, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜伏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196107 - -Unknown-)
(@CGUID+649, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3525.047, 3943.874, 8.014685, 5.886672, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+650, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3526.093, 3946.397, 8.297502, 1.926287, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+651, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3522.588, 3946.274, 8.208597, 1.235986, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+652, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3521.504, 3938.224, 7.228082, 4.478833, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+653, 91796, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3590.8, 4013.855, 29.95814, 5.44453, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海巨人弄潮者 (Area: -Unknown- - Difficulty: 2) (Auras: 18950 - -Unknown-)
(@CGUID+654, 95939, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3573.653, 3971.181, 19.23393, 5.678757, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 踏浪巨人 (Area: -Unknown- - Difficulty: 2) (Auras: 18950 - -Unknown-)
(@CGUID+655, 99908, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3361.91, 3922.916, 10.36023, 3.141593, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+656, 95939, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3524.143, 3913.175, 3.151563, 4.712474, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 踏浪巨人 (Area: -Unknown- - Difficulty: 2) (Auras: 55701 - -Unknown-, 18950 - -Unknown-)
(@CGUID+657, 91786, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3574.171, 3938.851, 12.90734, 6.109362, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 砂泥蜗牛 (Area: -Unknown- - Difficulty: 2) (Auras: 196285 - -Unknown-)
(@CGUID+658, 95939, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3260.42, 3770.616, 3.988496, 3.924816, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 踏浪巨人 (Area: -Unknown- - Difficulty: 2) (Auras: 18950 - -Unknown-)
(@CGUID+659, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3608.264, 3973.013, 25.05168, 1.23599, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+660, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3618.33, 3957.963, 25.12261, 6.014537, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+661, 91796, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3267.428, 3753.283, 5.747958, 1.936007, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 海巨人弄潮者 (Area: -Unknown- - Difficulty: 2) (Auras: 18950 - -Unknown-)
(@CGUID+662, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3611.505, 3974.581, 25.71069, 3.256, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-) (possible waypoints or random movement)
(@CGUID+663, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3611.303, 3960.036, 24.49222, 1.607929, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+664, 101414, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3618.371, 3961.403, 26.41385, 1.63553, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜伏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196107 - -Unknown-)
(@CGUID+665, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3618.11, 3969.335, 27.34364, 1.790948, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+666, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3605.171, 3909.304, 16.78436, 0.3172289, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+667, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3603.961, 3904.071, 17.57196, 1.803298, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+668, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3627.549, 3958.165, 27.2363, 4.634194, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+669, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3602.728, 3899.77, 15.99056, 0.6468661, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+670, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3610.738, 3897.845, 14.69953, 4.858834, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+671, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3611.352, 3903.143, 15.72296, 5.850887, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+672, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3631.25, 3964.584, 28.77457, 2.789533, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+673, 101414, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3615.227, 3901.932, 14.94538, 1.428345, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜伏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196107 - -Unknown-)
(@CGUID+674, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3626.873, 3901.325, 10.16396, 3.291642, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+675, 99908, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3507.934, 3953.624, 7.50148, 5.677579, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+676, 91794, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3621.771, 3895.729, 12.3227, 2.997904, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 盐鳞潜藏者 (Area: -Unknown- - Difficulty: 2) (Auras: 196108 - -Unknown-)
(@CGUID+677, 99908, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3572.532, 3956.388, 16.73299, 5.098696, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+678, 99908, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3596.364, 3936.01, 14.06374, 0.4666922, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+679, 99908, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3660.144, 4080.207, 24.30281, 0.148353, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+680, 99908, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3665.585, 4103.538, 23.51858, 0.148353, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 掠行软壳蟹 (Area: -Unknown- - Difficulty: 2) (Auras: 123168 - -Unknown-)
(@CGUID+681, 96028, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3487.259, 4385.587, -3.1943, 4.93578, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 艾萨拉之怒 (Area: -Unknown- - Difficulty: 2) (Auras: 192632 - -Unknown-)
(@CGUID+682, 97739, 1456, 8040, 8083, 8388870, '0', 0, 0, 0, -3484.453, 4386.284, 0.7607061, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124); -- 潮汐奔涌 (Area: -Unknown- - Difficulty: 2)

DELETE FROM `creature_addon` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+682;
INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+61, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨战士
(@CGUID+62, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨战士
(@CGUID+63, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+64, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海湾沙鸥
(@CGUID+65, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+66, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨牧鱼者
(@CGUID+67, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- -Unknown-
(@CGUID+68, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+69, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨战士
(@CGUID+70, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+71, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨牧鱼者
(@CGUID+72, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+73, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+74, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+75, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨战士
(@CGUID+76, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+77, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨战士
(@CGUID+78, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨牧鱼者
(@CGUID+79, 0, 0, 0, 1, 0, 0, 0, 0, '115385'), -- 积怨战士 - 115385 - -Unknown-
(@CGUID+80, 0, 0, 0, 1, 0, 0, 0, 0, '115385'), -- 积怨战士 - 115385 - -Unknown-
(@CGUID+81, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨神谕者
(@CGUID+82, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+83, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨牧鱼者
(@CGUID+84, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨牧鱼者
(@CGUID+85, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨神谕者
(@CGUID+86, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+87, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨战士
(@CGUID+88, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨神谕者 - 191798 - -Unknown-
(@CGUID+89, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+90, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+91, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+92, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨战士
(@CGUID+93, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+94, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海湾沙鸥
(@CGUID+95, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+96, 0, 0, 0, 1, 0, 0, 0, 0, '199865 197115'), -- 积怨奥术师 - 199865 - -Unknown-, 197115 - -Unknown-
(@CGUID+97, 0, 0, 0, 1, 0, 0, 0, 0, '115385'), -- 积怨战士 - 115385 - -Unknown-
(@CGUID+98, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+99, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨神谕者
(@CGUID+100, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+101, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨牧鱼者
(@CGUID+102, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+103, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨碾压者 - 191798 - -Unknown-
(@CGUID+104, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+105, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+106, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨神谕者
(@CGUID+107, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+108, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨碾压者
(@CGUID+109, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+110, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨战士
(@CGUID+111, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+112, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+113, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨战士 - 191798 - -Unknown-
(@CGUID+114, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+115, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨牧鱼者 - 191798 - -Unknown-
(@CGUID+116, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+117, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨神谕者
(@CGUID+118, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海湾沙鸥
(@CGUID+119, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+120, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+121, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨碾压者 - 191798 - -Unknown-
(@CGUID+122, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+123, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨战士 - 191798 - -Unknown-
(@CGUID+124, 0, 0, 0, 1, 0, 0, 0, 0, '202146'), -- 督军帕杰什 - 202146 - -Unknown-
(@CGUID+125, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+126, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+127, 0, 0, 0, 1, 0, 0, 0, 0, '115385'), -- 积怨战士 - 115385 - -Unknown-
(@CGUID+128, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨战士 - 191798 - -Unknown-
(@CGUID+129, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+130, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨神谕者 - 191798 - -Unknown-
(@CGUID+131, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 积怨战士
(@CGUID+132, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+133, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+134, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨牧鱼者 - 191798 - -Unknown-
(@CGUID+135, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨战士 - 191798 - -Unknown-
(@CGUID+136, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+137, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+138, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海湾沙鸥
(@CGUID+139, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+140, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+141, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨战士 - 191798 - -Unknown-
(@CGUID+142, 0, 0, 0, 1, 0, 0, 0, 0, '196786'), -- 积怨织雷者 - 196786 - -Unknown-
(@CGUID+143, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 焦躁的海潮元素 - 191798 - -Unknown-
(@CGUID+144, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+145, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+146, 0, 0, 50331648, 1, 0, 0, 0, 0, '191798 194899'), -- 海湾沙鸥 - 191798 - -Unknown-, 194899 - -Unknown-
(@CGUID+147, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨战士 - 191798 - -Unknown-
(@CGUID+148, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+149, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+150, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+151, 0, 0, 50331648, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+152, 0, 0, 50331648, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+153, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海湾沙鸥
(@CGUID+154, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+155, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨碾压者 - 191798 - -Unknown-
(@CGUID+156, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+157, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+158, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+159, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+160, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 游荡的硬壳龟 - 196285 - -Unknown-
(@CGUID+161, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+162, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+163, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海湾沙鸥
(@CGUID+164, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+165, 0, 0, 50331648, 1, 0, 0, 0, 0, '197868'), -- 积怨夫人 - 197868 - -Unknown-
(@CGUID+166, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海湾沙鸥
(@CGUID+167, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+168, 0, 0, 50331648, 1, 0, 0, 0, 0, '191792'), -- Weatherman - 191792 - -Unknown-
(@CGUID+169, 0, 0, 0, 1, 0, 0, 0, 0, '199865 197115 161837'), -- 积怨奥术师 - 199865 - -Unknown-, 197115 - -Unknown-, 161837 - -Unknown-
(@CGUID+170, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海湾沙鸥
(@CGUID+171, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+172, 0, 0, 0, 1, 0, 0, 0, 0, '193491'), -- 秘术师萨维 - 193491 - -Unknown-
(@CGUID+173, 0, 0, 50331648, 1, 0, 0, 0, 0, '192732 192737 192736'), -- Lightning Stalker - 192732 - -Unknown-, 192737 - -Unknown-, 192736 - -Unknown-
(@CGUID+174, 0, 0, 0, 1, 0, 0, 0, 0, '199865 197115 161837'), -- 积怨奥术师 - 199865 - -Unknown-, 197115 - -Unknown-, 161837 - -Unknown-
(@CGUID+175, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 深须国王 - 191798 - -Unknown-
(@CGUID+176, 0, 0, 0, 1, 0, 0, 0, 0, '199865 197115'), -- 积怨奥术师 - 199865 - -Unknown-, 197115 - -Unknown-
(@CGUID+177, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海湾沙鸥
(@CGUID+178, 0, 0, 0, 1, 0, 0, 0, 0, '193491'), -- 束缚者阿什奥伊 - 193491 - -Unknown-
(@CGUID+179, 0, 0, 0, 1, 0, 0, 0, 0, '193491'), -- 祭祀者勒莎 - 193491 - -Unknown-
(@CGUID+180, 0, 0, 0, 1, 0, 0, 0, 0, '193491'), -- 导魔者瓦里兹 - 193491 - -Unknown-
(@CGUID+181, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+182, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+183, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+184, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+185, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+186, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+187, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+188, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+189, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海湾沙鸥
(@CGUID+190, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+191, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+192, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+193, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+194, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+195, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+196, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+197, 0, 0, 50331648, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+198, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+199, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+200, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+201, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+202, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 焦躁的海潮元素 - 191798 - -Unknown-
(@CGUID+203, 0, 0, 0, 1, 0, 0, 0, 0, '18950'), -- 海巨人弄潮者 - 18950 - -Unknown-
(@CGUID+204, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨缚潮者 - 191798 - -Unknown-
(@CGUID+205, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨缚潮者 - 191798 - -Unknown-
(@CGUID+206, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 活体风暴 - 191798 - -Unknown-
(@CGUID+207, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+208, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+209, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+210, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 焦躁的海潮元素 - 191798 - -Unknown-
(@CGUID+211, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+212, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 活体风暴 - 191798 - -Unknown-
(@CGUID+213, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+214, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+215, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+216, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨缚潮者 - 191798 - -Unknown-
(@CGUID+217, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 活体风暴 - 191798 - -Unknown-
(@CGUID+218, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 焦躁的海潮元素 - 191798 - -Unknown-
(@CGUID+219, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+220, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+221, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+222, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+223, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+224, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+225, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+226, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+227, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+228, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+229, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+230, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 瑟芬崔斯克 - 191798 - -Unknown-
(@CGUID+231, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+232, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+233, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+234, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+235, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+236, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+237, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+238, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+239, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+240, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+241, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+242, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+243, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+244, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+245, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+246, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+247, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+248, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+249, 0, 0, 0, 1, 0, 0, 0, 0, '191798'); -- 盐海小水滴 - 191798 - -Unknown-

INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+250, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 掠行软壳蟹 - 191798 - -Unknown-
(@CGUID+251, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+252, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+253, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+254, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+255, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+256, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+257, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+258, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+259, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 辉鳞鲈鱼 - 191798 - -Unknown-
(@CGUID+260, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+261, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+262, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+263, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+264, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+265, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+266, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+267, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+268, 0, 0, 0, 1, 0, 0, 0, 0, '196107'), -- 盐鳞潜伏者 - 196107 - -Unknown-
(@CGUID+269, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+270, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+271, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+272, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+273, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+274, 0, 0, 0, 1, 0, 0, 0, 0, '193060 193064'), -- 沙丘 - 193060 - -Unknown-, 193064 - -Unknown-
(@CGUID+275, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+276, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+277, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+278, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+279, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+280, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+281, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+282, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+283, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+284, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 萨奇尔
(@CGUID+285, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+286, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+287, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+288, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- -Unknown-
(@CGUID+289, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+290, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+291, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+292, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+293, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+294, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+295, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+296, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+297, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+298, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+299, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+300, 0, 0, 0, 1, 0, 0, 0, 0, '196107'), -- 盐鳞潜伏者 - 196107 - -Unknown-
(@CGUID+301, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+302, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+303, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+304, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+305, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+306, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+307, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+308, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+309, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+310, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+311, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+312, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+313, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+314, 0, 0, 50331648, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+315, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- -Unknown-
(@CGUID+316, 0, 0, 0, 1, 0, 0, 0, 0, '196201'), -- 玛拉纳硬壳战士 - 196201 - -Unknown-
(@CGUID+317, 0, 0, 50331648, 1, 0, 0, 0, 0, '191798'), -- 海湾沙鸥 - 191798 - -Unknown-
(@CGUID+318, 0, 0, 50331648, 1, 0, 0, 0, 0, '191798'), -- 海湾沙鸥 - 191798 - -Unknown-
(@CGUID+319, 0, 0, 50331648, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+320, 0, 0, 50331648, 1, 0, 0, 0, 0, '194899 191798'), -- 海湾沙鸥 - 194899 - -Unknown-, 191798 - -Unknown-
(@CGUID+321, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+322, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+323, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 焦躁的海潮元素 - 191798 - -Unknown-
(@CGUID+324, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+325, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+326, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+327, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+328, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+329, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+330, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+331, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 积怨缚潮者 - 191798 - -Unknown-
(@CGUID+332, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 活体风暴 - 191798 - -Unknown-
(@CGUID+333, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 盐海小水滴 - 191798 - -Unknown-
(@CGUID+334, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+335, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+336, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+337, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 逐潮蟹 - 191798 - -Unknown-
(@CGUID+338, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+339, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+340, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+341, 0, 0, 3, 1, 0, 0, 0, 0, '55701'), -- 苦水清道夫 - 55701 - -Unknown-
(@CGUID+342, 0, 0, 3, 1, 0, 0, 0, 0, '55701'), -- 苦水清道夫 - 55701 - -Unknown-
(@CGUID+343, 0, 0, 3, 1, 0, 0, 0, 0, '55701'), -- 苦水清道夫 - 55701 - -Unknown-
(@CGUID+344, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 掠行软壳蟹 - 191798 - -Unknown-
(@CGUID+345, 0, 0, 3, 1, 0, 0, 0, 0, '55701'), -- 苦水清道夫 - 55701 - -Unknown-
(@CGUID+346, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+347, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+348, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+349, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+350, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+351, 0, 0, 3, 1, 0, 0, 0, 0, '55701'), -- 苦水清道夫 - 55701 - -Unknown-
(@CGUID+352, 0, 0, 3, 1, 0, 0, 0, 0, '55701'), -- 苦水清道夫 - 55701 - -Unknown-
(@CGUID+353, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+354, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+355, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+356, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+357, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+358, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+359, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 渗穴
(@CGUID+360, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+361, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+362, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+363, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+364, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+365, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 渗穴
(@CGUID+366, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+367, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+368, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+369, 0, 0, 0, 1, 0, 0, 0, 0, '196201'), -- 玛拉纳硬壳战士 - 196201 - -Unknown-
(@CGUID+370, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+371, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+372, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+373, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+374, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+375, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+376, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+377, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+378, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+379, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+380, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+381, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+382, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 渗穴
(@CGUID+383, 0, 0, 0, 1, 0, 0, 0, 0, '202314'), -- 唤雷多头蛇 - 202314 - -Unknown-
(@CGUID+384, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+385, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+386, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 玛拉纳沙地行者 - 191798 - -Unknown-
(@CGUID+387, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+388, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+389, 0, 0, 0, 1, 0, 0, 0, 0, '202314'), -- 唤雷多头蛇 - 202314 - -Unknown-
(@CGUID+390, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+391, 0, 0, 50331648, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+392, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+393, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+394, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+395, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+396, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+397, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 渗穴
(@CGUID+398, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+399, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+400, 0, 0, 50331648, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+401, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+402, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+403, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+404, 0, 0, 0, 1, 0, 0, 0, 0, '196201'), -- 玛拉纳硬壳战士 - 196201 - -Unknown-
(@CGUID+405, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+406, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+407, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 渗穴
(@CGUID+408, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+409, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+410, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 渗穴
(@CGUID+411, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+412, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+413, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+414, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+415, 0, 0, 50331648, 1, 0, 0, 0, 0, '191798'), -- 海湾沙鸥 - 191798 - -Unknown-
(@CGUID+416, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+417, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+418, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+419, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+420, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+421, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+422, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+423, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+424, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+425, 0, 0, 50331648, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+426, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+427, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+428, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+429, 0, 0, 50331648, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+430, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+431, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+432, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+433, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+434, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 玛拉纳沙地行者 - 191798 - -Unknown-
(@CGUID+435, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+436, 0, 0, 50331648, 1, 0, 0, 0, 0, '191798'), -- 海湾沙鸥 - 191798 - -Unknown-
(@CGUID+437, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+438, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+439, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+440, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+441, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+442, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+443, 0, 0, 50331648, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+444, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+445, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+446, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+447, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+448, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+449, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+450, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+451, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+452, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+453, 0, 0, 0, 1, 0, 0, 0, 0, '202314'), -- 唤雷多头蛇 - 202314 - -Unknown-
(@CGUID+454, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+455, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+456, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+457, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+458, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+459, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+460, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水清道夫 - 191798 - -Unknown-
(@CGUID+461, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+462, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+463, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+464, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+465, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+466, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+467, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+468, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+469, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+470, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+471, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+472, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+473, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+474, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+475, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+476, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 逐潮蟹 - 123168 - -Unknown-
(@CGUID+477, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+478, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+479, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+480, 0, 0, 1, 1, 0, 0, 0, 0, '18950 191798'), -- 海巨人弄潮者 - 18950 - -Unknown-, 191798 - -Unknown-
(@CGUID+481, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+482, 0, 0, 0, 1, 0, 0, 0, 0, '196285 191798'), -- 砂泥蜗牛 - 196285 - -Unknown-, 191798 - -Unknown-
(@CGUID+483, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+484, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+485, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+486, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+487, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+488, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+489, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+490, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+491, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+492, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+493, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+494, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+495, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+496, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+497, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+498, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+499, 0, 0, 50331648, 1, 0, 0, 0, 0, ''); -- 呼潮引浪

INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+500, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+501, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+502, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+503, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+504, 0, 0, 0, 1, 0, 0, 0, 0, '191798 18950'), -- 踏浪巨人 - 191798 - -Unknown-, 18950 - -Unknown-
(@CGUID+505, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+506, 0, 0, 0, 1, 0, 0, 0, 0, '196108 191798'), -- 盐鳞潜藏者 - 196108 - -Unknown-, 191798 - -Unknown-
(@CGUID+507, 0, 0, 0, 1, 0, 0, 0, 0, '196108 191798'), -- 盐鳞潜藏者 - 196108 - -Unknown-, 191798 - -Unknown-
(@CGUID+508, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+509, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+510, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+511, 0, 0, 0, 1, 0, 0, 0, 0, '196108 191798'), -- 盐鳞潜藏者 - 196108 - -Unknown-, 191798 - -Unknown-
(@CGUID+512, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+513, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+514, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+515, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+516, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+517, 0, 0, 0, 1, 0, 0, 0, 0, '196107 191798'), -- 盐鳞潜伏者 - 196107 - -Unknown-, 191798 - -Unknown-
(@CGUID+518, 0, 0, 0, 1, 0, 0, 0, 0, '196108 191798'), -- 盐鳞潜藏者 - 196108 - -Unknown-, 191798 - -Unknown-
(@CGUID+519, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+520, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+521, 0, 0, 0, 1, 0, 0, 0, 0, '196108 191798'), -- 盐鳞潜藏者 - 196108 - -Unknown-, 191798 - -Unknown-
(@CGUID+522, 0, 0, 0, 1, 0, 0, 0, 0, '191798 18950'), -- 海巨人弄潮者 - 191798 - -Unknown-, 18950 - -Unknown-
(@CGUID+523, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+524, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+525, 0, 0, 0, 1, 0, 0, 0, 0, '196108 191798'), -- 盐鳞潜藏者 - 196108 - -Unknown-, 191798 - -Unknown-
(@CGUID+526, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+527, 0, 0, 0, 1, 0, 0, 0, 0, '196108 191798'), -- 盐鳞潜藏者 - 196108 - -Unknown-, 191798 - -Unknown-
(@CGUID+528, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+529, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+530, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+531, 0, 0, 0, 1, 0, 0, 0, 0, '196285 191798'), -- 砂泥蜗牛 - 196285 - -Unknown-, 191798 - -Unknown-
(@CGUID+532, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+533, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+534, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+535, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+536, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+537, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+538, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+539, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+540, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+541, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+542, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+543, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+544, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+545, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+546, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+547, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+548, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+549, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+550, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+551, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+552, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+553, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+554, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+555, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+556, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+557, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+558, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+559, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+560, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+561, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+562, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+563, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+564, 0, 0, 0, 1, 0, 0, 0, 0, '123168 191798'), -- 掠行软壳蟹 - 123168 - -Unknown-, 191798 - -Unknown-
(@CGUID+565, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+566, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 烈焰多头蛇子嗣
(@CGUID+567, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 奥术多头蛇子嗣
(@CGUID+568, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 烈焰多头蛇子嗣
(@CGUID+569, 0, 0, 50331648, 1, 0, 0, 0, 0, '192007'), -- 奥术多头蛇子嗣 - 192007 - -Unknown-
(@CGUID+570, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 辉鳞鲈鱼 - 123168 - -Unknown-
(@CGUID+571, 0, 0, 0, 1, 0, 0, 0, 0, '196107'), -- 盐鳞潜伏者 - 196107 - -Unknown-
(@CGUID+572, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+573, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+574, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+575, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+576, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+577, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+578, 0, 0, 0, 1, 0, 0, 0, 0, '18950'), -- 踏浪巨人 - 18950 - -Unknown-
(@CGUID+579, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+580, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+581, 0, 0, 0, 1, 0, 0, 0, 0, '18950'), -- 海巨人弄潮者 - 18950 - -Unknown-
(@CGUID+582, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+583, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+584, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+585, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+586, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+587, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+588, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+589, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+590, 0, 0, 0, 1, 0, 0, 0, 0, '196107'), -- 盐鳞潜伏者 - 196107 - -Unknown-
(@CGUID+591, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+592, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+593, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+594, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+595, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+596, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+597, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+598, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+599, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+600, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+601, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+602, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+603, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+604, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+605, 0, 0, 0, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+606, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+607, 0, 0, 0, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+608, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+609, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+610, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+611, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+612, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 呼潮引浪
(@CGUID+613, 0, 0, 0, 1, 0, 0, 0, 0, '196107'), -- 盐鳞潜伏者 - 196107 - -Unknown-
(@CGUID+614, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+615, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+616, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+617, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+618, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+619, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+620, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+621, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+622, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+623, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+624, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+625, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+626, 0, 0, 0, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+627, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+628, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+629, 0, 0, 0, 1, 0, 0, 0, 0, '191798'), -- 苦水奴隶 - 191798 - -Unknown-
(@CGUID+630, 0, 0, 0, 1, 0, 0, 0, 0, '196107'), -- 盐鳞潜伏者 - 196107 - -Unknown-
(@CGUID+631, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+632, 0, 0, 0, 1, 0, 0, 0, 0, '194899'), -- 海湾沙鸥 - 194899 - -Unknown-
(@CGUID+633, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+634, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+635, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+636, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+637, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+638, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+639, 0, 0, 1, 1, 0, 0, 0, 0, '18950'), -- 踏浪巨人 - 18950 - -Unknown-
(@CGUID+640, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+641, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+642, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 苦水奴隶
(@CGUID+643, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+644, 0, 0, 0, 1, 0, 0, 0, 0, '18950'), -- 海巨人弄潮者 - 18950 - -Unknown-
(@CGUID+645, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+646, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+647, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+648, 0, 0, 0, 1, 0, 0, 0, 0, '196107'), -- 盐鳞潜伏者 - 196107 - -Unknown-
(@CGUID+649, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+650, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+651, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+652, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+653, 0, 0, 1, 1, 0, 0, 0, 0, '18950'), -- 海巨人弄潮者 - 18950 - -Unknown-
(@CGUID+654, 0, 0, 0, 1, 0, 0, 0, 0, '18950'), -- 踏浪巨人 - 18950 - -Unknown-
(@CGUID+655, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+656, 0, 0, 3, 1, 0, 0, 0, 0, '55701 18950'), -- 踏浪巨人 - 55701 - -Unknown-, 18950 - -Unknown-
(@CGUID+657, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 砂泥蜗牛 - 196285 - -Unknown-
(@CGUID+658, 0, 0, 0, 1, 0, 0, 0, 0, '18950'), -- 踏浪巨人 - 18950 - -Unknown-
(@CGUID+659, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+660, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+661, 0, 0, 0, 1, 0, 0, 0, 0, '18950'), -- 海巨人弄潮者 - 18950 - -Unknown-
(@CGUID+662, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+663, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+664, 0, 0, 0, 1, 0, 0, 0, 0, '196107'), -- 盐鳞潜伏者 - 196107 - -Unknown-
(@CGUID+665, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+666, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+667, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+668, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+669, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+670, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+671, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+672, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+673, 0, 0, 0, 1, 0, 0, 0, 0, '196107'), -- 盐鳞潜伏者 - 196107 - -Unknown-
(@CGUID+674, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+675, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+676, 0, 0, 0, 1, 0, 0, 0, 0, '196108'), -- 盐鳞潜藏者 - 196108 - -Unknown-
(@CGUID+677, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+678, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+679, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+680, 0, 0, 0, 1, 0, 0, 0, 0, '123168'), -- 掠行软壳蟹 - 123168 - -Unknown-
(@CGUID+681, 0, 0, 0, 1, 0, 0, 0, 0, '192632'), -- 艾萨拉之怒 - 192632 - -Unknown-
(@CGUID+682, 0, 0, 50331648, 1, 0, 0, 0, 0, ''); -- 潮汐奔涌

DELETE FROM `gameobject` WHERE `guid` BETWEEN @OGUID+0 AND @OGUID+21;
INSERT INTO `gameobject` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `position_x`, `position_y`, `position_z`, `orientation`, `rotation0`, `rotation1`, `rotation2`, `rotation3`, `spawntimesecs`, `animprogress`, `state`, `VerifiedBuild`) VALUES
(@OGUID+9, 252247, 1456, 8040, 8081, 8388870, '0', 0, -3925.479, 4549.06, 91.90079, 5.736945, 0, 0, -0.2697372, 0.962934, 7200, 255, 1, 26124), -- -Unknown- (Area: -Unknown- - Difficulty: 2)
(@OGUID+10, 244690, 1456, 8040, 8081, 8388870, '0', 0, -3464.789, 4614.286, -0.3546312, 2.285685, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) - !!! might be temporary spawn !!!
(@OGUID+11, 244690, 1456, 8040, 8081, 8388870, '0', 0, -3440.594, 4620.173, -0.3546311, 0, 0, 0, 0, 1, 7200, 255, 1, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) - !!! might be temporary spawn !!!
(@OGUID+12, 244690, 1456, 8040, 8081, 8388870, '0', 0, -3420.625, 4616.911, -0.3546244, 1.652568, 0, 0, 0.7354183, 0.6776134, 7200, 255, 1, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) - !!! might be temporary spawn !!!
(@OGUID+13, 244690, 1456, 8040, 8081, 8388870, '0', 0, -3402.368, 4589.106, -0.3546078, 5.488473, 0, 0, -0.386982, 0.9220873, 7200, 255, 1, 26124), -- 沙丘 (Area: -Unknown- - Difficulty: 2) - !!! might be temporary spawn !!!
(@OGUID+14, 253992, 1456, 8040, 8081, 8388870, '0', 0, -3302.009, 4636.043, 1.99028, 4.261332, 0, 0, -0.8473244, 0.5310757, 7200, 255, 1, 26124), -- 饰品箱 (Area: -Unknown- - Difficulty: 2)
(@OGUID+15, 253992, 1456, 8040, 8081, 8388870, '0', 0, -3334.002, 4773.344, 0.7308794, 5.012758, 0.03285694, 0.03907585, -0.5927095, 0.8037965, 7200, 255, 1, 26124), -- 饰品箱 (Area: -Unknown- - Difficulty: 2)

(@OGUID+0, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3465.96, 4582.65, -0.354631, 2.59854, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+1, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3471.26, 4568.86, -0.354631, 4.72933, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+2, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3478.83, 4596.36, -0.354631, 4.72933, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+3, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3452.93, 4569.12, -0.354621, 1.65257, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+4, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3443.34, 4590.65, -0.354631, 5.58664, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+5, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3463.75, 4596.38, -0.354631, 3.91666, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+6, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3440.32, 4553.86, -0.354614, 0.473327, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+7, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3447.14, 4603.75, -0.354631, 5.99311, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+8, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3450.3, 4579.59, -0.354631, 0.630552, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+16, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3462.64, 4552.49, -0.354621, 6.21155, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+17, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3426.3, 4560.19, -0.354614, 1.27597, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+18, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3415.41, 4570.52, -0.354614, 2.57894, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+19, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3425.11, 4604.11, -0.354628, 4.43545, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+20, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3425.97, 4586.57, -0.354627, 2.28569, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),-- 沙丘 
(@OGUID+21, 244690, 1456, 8040, 8081, 8388870, '0', 0,-3408.97, 4608.92, -0.354607, 0.256104, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124);-- 沙丘 
-- (@OGUID+9, 252247, 1456, 8040, 8081, 8388870, '0', 0,-3440.59, 4620.17, -0.354631, 0, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),
-- (@OGUID+9, 252247, 1456, 8040, 8081, 8388870, '0', 0,-3464.79, 4614.29, -0.354631, 2.28569, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),--10
-- (@OGUID+9, 252247, 1456, 8040, 8081, 8388870, '0', 0,-3420.62, 4616.91, -0.354624, 1.65257, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),
-- (@OGUID+9, 252247, 1456, 8040, 8081, 8388870, '0', 0,-3402.37, 4589.11, -0.354608, 5.48847, 0, 0, 0.9098167, 0.4150103, 7200, 255, 1, 26124),





DELETE FROM `creature_template_addon` WHERE `entry`=97260;
INSERT INTO `creature_template_addon` (`entry`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(97260, 0, 0, 50331648, 1, 0, 0, 0, 0, ''); -- 97260 (奥术多头蛇子嗣)

UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=93538; -- 93538
UPDATE `creature_template_addon` SET `auras`='226952' WHERE `entry`=113901; -- 113901
UPDATE `creature_template_addon` SET `auras`='210063' WHERE `entry`=96782; -- 96782
UPDATE `creature_template_addon` SET `auras`='191798 18950' WHERE `entry`=95939; -- 95939 (踏浪巨人)
UPDATE `creature_template_addon` SET `bytes1`=3, `auras`='55701' WHERE `entry`=99629; -- 99629 (苦水清道夫)
UPDATE `creature_template_addon` SET `bytes1`=3, `auras`='55701' WHERE `entry`=99630; -- 99630 (苦水清道夫)
UPDATE `creature_template_addon` SET `bytes1`=3, `auras`='55701' WHERE `entry`=95940; -- 95940 (苦水清道夫)
UPDATE `creature_template_addon` SET `auras`='191798' WHERE `entry`=91797; -- 91797 (深须国王)
UPDATE `creature_template_addon` SET `auras`='191798 194899' WHERE `entry`=91787; -- 91787 (海湾沙鸥)
UPDATE `creature_template_addon` SET `auras`='199865 197115' WHERE `entry`=97171; -- 97171 (积怨奥术师)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=95861; -- 95861 (积怨神谕者)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=100216; -- 100216 (积怨牧鱼者)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=91781; -- 91781 (积怨战士)
UPDATE `creature_template_addon` SET `auras`='122729' WHERE `entry`=62821; -- 62821
UPDATE `creature_template_addon` SET `auras`='122729' WHERE `entry`=62822; -- 62822
UPDATE `creature_template_addon` SET `auras`='61424' WHERE `entry`=32639; -- 32639
UPDATE `creature_template_addon` SET `auras`='61424' WHERE `entry`=32638; -- 32638
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=104230; -- 104230


UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97263;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=100205;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=99901;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97263;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97916;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=99901;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97739;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97673;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97713;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=99901;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97263;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97916;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97673;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97916;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=99901;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97063;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97263;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97916;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=99901;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97916;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=99901;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=99901;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97263;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=99901;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97263;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97853;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=99901;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=99901;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=97844;


UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=1072;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=5585;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=52659;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=58842;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=64048;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=5777;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=2954;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65714;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=27822;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69926;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=1206;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=25791;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65233;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65452;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65228;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65232;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65255;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65251;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=31379;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66741;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65146;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65145;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66820;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=61620;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=55460;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=42978;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66063;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=1995;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=664;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=1763;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66508;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66509;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65110;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66510;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=31183;
UPDATE `creature_model_info` SET `BoundingRadius`=1.042447, `VerifiedBuild`=26124 WHERE `DisplayID`=23504;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=19365;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66819;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=4878;
UPDATE `creature_model_info` SET `BoundingRadius`=2.505799, `CombatReach`=3.5, `VerifiedBuild`=26124 WHERE `DisplayID`=66535;
UPDATE `creature_model_info` SET `BoundingRadius`=2.505799, `CombatReach`=3.5, `VerifiedBuild`=26124 WHERE `DisplayID`=66534;
UPDATE `creature_model_info` SET `BoundingRadius`=2.505799, `CombatReach`=3.5, `VerifiedBuild`=26124 WHERE `DisplayID`=66536;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=67254;
UPDATE `creature_model_info` SET `BoundingRadius`=2.505799, `CombatReach`=3.5, `VerifiedBuild`=26124 WHERE `DisplayID`=29934;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66397;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=32063;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=39490;
UPDATE `creature_model_info` SET `BoundingRadius`=2.013742, `VerifiedBuild`=26124 WHERE `DisplayID`=36212;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=25675;
UPDATE `creature_model_info` SET `BoundingRadius`=5.497285, `VerifiedBuild`=26124 WHERE `DisplayID`=65114;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=51219;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66813;
UPDATE `creature_model_info` SET `BoundingRadius`=2.147828, `VerifiedBuild`=26124 WHERE `DisplayID`=66163;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=45060;
UPDATE `creature_model_info` SET `BoundingRadius`=1.217102, `VerifiedBuild`=26124 WHERE `DisplayID`=66153;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=45568;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69708;
UPDATE `creature_model_info` SET `BoundingRadius`=1.92405, `VerifiedBuild`=26124 WHERE `DisplayID`=18393;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66152;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=51409;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=51124;
UPDATE `creature_model_info` SET `BoundingRadius`=2.198914, `VerifiedBuild`=26124 WHERE `DisplayID`=66499;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=48278;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65226;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=28282;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=28111;


UPDATE `creature_equip_template` SET `ItemID3`=45872 WHERE (`CreatureID`=91789 AND `ID`=1); -- 积怨夫人

/*
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=96483; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=113783; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=92489; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=93543; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=93527; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=93526; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=92195; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=93538; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=92458; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=114719; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=92456; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=92457; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=106655; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=96817; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=96818; -- -Unknown-
*/
UPDATE `creature_template` SET `minlevel`=108, `maxlevel`=108 WHERE `entry`=96636; -- -Unknown-
UPDATE `creature_template` SET `minlevel`=103, `maxlevel`=103 WHERE `entry`=112079; -- -Unknown-
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112 WHERE `entry`=96028; -- 艾萨拉之怒
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=4196352 WHERE `entry`=97260; -- 奥术多头蛇子嗣
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112 WHERE `entry`=97259; -- 烈焰多头蛇子嗣
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `speed_run`=1.142857 WHERE `entry`=95939; -- 踏浪巨人
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=91790; -- 玛拉纳沙地行者
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `speed_walk`=1 WHERE `entry`=91792; -- 唤雷多头蛇
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=99629; -- 苦水清道夫
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=99630; -- 苦水清道夫
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=95940; -- 苦水清道夫
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=91793; -- 逐潮蟹
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=95947; -- 玛拉纳硬壳战士
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=101414; -- 盐鳞潜伏者
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=91794; -- 盐鳞潜藏者
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=106785; -- 苦水奴隶
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=106787; -- 苦水奴隶
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112 WHERE `entry`=91808; -- 瑟芬崔斯克
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=106786; -- 苦水奴隶
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=95920; -- 活体风暴
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=97170; -- 积怨缚潮者
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `speed_run`=1.142857 WHERE `entry`=91796; -- 海巨人弄潮者
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111 WHERE `entry`=100249; -- 导魔者瓦里兹
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `unit_flags3`=1 WHERE `entry`=100248; -- 祭祀者勒莎
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111 WHERE `entry`=100250; -- 束缚者阿什奥伊
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112 WHERE `entry`=91797; -- 深须国王
UPDATE `creature_template` SET `unit_flags3`=1 WHERE `entry`=97713; -- Lightning Stalker
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111 WHERE `entry`=98173; -- 秘术师萨维
UPDATE `creature_template` SET `unit_flags3`=1 WHERE `entry`=97063; -- Weatherman
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `unit_flags3`=1 WHERE `entry`=91789; -- 积怨夫人
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=91787; -- 海湾沙鸥
UPDATE `creature_template` SET `minlevel`=110, `speed_walk`=1 WHERE `entry`=97173; -- 焦躁的海潮元素
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=97172; -- 盐海小水滴
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112 WHERE `entry`=91784; -- 督军帕杰什
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=91786; -- 砂泥蜗牛
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111 WHERE `entry`=91782; -- 积怨碾压者
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111 WHERE `entry`=97171; -- 积怨奥术师
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=95861; -- 积怨神谕者
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=100216; -- 积怨牧鱼者
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=91783; -- 积怨织雷者
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=91785; -- 游荡的硬壳龟
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=91781; -- 积怨战士
UPDATE `creature_template` SET `minlevel`=105, `maxlevel`=105 WHERE `entry`=96641; -- -Unknown-
UPDATE `creature_template` SET `minlevel`=106, `maxlevel`=106 WHERE `entry`=96635; -- -Unknown-
UPDATE `creature_template` SET `minlevel`=102, `maxlevel`=102 WHERE `entry`=96592; -- -Unknown-


SET NAMES 'utf8';
SET @GROUP_ID=0;
SET @ID=0;

INSERT IGNORE INTO `creature_text` (`CreatureID`, `groupid`, `id`, `text`, `type`, `language`, `probability`, `emote`, `duration`, `sound`, `BroadcastTextId`, `comment`) VALUES
(91784, @GROUP_ID+0, @ID+0, '哼。入侵者。他们走不了多远。', 14, 0, 100, 0, 0, 54193, 101992, '督军帕杰什 to Player'),
(91784, @GROUP_ID+1, @ID+0, '啊，又是你，废物。现在只剩你我……还有我的卫兵了！', 14, 0, 100, 0, 0, 54181, 99890, '督军帕杰什 to Player'),
(91784, @GROUP_ID+2, @ID+0, '|TInterface\\Icons\\Spell_Shadow_UnholyFrenzy:20|t督军帕杰什被|cFFFF0000|Hspell:197064|h[激怒]|h|r了！', 41, 0, 100, 0, 0, 0, 101804, '督军帕杰什'),
(91784, @GROUP_ID+3, @ID+0, '你休想阻挡……风暴……', 14, 0, 100, 0, 0, 54182, 99894, '督军帕杰什 to Player'),
(91789, @GROUP_ID+0, @ID+0, '看来这儿有虫子……', 14, 0, 100, 0, 0, 56655, 104580, '积怨夫人 to Player'),
(91789, @GROUP_ID+1, @ID+0, '继续仪式！我来解决这些蠢货！', 14, 0, 100, 0, 0, 54194, 100227, '积怨夫人 to Player'),
(91789, @GROUP_ID+2, @ID+0, '炸焦你们，旱鸭子！', 14, 0, 100, 0, 0, 54200, 100235, '积怨夫人'),
(91789, @GROUP_ID+3, @ID+0, '|TInterface\\Icons\\Spell_Shaman_StaticShock:20|t%s开始引爆|cFFFF0000|Hspell:193597|h[静电新星]|h|r。快离开水域！', 41, 0, 100, 0, 0, 54200, 100243, '积怨夫人'),
(91789, @GROUP_ID+4, @ID+0, '|TInterface\\Icons\\Spell_Frost_SummonWaterElemental:20|t%s开始施放|cFFFF0000|Hspell:193682|h[召唤风暴]|h|r！', 41, 0, 100, 0, 0, 0, 100238, '积怨夫人'),
(91789, @GROUP_ID+5, @ID+0, '涨潮了……', 14, 0, 100, 0, 0, 54204, 100237, '积怨夫人'),
(91789, @GROUP_ID+6, @ID+0, '风暴正在汇聚……', 14, 0, 100, 0, 0, 54203, 100245, '积怨夫人'),
(91789, @GROUP_ID+7, @ID+0, '感觉到凉风了吗？它们来了……', 14, 0, 100, 0, 0, 54195, 100228, '积怨夫人 to Player'),
(91797, @GROUP_ID+0, @ID+0, '让海浪淹死你们这些可怜虫！', 14, 0, 100, 0, 0, 54316, 102315, '深须国王 to Player'),
(91797, @GROUP_ID+1, @ID+0, '我很好奇，你们能憋多久呢？', 14, 0, 100, 0, 0, 54312, 102305, '深须国王'),
(91797, @GROUP_ID+2, @ID+0, '地震是巨浪的先锋！', 14, 0, 100, 0, 0, 54314, 102307, '深须国王'),
(91797, @GROUP_ID+3, @ID+0, '|TInterface\\Icons\\spell_frost_summonwaterelemental:20|t%s开始施放|cFFFF0000|Hspell:193051|h[呼潮引浪]|h|r！', 41, 0, 100, 0, 0, 54164, 99824, '深须国王'),
(91797, @GROUP_ID+4, @ID+0, '让大海卷走你！', 14, 0, 100, 0, 0, 54164, 102302, '深须国王'),
(91797, @GROUP_ID+5, @ID+0, '%s变得愤怒了！', 16, 0, 100, 0, 0, 0, 24144, '深须国王'), -- BroadcastTextID: 2384 - 7798 - 24144
(91797, @GROUP_ID+6, @ID+0, '你们还没赢呢。她就要到了……', 14, 0, 100, 0, 0, 54318, 102311, '深须国王 to Player'),
(91808, @GROUP_ID+0, @ID+0, '|TInterface\\Icons\\ability_rogue_venomouswounds:20|t你受到了|cFFFF0000|Hspell:191855|h[剧毒创伤]|h|r的影响！', 42, 0, 100, 0, 0, 0, 98862, '瑟芬崔斯克 to Player'),
(91808, @GROUP_ID+1, @ID+0, '|TInterface\\Icons\\inv_misc_volatilewater:20|t%s开始|cFFFF0000|Hspell:191873|h[下潜]|h|r！', 41, 0, 100, 0, 0, 0, 99006, '瑟芬崔斯克'),
(96028, @GROUP_ID+0, @ID+0, '风暴已经苏醒。', 14, 0, 100, 0, 0, 54318, 99950, '艾萨拉之怒'),
(96028, @GROUP_ID+1, @ID+0, '涨潮了！', 14, 0, 100, 0, 0, 54207, 100046, '艾萨拉之怒 to Player'),
(96028, @GROUP_ID+2, @ID+0, '毁灭万物！', 14, 0, 100, 0, 0, 54205, 99943, '艾萨拉之怒 to Player'),
(96028, @GROUP_ID+3, @ID+0, '|TInterface\\Icons\\inv_misc_herb_stormvine:20|t%s开始发出|cFFFF0000|Hspell:192985|h[愤怒嚎叫]|h|r！', 41, 0, 100, 0, 0, 54208, 106737, '艾萨拉之怒'), -- BroadcastTextID: 106737 - 106736
(96028, @GROUP_ID+4, @ID+0, '风暴！', 14, 0, 100, 0, 0, 54208, 76941, '艾萨拉之怒'),
(96028, @GROUP_ID+5, @ID+0, '水……永恒……', 14, 0, 100, 0, 0, 54206, 99944, '艾萨拉之怒 to Player'),
(97171, @GROUP_ID+0, @ID+0, '护盾被削弱了！', 14, 0, 100, 0, 0, 0, 104567, '积怨奥术师 to Player'),
(97171, @GROUP_ID+1, @ID+0, '积怨夫人是无敌的！她是不会倒下的！', 14, 0, 100, 0, 0, 0, 104568, '积怨奥术师 to Player'),
(98173, @GROUP_ID+0, @ID+0, '我们还需要一点时间！', 14, 0, 100, 0, 0, 54207, 100045, '秘术师萨维 to Player'),
(100216, @GROUP_ID+0, @ID+0, '来了一群旱鸭子！我们要用盐和鳞片把他们赶回去！', 14, 0, 100, 0, 0, 0, 104346, '积怨牧鱼者 to Player'),
(100248, @GROUP_ID+0, @ID+0, '不！仪式还没有完成！', 14, 0, 100, 0, 0, 0, 100040, '祭祀者勒莎 to Player'),
(100249, @GROUP_ID+0, @ID+0, '束缚之力减弱了……', 14, 0, 100, 0, 0, 0, 100041, '导魔者瓦里兹 to Player'),
(100250, @GROUP_ID+0, @ID+0, '它还在成型！', 14, 0, 100, 0, 0, 0, 100042, '束缚者阿什奥伊 to Player');

INSERT IGNORE INTO `npc_spellclick_spells` (`npc_entry`, `spell_id`, `cast_flags`, `user_type`) VALUES
(119438, 237066, 0, 0),
(119396, 237066, 0, 0),
(119437, 237066, 0, 0),
(119436, 237066, 0, 0),
(92438, 103583, 0, 0),
(112947, 234593, 0, 0),
(107772, 234590, 0, 0),
(113901, 234595, 0, 0),
(116419, 231849, 0, 0),
(116420, 231849, 0, 0),
(116408, 231849, 0, 0),
(106359, 210857, 0, 0),
(68239, 75648, 0, 0);


/*
UPDATE `creature_template` SET `name`='野生小鬼' WHERE `entry`=99737; -- 野生小鬼
UPDATE `creature_template` SET `name`='秘法旋风', `type_flags2`=128, `VerifiedBuild`=26124 WHERE `entry`=97673; -- 秘法旋风
UPDATE `creature_template` SET `name`='潮汐奔涌', `VerifiedBuild`=26124 WHERE `entry`=97739; -- 潮汐奔涌
UPDATE `creature_template` SET `name`='奎克', `VerifiedBuild`=26124 WHERE `entry`=97916; -- 奎克
UPDATE `creature_template` SET `name`='奥术多头蛇子嗣', `subname`='瑟芬崔斯克的子嗣', `VerifiedBuild`=26124 WHERE `entry`=97260; -- 奥术多头蛇子嗣
UPDATE `creature_template` SET `name`='烈焰多头蛇子嗣', `subname`='瑟芬崔斯克的子嗣', `VerifiedBuild`=26124 WHERE `entry`=97259; -- 烈焰多头蛇子嗣
UPDATE `creature_template` SET `name`='踏浪巨人', `VerifiedBuild`=26124 WHERE `entry`=95939; -- 踏浪巨人
UPDATE `creature_template` SET `name`='呼潮引浪', `VerifiedBuild`=26124 WHERE `entry`=97844; -- 呼潮引浪
UPDATE `creature_template` SET `name`='盐海小水珠', `VerifiedBuild`=26124 WHERE `entry`=98293; -- 盐海小水珠
UPDATE `creature_template` SET `name`='变形术：鱼', `VerifiedBuild`=26124 WHERE `entry`=100205; -- 变形术：鱼
UPDATE `creature_template` SET `name`='唤雷多头蛇', `VerifiedBuild`=26124 WHERE `entry`=91792; -- 唤雷多头蛇
UPDATE `creature_template` SET `name`='玛拉纳沙地行者', `VerifiedBuild`=26124 WHERE `entry`=91790; -- 玛拉纳沙地行者
UPDATE `creature_template` SET `name`='渗穴', `VerifiedBuild`=26124 WHERE `entry`=97263; -- 渗穴
UPDATE `creature_template` SET `name`='苦水清道夫', `VerifiedBuild`=26124 WHERE `entry`=99630; -- 苦水清道夫
UPDATE `creature_template` SET `name`='苦水清道夫', `VerifiedBuild`=26124 WHERE `entry`=99629; -- 苦水清道夫
UPDATE `creature_template` SET `name`='苦水清道夫', `VerifiedBuild`=26124 WHERE `entry`=95940; -- 苦水清道夫
UPDATE `creature_template` SET `name`='逐潮蟹', `VerifiedBuild`=26124 WHERE `entry`=91793; -- 逐潮蟹
UPDATE `creature_template` SET `name`='玛拉纳硬壳战士', `VerifiedBuild`=26124 WHERE `entry`=95947; -- 玛拉纳硬壳战士
UPDATE `creature_template` SET `name`='积怨踏浪者', `VerifiedBuild`=26124 WHERE `entry`=97269; -- 积怨踏浪者
UPDATE `creature_template` SET `name`='积怨碎壳者', `VerifiedBuild`=26124 WHERE `entry`=97264; -- 积怨碎壳者
UPDATE `creature_template` SET `name`='盐鳞潜伏者', `VerifiedBuild`=26124 WHERE `entry`=101414; -- 盐鳞潜伏者
UPDATE `creature_template` SET `name`='盐鳞潜藏者', `VerifiedBuild`=26124 WHERE `entry`=91794; -- 盐鳞潜藏者
UPDATE `creature_template` SET `name`='苦水奴隶', `VerifiedBuild`=26124 WHERE `entry`=106785; -- 苦水奴隶
UPDATE `creature_template` SET `name`='瑟芬崔斯克', `type`=1, `VerifiedBuild`=26124 WHERE `entry`=91808; -- 瑟芬崔斯克
UPDATE `creature_template` SET `name`='苦水奴隶', `VerifiedBuild`=26124 WHERE `entry`=106787; -- 苦水奴隶
UPDATE `creature_template` SET `name`='苦水奴隶', `VerifiedBuild`=26124 WHERE `entry`=106786; -- 苦水奴隶
UPDATE `creature_template` SET `name`='沙丘', `VerifiedBuild`=26124 WHERE `entry`=97853; -- 沙丘
UPDATE `creature_template` SET `name`='积怨缚潮者', `VerifiedBuild`=26124 WHERE `entry`=97170; -- 积怨缚潮者
UPDATE `creature_template` SET `name`='活体风暴', `VerifiedBuild`=26124 WHERE `entry`=95920; -- 活体风暴
UPDATE `creature_template` SET `name`='海巨人弄潮者', `VerifiedBuild`=26124 WHERE `entry`=91796; -- 海巨人弄潮者
UPDATE `creature_template` SET `name`='辉鳞鲈鱼', `VerifiedBuild`=26124 WHERE `entry`=100688; -- 辉鳞鲈鱼
UPDATE `creature_template` SET `name`='深须国王', `VerifiedBuild`=26124 WHERE `entry`=91797; -- 深须国王
UPDATE `creature_template` SET `name`='导魔者瓦里兹', `subname`='掌控者', `VerifiedBuild`=26124 WHERE `entry`=100249; -- 导魔者瓦里兹
UPDATE `creature_template` SET `name`='祭祀者勒莎', `subname`='狂怒之海', `VerifiedBuild`=26124 WHERE `entry`=100248; -- 祭祀者勒莎
UPDATE `creature_template` SET `name`='束缚者阿什奥伊', `subname`='严寒之风', `VerifiedBuild`=26124 WHERE `entry`=100250; -- 束缚者阿什奥伊
UPDATE `creature_template` SET `name`='积怨夫人', `VerifiedBuild`=26124 WHERE `entry`=91789; -- 积怨夫人
UPDATE `creature_template` SET `VerifiedBuild`=26124 WHERE `entry`=97063; -- Weatherman
UPDATE `creature_template` SET `VerifiedBuild`=26124 WHERE `entry`=97713; -- Lightning Stalker
UPDATE `creature_template` SET `name`='秘术师萨维', `subname`='暴风女', `VerifiedBuild`=26124 WHERE `entry`=98173; -- 秘术师萨维
UPDATE `creature_template` SET `name`='焦躁的海潮元素', `VerifiedBuild`=26124 WHERE `entry`=97173; -- 焦躁的海潮元素
UPDATE `creature_template` SET `name`='海湾沙鸥', `VerifiedBuild`=26124 WHERE `entry`=91787; -- 海湾沙鸥
UPDATE `creature_template` SET `name`='盐海小水滴', `VerifiedBuild`=26124 WHERE `entry`=97172; -- 盐海小水滴
UPDATE `creature_template` SET `name`='砂泥蜗牛', `VerifiedBuild`=26124 WHERE `entry`=91786; -- 砂泥蜗牛
UPDATE `creature_template` SET `name`='积怨奥术师', `VerifiedBuild`=26124 WHERE `entry`=97171; -- 积怨奥术师
UPDATE `creature_template` SET `name`='积怨碾压者', `VerifiedBuild`=26124 WHERE `entry`=91782; -- 积怨碾压者
UPDATE `creature_template` SET `name`='积怨神谕者', `VerifiedBuild`=26124 WHERE `entry`=95861; -- 积怨神谕者
UPDATE `creature_template` SET `name`='海湾沙鸥', `VerifiedBuild`=26124 WHERE `entry`=99901; -- 海湾沙鸥
UPDATE `creature_template` SET `name`='积怨织雷者', `VerifiedBuild`=26124 WHERE `entry`=91783; -- 积怨织雷者
UPDATE `creature_template` SET `name`='积怨牧鱼者', `VerifiedBuild`=26124 WHERE `entry`=100216; -- 积怨牧鱼者
UPDATE `creature_template` SET `name`='掠行软壳蟹', `VerifiedBuild`=26124 WHERE `entry`=99908; -- 掠行软壳蟹
UPDATE `creature_template` SET `name`='积怨战士', `VerifiedBuild`=26124 WHERE `entry`=91781; -- 积怨战士
*/

UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=96028 AND `Idx`=7); -- 艾萨拉之怒
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=96028 AND `Idx`=6); -- 艾萨拉之怒
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=96028 AND `Idx`=5); -- 艾萨拉之怒
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=96028 AND `Idx`=4); -- 艾萨拉之怒
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=96028 AND `Idx`=3); -- 艾萨拉之怒
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=96028 AND `Idx`=2); -- 艾萨拉之怒
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=96028 AND `Idx`=1); -- 艾萨拉之怒
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=96028 AND `Idx`=0); -- 艾萨拉之怒
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91792 AND `Idx`=1); -- 唤雷多头蛇
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91792 AND `Idx`=0); -- 唤雷多头蛇
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91793 AND `Idx`=2); -- 逐潮蟹
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91793 AND `Idx`=1); -- 逐潮蟹
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91793 AND `Idx`=0); -- 逐潮蟹
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91808 AND `Idx`=4); -- 瑟芬崔斯克
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91808 AND `Idx`=3); -- 瑟芬崔斯克
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91808 AND `Idx`=2); -- 瑟芬崔斯克
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91808 AND `Idx`=1); -- 瑟芬崔斯克
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91808 AND `Idx`=0); -- 瑟芬崔斯克
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91797 AND `Idx`=1); -- 深须国王
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91797 AND `Idx`=0); -- 深须国王
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=100249 AND `Idx`=0); -- 导魔者瓦里兹
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=100248 AND `Idx`=0); -- 祭祀者勒莎
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=100250 AND `Idx`=0); -- 束缚者阿什奥伊
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91789 AND `Idx`=2); -- 积怨夫人
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91789 AND `Idx`=1); -- 积怨夫人
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91789 AND `Idx`=0); -- 积怨夫人
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=98173 AND `Idx`=0); -- 秘术师萨维
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91787 AND `Idx`=0); -- 海湾沙鸥
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91784 AND `Idx`=1); -- 督军帕杰什
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91784 AND `Idx`=0); -- 督军帕杰什
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91785 AND `Idx`=1); -- 游荡的硬壳龟
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91785 AND `Idx`=0); -- 游荡的硬壳龟


UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=253992; -- 饰品箱
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248930; -- 一箱木塞
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=246983; -- 水门
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=246982; -- 水门
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=240788; -- 气泡
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=244690; -- 沙丘


UPDATE `gameobject_questitem` SET `VerifiedBuild`=26124 WHERE (`GameObjectEntry`=248930 AND `Idx`=0); -- 一箱木塞

