
-- QUEST 47221; -- The Hand of Fate
SET @CGUID = 443582;
SET @OGUID = 101344;
DELETE FROM `creature` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+41;
INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
-- 5286 - 7048 - 7053 
(@CGUID+0, 94114, 0, 1519, 4411, 1, '0', 0, 0, 0, -8563.403, 1445.61, 193.6425, 3.298663, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- Skyfire Gryphon Rider (Area: -Unknown- - Difficulty: 0)
(@CGUID+1, 94114, 0, 1519, 4411, 1, '0', 0, 0, 0, -8515.579, 1443.52, 193.5861, 3.364416, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- Skyfire Gryphon Rider (Area: -Unknown- - Difficulty: 0)
(@CGUID+2, 94114, 0, 1519, 4411, 1, '0', 0, 0, 0, -8522.645, 1448.828, 198.888, 3.577762, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- Skyfire Gryphon Rider (Area: -Unknown- - Difficulty: 0)
(@CGUID+3, 94114, 0, 1519, 4411, 1, '0', 0, 0, 0, -8530.676, 1359.707, 194.207, 3.182558, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- Skyfire Gryphon Rider (Area: -Unknown- - Difficulty: 0)
(@CGUID+4, 94114, 0, 1519, 4411, 1, '0', 0, 0, 0, -8520.898, 1355.883, 193.2858, 3.085416, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- Skyfire Gryphon Rider (Area: -Unknown- - Difficulty: 0)
(@CGUID+5, 94114, 0, 1519, 4411, 1, '0', 0, 0, 0, -8514.578, 1361.901, 196.1011, 3.279801, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- Skyfire Gryphon Rider (Area: -Unknown- - Difficulty: 0)
(@CGUID+6, 94114, 0, 1519, 4411, 1, '0', 0, 0, 0, -8530.925, 1443.104, 193.9465, 3.500759, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- Skyfire Gryphon Rider (Area: -Unknown- - Difficulty: 0)
(@CGUID+7, 94114, 0, 1519, 4411, 1, '0', 0, 0, 0, -8571.045, 1441.256, 197.5809, 3.443937, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- Skyfire Gryphon Rider (Area: -Unknown- - Difficulty: 0)
(@CGUID+8, 37944, 0, 1519, 4411, 1, '0', 0, 0, 0, -8479.968, 1169.617, 17.70825, 6.261863, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 暴风城巡逻兵 (Area: -Unknown- - Difficulty: 0) (Auras: )
(@CGUID+9, 94114, 0, 1519, 4411, 1, '0', 0, 0, 0, -8566.313, 1368.533, 203.0515, 3.066923, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- Skyfire Gryphon Rider (Area: -Unknown- - Difficulty: 0)
(@CGUID+10, 121754, 0, 1519, 4411, 1, '0', 0, 0, 0, -8348.567, 1351.684, 10.99565, 5.646329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 温蕾萨·风行者 (Area: -Unknown- - Difficulty: 0)
(@CGUID+11, 15214, 0, 1519, 4411, 1, '0', 0, 0, 0, -8381.132, 1315.49, 5.436247, 0.5585054, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 隐形的潜伏者 (Area: -Unknown- - Difficulty: 0)
(@CGUID+12, 29712, 0, 1519, 4411, 1, '0', 0, 0, 0, -8343.224, 1258.238, 5.260246, 0.9250245, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 暴风城港口卫兵 (Area: -Unknown- - Difficulty: 0) (Auras: )
(@CGUID+13, 121775, 0, 1519, 4411, 1, '0', 0, 0, 0, -8350.092, 1315.651, 17.86877, 1.559329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团火枪手 (Area: -Unknown- - Difficulty: 0)
(@CGUID+14, 121775, 0, 1519, 4411, 1, '0', 0, 0, 0, -8346.597, 1315.636, 17.79752, 1.559329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团火枪手 (Area: -Unknown- - Difficulty: 0)
(@CGUID+15, 29296, 0, 1519, 4411, 1, '0', 0, 0, 0, -8402.29, 1322.5, 6.636372, 0.59376, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 加斯汀·伯恩姆 (Area: -Unknown- - Difficulty: 0)
(@CGUID+16, 44880, 0, 1519, 4411, 1, '0', 0, 0, 0, -8397.528, 1345.771, 25.25383, 1.553343, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 海鸥 (Area: -Unknown- - Difficulty: 0)
(@CGUID+17, 44880, 0, 1519, 4411, 1, '0', 0, 0, 0, -8394.302, 1345.941, 23.0297, 5.218534, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 海鸥 (Area: -Unknown- - Difficulty: 0)
(@CGUID+18, 121753, 0, 1519, 4411, 1, '0', 0, 0, 0, -8348.375, 1314.439, 17.88349, 1.533344, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 杰塔瑞斯将军 (Area: -Unknown- - Difficulty: 0)
(@CGUID+19, 29712, 0, 1519, 4411, 1, '0', 0, 0, 0, -8341.011, 1264.045, 5.244536, 1.134464, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 暴风城港口卫兵 (Area: -Unknown- - Difficulty: 0) (Auras: )
(@CGUID+20, 29712, 0, 1519, 4411, 1, '0', 0, 0, 0, -8329.771, 1258.438, 5.245782, 1.919862, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 暴风城港口卫兵 (Area: -Unknown- - Difficulty: 0) (Auras: )
(@CGUID+21, 29152, 0, 1519, 4411, 1, '0', 0, 0, 0, -8314.711, 1216.049, 5.309687, 1.376954, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 暴风城码头工人 (Area: -Unknown- - Difficulty: 0)
(@CGUID+22, 121757, 0, 1519, 4411, 1, '0', 0, 0, 0, -8353.525, 1362.88, 11.12727, 4.74664, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团水兵 (Area: -Unknown- - Difficulty: 0)
(@CGUID+23, 121757, 0, 1519, 4411, 1, '0', 0, 0, 0, -8351.938, 1361.206, 11.12727, 4.74664, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团水兵 (Area: -Unknown- - Difficulty: 0)
(@CGUID+24, 121775, 0, 1519, 4411, 1, '0', 0, 0, 0, -8356.475, 1354.313, 10.8019, 3.136578, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团火枪手 (Area: -Unknown- - Difficulty: 0)
(@CGUID+25, 121775, 0, 1519, 4411, 1, '0', 0, 0, 0, -8356.221, 1348.636, 10.75704, 3.136578, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团火枪手 (Area: -Unknown- - Difficulty: 0)
(@CGUID+26, 121755, 0, 1519, 4411, 1, '0', 0, 0, 0, -8346.151, 1349.86, 10.9797, 2.592566, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 救赎者阿拉托尔 (Area: -Unknown- - Difficulty: 0)
(@CGUID+27, 121756, 0, 1519, 4411, 1, '0', 0, 0, 0, -8345.117, 1352.799, 11.01411, 3.756538, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 守备官波鲁斯 (Area: -Unknown- - Difficulty: 0)
(@CGUID+28, 121757, 0, 1519, 4411, 1, '0', 0, 0, 0, -8354.807, 1330.673, 15.35965, 1.565626, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团水兵 (Area: -Unknown- - Difficulty: 0)
(@CGUID+29, 44880, 0, 1519, 4411, 1, '0', 0, 0, 0, -8452.009, 1346.894, 17.1479, 2.583087, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 海鸥 (Area: -Unknown- - Difficulty: 0)
(@CGUID+30, 121775, 0, 1519, 4411, 1, '0', 0, 0, 0, -8340.271, 1333.668, 10.6929, 1.559329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团火枪手 (Area: -Unknown- - Difficulty: 0)
(@CGUID+31, 37944, 0, 1519, 4411, 1, '0', 0, 0, 0, -8294.82, 1270.243, 5.402481, 1.559641, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 暴风城巡逻兵 (Area: -Unknown- - Difficulty: 0) (Auras: )
(@CGUID+32, 29152, 0, 1519, 4411, 1, '0', 0, 0, 0, -8285.523, 1285.871, 5.360087, 1.604228, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 暴风城码头工人 (Area: -Unknown- - Difficulty: 0)
(@CGUID+33, 121757, 0, 1519, 4411, 1, '0', 0, 0, 0, -8340.804, 1329.618, 15.42074, 3.154025, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团水兵 (Area: -Unknown- - Difficulty: 0)
(@CGUID+34, 121775, 0, 1519, 4411, 1, '0', 0, 0, 0, -8356.278, 1342.614, 10.7339, 3.136578, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团火枪手 (Area: -Unknown- - Difficulty: 0)
(@CGUID+35, 121757, 0, 1519, 4411, 1, '0', 0, 0, 0, -8338.399, 1363.529, 11.04516, 1.526458, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团水兵 (Area: -Unknown- - Difficulty: 0)
(@CGUID+36, 121758, 0, 1519, 4411, 1, '0', 0, 0, 0, -8343.098, 1368.495, 11.27482, 0.2767069, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团炮手 (Area: -Unknown- - Difficulty: 0)
(@CGUID+37, 15214, 0, 1519, 4411, 1, '0', 0, 0, 0, -8304.429, 1220.38, 5.695755, 1.692969, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 隐形的潜伏者 (Area: -Unknown- - Difficulty: 0)
(@CGUID+38, 44880, 0, 1519, 4411, 1, '0', 0, 0, 0, -8314.174, 1393.059, 17.15461, 5.846853, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 海鸥 (Area: -Unknown- - Difficulty: 0)
(@CGUID+39, 121757, 0, 1519, 4411, 1, '0', 0, 0, 0, -8350.398, 1362.686, 11.20019, 4.74664, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 第七军团水兵 (Area: -Unknown- - Difficulty: 0)
(@CGUID+40, 29152, 0, 1519, 4411, 1, '0', 0, 0, 0, -8299.763, 1308.623, 5.402482, 1.919862, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 暴风城码头工人 (Area: -Unknown- - Difficulty: 0)
(@CGUID+41, 121758, 0, 1519, 4411, 1, '0', 0, 0, 0, -8346.852, 1374.207, 11.51923, 2.510268, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365); -- 第七军团炮手 (Area: -Unknown- - Difficulty: 0)

DELETE FROM `creature_addon` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+41;
INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+0, 0, 47166, 50331648, 1, 0, 0, 0, 0, ''), -- Skyfire Gryphon Rider
(@CGUID+1, 0, 47166, 50331648, 1, 0, 0, 0, 0, ''), -- Skyfire Gryphon Rider
(@CGUID+2, 0, 47166, 50331648, 1, 0, 0, 0, 0, ''), -- Skyfire Gryphon Rider
(@CGUID+3, 0, 47166, 50331648, 1, 0, 0, 0, 0, ''), -- Skyfire Gryphon Rider
(@CGUID+4, 0, 47166, 50331648, 1, 0, 0, 0, 0, ''), -- Skyfire Gryphon Rider
(@CGUID+5, 0, 47166, 50331648, 1, 0, 0, 0, 0, ''), -- Skyfire Gryphon Rider
(@CGUID+6, 0, 47166, 50331648, 1, 0, 0, 0, 0, ''), -- Skyfire Gryphon Rider
(@CGUID+7, 0, 47166, 50331648, 1, 0, 0, 0, 0, ''), -- Skyfire Gryphon Rider
(@CGUID+8, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 暴风城巡逻兵
(@CGUID+9, 0, 47166, 50331648, 1, 0, 0, 0, 0, ''), -- Skyfire Gryphon Rider
(@CGUID+10, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 温蕾萨·风行者
(@CGUID+11, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 隐形的潜伏者
(@CGUID+12, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 暴风城港口卫兵
(@CGUID+13, 0, 0, 0, 2, 0, 0, 0, 0, ''), -- 第七军团火枪手
(@CGUID+14, 0, 0, 0, 2, 0, 0, 0, 0, ''), -- 第七军团火枪手
(@CGUID+15, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 加斯汀·伯恩姆
(@CGUID+16, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海鸥
(@CGUID+17, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海鸥
(@CGUID+18, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 杰塔瑞斯将军
(@CGUID+19, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 暴风城港口卫兵
(@CGUID+20, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 暴风城港口卫兵
(@CGUID+21, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 暴风城码头工人
(@CGUID+22, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 第七军团水兵
(@CGUID+23, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 第七军团水兵
(@CGUID+24, 0, 0, 0, 2, 0, 0, 0, 0, ''), -- 第七军团火枪手
(@CGUID+25, 0, 0, 0, 2, 0, 0, 0, 0, ''), -- 第七军团火枪手
(@CGUID+26, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 救赎者阿拉托尔
(@CGUID+27, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 守备官波鲁斯
(@CGUID+28, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 第七军团水兵
(@CGUID+29, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海鸥
(@CGUID+30, 0, 0, 0, 2, 0, 0, 0, 0, ''), -- 第七军团火枪手
(@CGUID+31, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 暴风城巡逻兵
(@CGUID+32, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 暴风城码头工人
(@CGUID+33, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 第七军团水兵
(@CGUID+34, 0, 0, 0, 2, 0, 0, 0, 0, ''), -- 第七军团火枪手
(@CGUID+35, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 第七军团水兵
(@CGUID+36, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 第七军团炮手
(@CGUID+37, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 隐形的潜伏者
(@CGUID+38, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 海鸥
(@CGUID+39, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 第七军团水兵
(@CGUID+40, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 暴风城码头工人
(@CGUID+41, 0, 0, 0, 1, 0, 0, 0, 0, ''); -- 第七军团炮手

DELETE FROM `gameobject` WHERE `guid` BETWEEN @OGUID+0 AND @OGUID+7;
INSERT INTO `gameobject` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `position_x`, `position_y`, `position_z`, `orientation`, `rotation0`, `rotation1`, `rotation2`, `rotation3`, `spawntimesecs`, `animprogress`, `state`, `VerifiedBuild`) VALUES
(@OGUID+0, 269884, 0, 1519, 4411, 1, '0', 0, -8342.277, 1332.058, 12.81255, 6.194768, -0.7064157, 0.03125, -0.03125, 0.7064162, 120, 255, 1, 26365), -- 木板 (Area: -Unknown- - Difficulty: 0)
(@OGUID+1, 269884, 0, 1519, 4411, 1, '0', 0, -8342.277, 1332.058, 13.5915, 6.194768, -0.7064157, 0.03125, -0.03125, 0.7064162, 120, 255, 1, 26365), -- 木板 (Area: -Unknown- - Difficulty: 0)
(@OGUID+2, 269884, 0, 1519, 4411, 1, '0', 0, -8342.277, 1332.058, 11.35107, 6.194768, -0.7064157, 0.03125, -0.03125, 0.7064162, 120, 255, 1, 26365), -- 木板 (Area: -Unknown- - Difficulty: 0)
(@OGUID+3, 269884, 0, 1519, 4411, 1, '0', 0, -8342.277, 1332.058, 12.13003, 6.194768, -0.7064157, 0.03125, -0.03125, 0.7064162, 120, 255, 1, 26365), -- 木板 (Area: -Unknown- - Difficulty: 0)
(@OGUID+4, 269884, 0, 1519, 4411, 1, '0', 0, -8342.277, 1332.058, 14.3597, 6.194768, -0.7064157, 0.03125, -0.03125, 0.7064162, 120, 255, 1, 26365), -- 木板 (Area: -Unknown- - Difficulty: 0)
(@OGUID+5, 269885, 0, 1519, 4411, 1, '0', 0, -8342.224, 1332.396, 11.02951, 4.610927, 0, 0, -0.742054, 0.6703401, 120, 255, 1, 26365), -- 大门 (Area: -Unknown- - Difficulty: 0)
(@OGUID+6, 269834, 0, 1519, 5154, 1, '0', 0, -8347.031, 1350.668, 5.649844, 4.674937, 0, 0, -0.7202234, 0.6937422, 120, 255, 1, 26365), -- 联盟舰船 (Area: -Unknown- - Difficulty: 0)
(@OGUID+7, 269835, 0, 1519, 8411, 1, '0', 0, -8363.25, 1336.259, 6.704211, 1.560596, 0, 0, 0.7034912, 0.710704, 120, 255, 1, 26365); -- 斜坡 (Area: -Unknown- - Difficulty: 0)
-- (@OGUID+495, 244823, 0, 1519, 4411, 1, '0', 0, -8521.153, 1400.703, 173.0903, 0.03239773, 0, 0, 0.01619816, 0.9998688, 120, 255, 1, 26365), -- The Skyfire (Area: -Unknown- - Difficulty: 0)


DELETE FROM `creature_queststarter` WHERE `id` = '121754';
INSERT INTO `creature_queststarter` (`id`, `quest`) VALUES
('121754', '47222'); -- two-if-by-sea


DELETE FROM `creature_questender` WHERE `id` = '121754';
INSERT INTO `creature_questender` (`id`, `quest`) VALUES
('121754', '47221'); -- The Hand of Fate

UPDATE `creature_template` SET `gossip_menu_id`=21072, `ScriptName`='npc_vereesa_windrunner_121754' WHERE `entry` = 121754;

SET NAMES 'utf8';
SET @GROUP_ID=0;
SET @ID =0;
DELETE FROM `creature_text` WHERE (`CreatureID`=121754) OR (`CreatureID`=121755) OR (`CreatureID`=121756) ;
INSERT INTO `creature_text` (`CreatureID`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextId`, `comment`) VALUES
(121754, @GROUP_ID+0, @ID+0, '现在就看部落会不会响应维伦的号召了。那些野蛮人缺乏荣誉感，但是很擅长战斗。', 12, 0, 100, 0, 0, 87088, 130826, '温蕾萨·风行者'),
(121755, @GROUP_ID+0, @ID+0, '我们必须找到圣光军团。在他们的协助下，军团必将覆灭。我们必须找到……', 12, 0, 100, 0, 0, 86878, 130856, '救赎者阿拉托尔'),
(121756, @GROUP_ID+0, @ID+0, '你的父母还活着，阿拉托尔，我肯定。但现在，专心迎接之后的战斗吧。', 12, 0, 100, 0, 0, 87998, 132489, '守备官波鲁斯');


DELETE FROM `creature_text_locale` WHERE ((`CreatureID`=121754) OR (`CreatureID`=121755) OR (`CreatureID`=121756) ) AND (`locale`='zhCN') ;
INSERT INTO `creature_text_locale` (`CreatureID`, `GroupID`, `ID`, `locale`, `Text`) VALUES
(121754, @GROUP_ID+0, @ID+0, 'zhCN', '现在就看部落会不会响应维伦的号召了。那些野蛮人缺乏荣誉感，但是很擅长战斗。'),
(121755, @GROUP_ID+0, @ID+0, 'zhCN', '我们必须找到圣光军团。在他们的协助下，军团必将覆灭。我们必须找到……'),
(121756, @GROUP_ID+0, @ID+0, 'zhCN', '你的父母还活着，阿拉托尔，我肯定。但现在，专心迎接之后的战斗吧。');

UPDATE `gossip_menu_option` SET `OptionType`=1, `OptionNpcFlag`=1  WHERE `MenuId`=21072 AND `OptionIndex`=0;
/* 134034 21072	31906	130807*/
DELETE FROM `conditions` WHERE (`SourceTypeOrReferenceId`=14 AND `SourceGroup`=21072 AND `SourceEntry`=31906);
INSERT INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES 
(14, 21072, 31906, 0, 0, 9, 0, 47222, 0, 0, 0, 0, "", "Gossip Text - Show Text if Quest 47222 is taken");
