# TrinityCore - WowPacketParser
# File name: 7.3.5_26365_五月-11-1534 - binghuo47132.awps.pkt
# Detected build: V7_3_5_26365
# Detected locale: zhCN
# Targeted database: Legion
# Parsing date: 05/11/2018 23:50:19

SET @QUESTID = 47132;
SET @QUESTCONVERSATION1 = 4979;
SET @QUESTCONVERSATION2 = 4980;
DELETE FROM  `quest_conversation` WHERE `questId`=@QUESTID;
INSERT INTO `quest_conversation` (`questId`, `questAcceptConversation`, `questCompleteConversation`) VALUES (@QUESTID, @QUESTCONVERSATION1, @QUESTCONVERSATION2);


SET NAMES 'latin1';

UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=47132 AND `BlobIndex`=0 AND `Idx1`=6); -- Fel Fire and Ice
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=47132 AND `BlobIndex`=0 AND `Idx1`=5); -- Fel Fire and Ice
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=47132 AND `BlobIndex`=0 AND `Idx1`=4); -- Fel Fire and Ice
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=47132 AND `BlobIndex`=0 AND `Idx1`=3); -- Fel Fire and Ice
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=47132 AND `BlobIndex`=0 AND `Idx1`=2); -- Fel Fire and Ice
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=47132 AND `BlobIndex`=1 AND `Idx1`=1); -- Fel Fire and Ice
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=47132 AND `BlobIndex`=0 AND `Idx1`=0); -- Fel Fire and Ice

SET @CGUID = 453767; -- 138
SET @OGUID = 100766; -- 5
DELETE FROM `creature` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+137;
INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
-- (@CGUID+0, 115056, 1220, 0, 0, 1, '0', 0, 0, 0, -1936.194, 2954.985, 16.21499, 5.187116, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+1, 115056, 1220, 0, 0, 1, '0', 0, 0, 0, -1806.835, 3058.54, 19.35583, 4.170858, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+2, 117793, 1220, 0, 0, 1, '0', 0, 0, 0, -1758.825, 3030.175, 20.65312, 4.531646, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1)
(@CGUID+3, 120513, 1220, 0, 0, 1, '0', 0, 0, 0, -1756.189, 2897.035, 1.778955, 1.062887, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+4, 117793, 1220, 0, 0, 1, '0', 0, 0, 0, -1748.86, 3025.241, 20.65312, 5.992402, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1)
(@CGUID+5, 121344, 1220, 0, 0, 1, '0', 0, 0, 0, -1749.37, 2883.046, 2.658434, 3.861417, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+6, 120933, 1220, 0, 0, 1, '0', 0, 0, 0, -1768.535, 2871.484, 1.630824, 3.417046, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+7, 117754, 1220, 0, 0, 1, '0', 0, 0, 0, -1751.679, 3033.041, 6.10757, 2.458613, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+8, 120513, 1220, 0, 0, 1, '0', 0, 0, 0, -1747.49, 2929.04, 1.859822, 1.030218, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+9, 121344, 1220, 0, 0, 1, '0', 0, 0, 0, -1743.736, 2915.368, 2.681803, 0.2089082, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+10, 120933, 1220, 0, 0, 1, '0', 0, 0, 0, -1728.995, 2907.032, 1.433315, 2.652375, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+11, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1696.106, 2885.681, 3.629166, 2.963923, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+12, 117754, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1709.476, 2887.618, 2.088241, 0.4397367, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1)
(@CGUID+13, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1764.751, 2846.126, 0.2435744, 0.08765304, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+14, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1691.201, 2926.211, 3.568019, 4.493042, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+15, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1717.844, 2889.649, 1.966673, 3.448217, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+16, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1694.354, 2876.276, 2.666885, 1.410867, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+17, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1688.808, 2909.514, 2.954378, 3.200234, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+18, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1740.816, 2852.387, 1.745436, 1.610939, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+19, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1725.537, 2871.979, 1.580512, 3.222244, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+20, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1722.972, 2849.563, 2.348531, 0.4241707, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+21, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1688.512, 2932.754, 4.475448, 1.618196, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+22, 115054, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1717.148, 2980.11, 12.50653, 4.917067, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+23, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1745.832, 2849.84, 1.647039, 0.8646693, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+24, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1776.338, 2848.819, 1.06344, 1.555823, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+25, 117754, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1707.806, 2849.363, 2.233609, 3.2129, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+26, 117793, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1674.208, 2884.501, 18.15472, 2.508343, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+27, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1678.616, 2921.574, 5.769366, 4.346081, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+28, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1713.69, 2844.028, 3.486877, 2.244468, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+29, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1747.588, 2827.872, 3.125058, 3.07023, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+30, 117793, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1678.99, 2890.754, 18.15472, 2.837167, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+31, 117754, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1670.661, 2918.328, 6.671458, 0.02440921, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+32, 117793, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1679.051, 2893.24, 18.15472, 1.299338, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+33, 117793, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1736.081, 2810.784, 16.79041, 0.7420264, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+34, 117793, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1737.756, 2810.593, 16.79041, 3.968914, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+35, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1661.554, 2895.125, 6.081088, 2.273914, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+36, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1776.039, 2811.007, 2.462564, 3.105231, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+37, 117793, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1731.835, 2811.242, 16.79041, 5.958202, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+38, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1647.521, 2912.589, 9.987698, 5.957368, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+39, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1674.422, 2819.861, 2.96023, 3.161, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+40, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1649.463, 2880.698, 7.405307, 2.625477, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+41, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1738.938, 2803.444, 2.971191, 4.899151, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+42, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1634.409, 2900.605, 12.32099, 5.751313, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+43, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1675.99, 2816.391, 2.83523, 3.523864, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+44, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1673.389, 2818.05, 3.08523, 2.575499, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+45, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1695.773, 2860.632, 2.035811, 2.633694, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+46, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1675.503, 2816.493, 2.921913, 1.840404, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+47, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1754.497, 2822.398, 2.116784, 0.5132955, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+48, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1682.979, 2813.741, 3.143849, 1.946137, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+49, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1688.464, 2872.509, 2.640754, 1.686885, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+50, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1692.715, 2840.139, 2.213504, 0.2226086, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+51, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1673.024, 2818.811, 2.96023, 2.806848, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+52, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1759.581, 2813.911, 2.122606, 4.735815, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+53, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1688.253, 2818.72, 2.342554, 3.15147, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+54, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1675.385, 2874.718, 3.942453, 1.379847, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+55, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1683.834, 2808.5, 5.333193, 5.030126, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+56, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1726.179, 2802.821, 1.716541, 0.8026464, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+57, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1715.207, 2816.249, 1.828426, 1.22417, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+58, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1674.199, 2817.148, 3.08523, 4.072685, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+59, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1659.726, 2850.23, 4.412802, 1.849552, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+60, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1649.14, 2919.058, 10.60458, 2.569172, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+61, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1678.035, 2816.71, 2.715723, 2.978417, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+62, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1624.278, 2891.547, 14.13561, 4.624602, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+63, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1623.864, 2858.615, 12.11877, 0.8206289, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+64, 117754, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1676.387, 2801.242, 3.434243, 3.967551, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+65, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1656.752, 2807.309, 6.362847, 3.234889, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+66, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1620.408, 2880.322, 13.84074, 5.37806, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+67, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1640.016, 2814.298, 11.45743, 2.863262, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+68, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1674.563, 2805.879, 3.384093, 0.9475721, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+69, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1660.573, 2820.233, 3.293936, 4.855605, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+70, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1648.482, 2805.033, 10.84486, 3.062347, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+71, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1629.231, 2871.3, 12.19362, 1.424374, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+72, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1588.13, 2859.058, 27.33091, 2.75056, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+73, 120342, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1607.173, 2956.352, 144.6735, 5.158163, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 恐惧魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+74, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1651.865, 2790.642, 11.14576, 5.942596, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+75, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1646.452, 2792.508, 11.34059, 2.345631, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+76, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1643.873, 2798.948, 11.7217, 4.284889, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+77, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1643.89, 2787.351, 12.615, 2.713448, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1)
(@CGUID+78, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1691.024, 2794.439, 4.093436, 0.2483953, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+79, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1736.642, 2840.684, 2.067673, 3.332126, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+80, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1765.84, 2942.159, 1.114343, 5.21797, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+81, 117754, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1706.956, 2997.702, 15.85185, 4.473805, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1)
(@CGUID+82, 117754, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1736.937, 2796.764, 1.707618, 4.281114, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+83, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1723.976, 2872.199, 1.61821, 0.7687322, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+84, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1762.939, 2873.943, 1.826788, 6.082633, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+85, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1716.734, 2812.118, 1.784463, 4.176204, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+86, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1761.915, 2850.134, 0.2373472, 4.644454, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+87, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1782.183, 2919.92, 1.726006, 0.4060405, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: )
-- (@CGUID+88, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1721.429, 2782, 1.334102, 4.576232, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+89, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1643.205, 2797.412, 11.81202, 2.916668, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+90, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1748.13, 2789.801, 1.473441, 3.871857, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+91, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1725.196, 2757.228, 1.181517, 5.014372, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+92, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1644.565, 2798.866, 11.36715, 2.668061, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+93, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1711.209, 2760.031, 3.392972, 0.6428854, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+94, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1760.873, 2906.31, 1.751966, 0.8537752, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+95, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1734.009, 2892.604, 1.455153, 6.146011, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+96, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1659.87, 2817.529, 3.528597, 5.032413, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+97, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1689.135, 2845.536, 1.905105, 5.567358, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+98, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1681.182, 2873.344, 3.356116, 1.591788, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+99, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1724.75, 2906.4, 1.455312, 3.171329, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+100, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1658.256, 2892.219, 6.649798, 5.699344, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+101, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1645.129, 2768.858, 17.42594, 0.07819745, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+102, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1642.378, 2797.752, 11.89028, 2.917009, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: 211762 - -Unknown-) (possible waypoints or random movement)
(@CGUID+103, 121344, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1666.96, 2729.11, 10.0683, 5.937667, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+104, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1645.191, 2788.286, 12.20631, 2.747473, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1)
(@CGUID+105, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1698.314, 2792.927, 2.298987, 1.849649, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+106, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1636.131, 2796.989, 12.61744, 2.917451, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+107, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1630.39, 2794.925, 12.28722, 2.839026, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+108, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1688.512, 2932.754, 4.475448, 1.618196, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+109, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1620.462, 2792.709, 11.31542, 2.848051, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+110, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1597.343, 2776.028, 8.913961, 2.475259, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+111, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1602.113, 2782.39, 9.572301, 2.269844, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+112, 117793, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1561.689, 2851.962, 52.59002, 3.713542, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1)
(@CGUID+113, 117793, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1557.445, 2859.989, 52.59002, 3.715509, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1)
(@CGUID+114, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1649.553, 2755.575, 15.34454, 1.619633, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+115, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1689.135, 2845.536, 1.905105, 1.273134, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+116, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1645.009, 2914.396, 10.97725, 6.116382, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+117, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1690.622, 2819.948, 2.00703, 0.0771236, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+118, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1599.492, 2778.747, 9.19165, 2.269693, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+119, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1601.534, 2780.338, 9.413047, 2.269419, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+120, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1602.807, 2782.626, 9.62946, 2.269652, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+121, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1604.14, 2783.998, 9.712303, 2.494086, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+122, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1748.13, 2789.801, 1.473441, 3.871857, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+123, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1762.939, 2873.943, 1.826788, 5.985507, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+124, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1736.642, 2840.684, 2.067673, 0.9685394, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+125, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1724.111, 2781.441, 1.331684, 5.95386, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+126, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1596.774, 2776.624, 8.916158, 2.363113, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+127, 120934, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1594.871, 2774.17, 8.67723, 2.45962, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
-- (@CGUID+128, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1787.81, 2920.855, 1.606255, 4.895968, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+129, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1788.986, 2928.861, 0.2373551, 1.520227, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+130, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1791.666, 2923.17, 0.2260064, 2.815882, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+131, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1802.012, 2926.105, 0.2370529, 4.689786, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+132, 117754, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1793.015, 2948.774, 0.2413282, 3.890771, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+133, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1808.801, 2929.633, 0.2370529, 5.49767, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+134, 120513, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1803.536, 2950.623, 0.2361111, 0.1353908, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+135, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1788.309, 2955.773, 0.2361145, 2.032878, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1)
(@CGUID+136, 120933, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1692.634, 2907.553, 2.707724, 0.4330066, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+137, 120932, 1220, 7543, 8547, 1, '0', 0, 0, 0, -1794.785, 2905.895, 0.2331214, 3.878278, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365); -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: )
DELETE FROM `creature_addon` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+137;
INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
-- (@CGUID+0, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
-- (@CGUID+1, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+2, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+3, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+4, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+5, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+6, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+7, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
-- (@CGUID+8, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+9, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+10, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+11, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+12, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+13, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+14, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+15, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+16, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+17, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+18, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+19, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+20, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+21, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+22, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+23, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+24, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+25, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+26, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+27, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+28, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+29, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+30, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+31, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+32, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+33, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+34, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+35, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+36, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+37, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+38, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+39, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+40, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+41, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+42, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+43, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+44, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+45, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+46, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+47, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+48, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+49, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+50, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+51, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+52, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+53, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+54, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+55, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+56, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+57, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+58, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+59, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+60, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+61, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+62, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+63, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+64, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+65, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+66, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+67, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+68, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+69, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+70, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+71, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+72, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+73, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 恐惧魔蝠
(@CGUID+74, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+75, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+76, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+77, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+78, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+79, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+80, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+81, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+82, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+83, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+84, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+85, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+86, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+87, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
-- (@CGUID+88, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+89, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+90, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+91, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+92, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+93, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+94, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+95, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+96, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+97, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+98, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+99, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+100, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+101, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+102, 0, 0, 0, 1, 0, 0, 0, 0, '211762'), -- 邪火小鬼 - 211762 - -Unknown-
(@CGUID+103, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+104, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+105, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+106, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+107, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+108, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+109, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+110, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+111, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+112, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+113, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+114, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
-- (@CGUID+115, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+116, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+117, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+118, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+119, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+120, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+121, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+122, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+123, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+124, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+125, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+126, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+127, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪火小鬼
(@CGUID+128, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+129, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
-- (@CGUID+130, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+131, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+132, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
-- (@CGUID+133, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
-- (@CGUID+134, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
-- (@CGUID+135, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+136, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+137, 0, 0, 0, 1, 0, 0, 0, 0, ''); -- 燃烧哨兵

DELETE FROM `gameobject` WHERE `guid` BETWEEN @OGUID+0 AND @OGUID+4;
INSERT INTO `gameobject` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `position_x`, `position_y`, `position_z`, `orientation`, `rotation0`, `rotation1`, `rotation2`, `rotation3`, `spawntimesecs`, `animprogress`, `state`, `VerifiedBuild`) VALUES
(@OGUID+0, 241537, 1220, 7543, 8547, 1, '0', 0, -1603.828, 2880.208, 21.03529, 1.994451, 0, 0, 0.8399687, 0.5426349, 7200, 255, 1, 26365), -- Chaos Clover (Area: -Unknown- - Difficulty: 1)
(@OGUID+1, 244774, 1220, 7543, 8547, 1, '0', 0, -1637.038, 2838.854, 16.48882, 0, 0, 0, 0, 1, 7200, 255, 1, 26365), -- Aethril (Area: -Unknown- - Difficulty: 1)
(@OGUID+2, 268435, 1220, 7543, 8547, 1, '0', 0, -1682.156, 2758.584, 17.22924, 2.419727, 0, 0, 0.9355679, 0.3531469, 7200, 255, 1, 26365), -- Ancient Shrine (Area: -Unknown- - Difficulty: 1)
(@OGUID+3, 246493, 1220, 7543, 8547, 1, '0', 0, -1743.03, 2746.78, 0, 0, 0, 0, 0, 1, 7200, 255, 1, 26365), -- Black Barracuda School (Area: -Unknown- - Difficulty: 1)
(@OGUID+4, 241535, 1220, 7543, 8547, 1, '0', 0, -1663.896, 2740.56, 10.23965, 3.719137, 0, 0, -0.9585943, 0.2847753, 7200, 255, 1, 26365); -- Bleakthorn (Area: -Unknown- - Difficulty: 1)

DELETE FROM `gameobject_addon` WHERE `guid` BETWEEN @OGUID+0 AND @OGUID+4;


UPDATE `creature_template_addon` SET `bytes1`=50331648 WHERE `entry`=120342; -- 120342 (恐惧魔蝠)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=120934; -- 120934 (邪火小鬼)

UPDATE `creature_template` SET `faction`=35 WHERE `entry`=121344; 

UPDATE `creature_template` SET `unit_flags`=67141632 WHERE `entry`=120933; -- 活性邪焰元素
UPDATE `creature_template` SET `unit_flags`=32768 WHERE `entry`=115056; -- 邪翼吞噬者


UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=3, `type_flags`=524288, `HealthModifier`=3, `InhabitType`=4, `VerifiedBuild`=26365 WHERE `entry`=120342; -- 恐惧魔蝠

UPDATE `creature_template` SET `lootid` = 120933 WHERE `entry` = 120933 AND `lootid` = 0;
DELETE FROM `creature_loot_template` WHERE `entry` = '120933';
INSERT INTO `creature_loot_template` (`entry`, `Item`, `Reference`, `Chance`, `QuestRequired`, `LootMode`, `GroupId`, `MinCount`, `MaxCount`, `Comment`) VALUES
('120933', '121331', '0', '0.07028575', '0', '1', '0', '1', '1', ''),
('120933', '123919', '0', '0.0135718', '0', '1', '0', '1', '1', ''),
('120933', '132217', '0', '3.871738', '0', '1', '0', '1', '1', ''),
('120933', '132233', '0', '96', '0', '1', '0', '1', '1', ''),
('120933', '138781', '0', '0.3457664', '0', '1', '0', '1', '1', ''),
('120933', '138782', '0', '0.09014912', '0', '1', '0', '1', '1', ''),
('120933', '140220', '0', '0.02184071', '0', '1', '0', '1', '1', ''),
('120933', '140221', '0', '0.07343154', '0', '1', '0', '1', '1', ''),
('120933', '140222', '0', '0.1122595', '0', '1', '0', '1', '1', ''),
('120933', '140224', '0', '0.01608843', '0', '1', '0', '1', '1', ''),
('120933', '140225', '0', '0.04278263', '0', '1', '0', '1', '1', ''),
('120933', '140226', '0', '0.02939059', '0', '1', '0', '1', '1', ''),
('120933', '140227', '0', '0.35799', '0', '1', '0', '1', '1', ''),
('120933', '141054', '0', '0.02049252', '0', '1', '0', '1', '1', ''),
('120933', '141564', '0', '0.007280238', '0', '1', '0', '1', '1', ''),
('120933', '141583', '0', '0.01456048', '0', '1', '0', '1', '1', ''),
('120933', '144330', '0', '0.120079', '0', '1', '0', '1', '1', ''),
('120933', '144345', '0', '0.1732876', '0', '1', '0', '1', '1', ''),
('120933', '146903', '0', '0.05896094', '0', '1', '0', '1', '1', ''),
('120933', '146905', '0', '0.1100125', '0', '1', '0', '1', '1', ''),
('120933', '146906', '0', '0.1132481', '0', '1', '0', '1', '1', ''),
('120933', '146907', '0', '0.06318527', '0', '1', '0', '1', '1', ''),
('120933', '146908', '0', '0.108844', '0', '1', '0', '1', '1', ''),
('120933', '146909', '0', '0.06848817', '0', '1', '0', '1', '1', ''),
('120933', '147212', '0', '0.04772601', '0', '1', '0', '1', '1', ''),
('120933', '147213', '0', '0.01509975', '0', '1', '0', '1', '1', ''),
('120933', '147214', '0', '0.0416142', '0', '1', '0', '1', '1', ''),
('120933', '147215', '0', '0.03127806', '0', '1', '0', '1', '1', ''),
('120933', '147216', '0', '0.01905445', '0', '1', '0', '1', '1', ''),
('120933', '147217', '0', '0.08700334', '0', '1', '0', '1', '1', ''),
('120933', '147218', '0', '0.03172746', '0', '1', '0', '1', '1', ''),
('120933', '147219', '0', '0.03774938', '0', '1', '0', '1', '1', ''),
('120933', '147220', '0', '0.01536939', '0', '1', '0', '1', '1', ''),
('120933', '147221', '0', '0.03001975', '0', '1', '0', '1', '1', ''),
('120933', '147222', '0', '0.02085204', '0', '1', '0', '1', '1', ''),
('120933', '147223', '0', '0.02040264', '0', '1', '0', '1', '1', ''),
('120933', '147356', '0', '0.4945169', '1', '1', '0', '1', '1', ''),
('120933', '147430', '0', '0.07675707', '1', '1', '0', '1', '1', ''),
('120933', '147729', '0', '0.1660973', '0', '1', '0', '1', '1', ''),
('120933', '153202', '0', '0.004853492', '0', '1', '0', '1', '1', ''),
('120933', '153248', '0', '0.004493974', '0', '1', '0', '1', '1', '');

UPDATE `creature_template` SET `lootid` = 120934 WHERE `entry` = 120934 AND `lootid` = 0;
DELETE FROM `creature_loot_template` WHERE `entry` = '120934';
INSERT INTO `creature_loot_template` (`entry`, `Item`, `Reference`, `Chance`, `QuestRequired`, `LootMode`, `GroupId`, `MinCount`, `MaxCount`, `Comment`) VALUES
('120934', '132199', '0', '3.565834', '0', '1', '0', '1', '1', ''),
('120934', '132204', '0', '96.42015', '0', '1', '0', '1', '1', ''),
('120934', '132749', '0', '0.006815101', '1', '1', '0', '1', '1', ''),
('120934', '137677', '0', '0.1036663', '1', '1', '0', '1', '1', ''),
('120934', '138781', '0', '0.2343051', '0', '1', '0', '1', '1', ''),
('120934', '138782', '0', '0.02054129', '0', '1', '0', '1', '1', ''),
('120934', '138817', '0', '0.02342091', '0', '1', '0', '1', '1', ''),
('120934', '138991', '0', '0.1492603', '1', '1', '0', '1', '1', ''),
('120934', '140220', '0', '0.01094256', '0', '1', '0', '1', '1', ''),
('120934', '140221', '0', '0.05653655', '0', '1', '0', '1', '1', ''),
('120934', '140222', '0', '0.06181585', '0', '1', '0', '1', '1', ''),
('120934', '140224', '0', '0.01180644', '0', '1', '0', '1', '1', ''),
('120934', '140225', '0', '0.02514868', '0', '1', '0', '1', '1', ''),
('120934', '140226', '0', '0.03772303', '0', '1', '0', '1', '1', ''),
('120934', '140227', '0', '0.2721241', '0', '1', '0', '1', '1', ''),
('120934', '141919', '0', '0.007774975', '0', '1', '0', '1', '1', ''),
('120934', '142119', '0', '0.003071595', '0', '1', '0', '1', '1', ''),
('120934', '144330', '0', '0.02418881', '0', '1', '0', '1', '1', ''),
('120934', '144345', '0', '0.02831627', '0', '1', '0', '1', '1', ''),
('120934', '147430', '0', '0.3202138', '1', '1', '0', '1', '1', ''),
('120934', '153202', '0', '0.004607392', '0', '1', '0', '1', '1', ''),
('120934', '153248', '0', '0.002591658', '0', '1', '0', '1', '1', '');

UPDATE `creature_template` SET `lootid` = 120932 WHERE `entry` = 120932 AND `lootid` = 0;
DELETE FROM `creature_loot_template` WHERE `entry` = '120932';
INSERT INTO `creature_loot_template` (`entry`, `Item`, `Reference`, `Chance`, `QuestRequired`, `LootMode`, `GroupId`, `MinCount`, `MaxCount`, `Comment`) VALUES
('120932', '121331', '0', '0.1924304', '0', '1', '0', '1', '1', ''),
('120932', '124437', '0', '11', '0', '1', '0', '1', '3', ''),
('120932', '132199', '0', '42.23539', '0', '1', '0', '1', '1', ''),
('120932', '132200', '0', '27.53407', '0', '1', '0', '1', '1', ''),
('120932', '132204', '0', '30', '0', '1', '0', '1', '1', ''),
('120932', '137677', '0', '0.1000638', '1', '1', '0', '1', '1', ''),
('120932', '138781', '0', '0.4137724', '0', '1', '0', '1', '1', ''),
('120932', '138782', '0', '0.01051327', '0', '1', '0', '1', '1', ''),
('120932', '138817', '0', '0.02872376', '0', '1', '0', '1', '1', ''),
('120932', '138991', '0', '0.05913716', '1', '1', '0', '1', '1', ''),
('120932', '140220', '0', '0.009950062', '0', '1', '0', '1', '1', ''),
('120932', '140221', '0', '0.05894942', '0', '1', '0', '1', '1', ''),
('120932', '140222', '0', '0.07040139', '0', '1', '0', '1', '1', ''),
('120932', '140224', '0', '0.02252844', '0', '1', '0', '1', '1', ''),
('120932', '140225', '0', '0.02553223', '0', '1', '0', '1', '1', ''),
('120932', '140226', '0', '0.01896144', '0', '1', '0', '1', '1', ''),
('120932', '140227', '0', '0.202756', '0', '1', '0', '1', '1', ''),
('120932', '144330', '0', '0.04787294', '0', '1', '0', '1', '1', ''),
('120932', '144345', '0', '0.0253445', '0', '1', '0', '1', '1', ''),
('120932', '146684', '0', '0.1361093', '1', '1', '0', '1', '1', ''),
('120932', '146692', '0', '0.04073893', '1', '1', '0', '1', '1', ''),
('120932', '146700', '0', '0.1276612', '1', '1', '0', '1', '1', ''),
('120932', '146708', '0', '0.09706004', '1', '1', '0', '1', '1', ''),
('120932', '146903', '0', '0.08110239', '0', '1', '0', '1', '1', ''),
('120932', '146905', '0', '0.1396763', '0', '1', '0', '1', '1', ''),
('120932', '146906', '0', '0.08429392', '0', '1', '0', '1', '1', ''),
('120932', '146907', '0', '0.1056959', '0', '1', '0', '1', '1', ''),
('120932', '146908', '0', '0.08166561', '0', '1', '0', '1', '1', ''),
('120932', '146909', '0', '0.08936282', '0', '1', '0', '1', '1', ''),
('120932', '147212', '0', '0.07903729', '0', '1', '0', '1', '1', ''),
('120932', '147213', '0', '0.05632111', '0', '1', '0', '1', '1', ''),
('120932', '147214', '0', '0.03529456', '0', '1', '0', '1', '1', ''),
('120932', '147215', '0', '0.06458154', '0', '1', '0', '1', '1', ''),
('120932', '147216', '0', '0.03435588', '0', '1', '0', '1', '1', ''),
('120932', '147217', '0', '0.1167724', '0', '1', '0', '1', '1', ''),
('120932', '147218', '0', '0.1753464', '0', '1', '0', '1', '1', ''),
('120932', '147219', '0', '0.05538242', '0', '1', '0', '1', '1', ''),
('120932', '147220', '0', '0.01652086', '0', '1', '0', '1', '1', ''),
('120932', '147221', '0', '0.05801074', '0', '1', '0', '1', '1', ''),
('120932', '147222', '0', '0.1344197', '0', '1', '0', '1', '1', ''),
('120932', '147223', '0', '0.03604551', '0', '1', '0', '1', '1', ''),
('120932', '147356', '0', '0.2752225', '1', '1', '0', '1', '1', ''),
('120932', '147430', '0', '0.1002516', '1', '1', '0', '1', '1', ''),
('120932', '147729', '0', '0.2504412', '0', '1', '0', '1', '1', ''),
('120932', '153202', '0', '0.004881163', '0', '1', '0', '1', '1', ''),
('120932', '153248', '0', '0.006570796', '0', '1', '0', '1', '1', '');



