# TrinityCore - WowPacketParser
# File name: 7.3.5_26365_五月-11-1529 - kongzhongweixie44748.awps.pkt
# Detected build: V7_3_5_26365
# Detected locale: zhCN
# Targeted database: Legion
# Parsing date: 05/11/2018 20:49:47
# 
SET @QUESTID = 44748;
SET @QUESTCONVERSATION1 = 4569;
SET @QUESTCONVERSATION2 = 4570;
DELETE FROM  `quest_conversation` WHERE `questId`=@QUESTID;
INSERT INTO `quest_conversation` (`questId`, `questAcceptConversation`, `questCompleteConversation`) VALUES (@QUESTID, @QUESTCONVERSATION1, @QUESTCONVERSATION2);

DELETE FROM `phase_area` WHERE `AreaId`=7543 AND  `PhaseId`=4575;
INSERT INTO `phase_area` (`AreaId`, `PhaseId`, `Comment`) VALUES 
(7543, 4575, 'broken island');


SET NAMES 'latin1';
DELETE FROM `quest_poi` WHERE (`QuestID`=46746 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=46746 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=11) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=10) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=9) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=8) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=7) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=6) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=5) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=4) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=3) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=48293 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=47119 AND `BlobIndex`=0 AND `Idx1`=0);
INSERT INTO `quest_poi` (`QuestID`, `BlobIndex`, `Idx1`, `ObjectiveIndex`, `QuestObjectiveID`, `QuestObjectID`, `MapID`, `WorldMapAreaId`, `Floor`, `Priority`, `Flags`, `WorldEffectID`, `PlayerConditionID`, `WoDUnk1`, `AlwaysAllowMergingBlobs`, `VerifiedBuild`) VALUES
(46746, 0, 1, 32, 0, 0, 1220, 1017, 0, 0, 0, 0, 0, 1174116, 0, 26365), -- Supplies From the Valarjar
(46746, 0, 0, -1, 0, 0, 1220, 1017, 0, 0, 0, 0, 0, 1174116, 0, 26365), -- Supplies From the Valarjar
(48293, 0, 11, -1, 0, 0, 1220, 1021, 2, 0, 2, 0, 41721, 0, 0, 26365), -- The Burning Coven
(48293, 0, 10, -1, 0, 0, 0, 23, 20, 0, 0, 0, 41726, 1223958, 0, 26365), -- The Burning Coven
(48293, 0, 9, -1, 0, 0, 1469, 1057, 0, 0, 0, 0, 41729, 1084746, 0, 26365), -- The Burning Coven
(48293, 0, 8, -1, 0, 0, 1220, 1077, 0, 0, 0, 0, 41723, 1067535, 0, 26365), -- The Burning Coven
(48293, 0, 7, -1, 0, 0, 1220, 1014, 4, 0, 0, 0, 41728, 1068975, 0, 26365), -- The Burning Coven
(48293, 0, 6, -1, 0, 0, 1514, 1044, 0, 0, 0, 0, 41720, 1082449, 0, 26365), -- The Burning Coven
(48293, 0, 5, -1, 0, 0, 1479, 1035, 1, 0, 0, 0, 41731, 1102053, 0, 26365), -- The Burning Coven
(48293, 0, 4, -1, 0, 0, 1220, 1072, 0, 0, 0, 0, 41724, 1125106, 0, 26365), -- The Burning Coven
(48293, 0, 3, -1, 0, 0, 1519, 1052, 2, 0, 0, 0, 41722, 1129776, 0, 26365), -- The Burning Coven
(48293, 0, 2, -1, 0, 0, 1107, 1050, 0, 0, 0, 0, 41730, 1150865, 0, 26365), -- The Burning Coven
(48293, 0, 1, -1, 0, 0, 1513, 1068, 1, 0, 0, 0, 41725, 1191891, 0, 26365), -- The Burning Coven
(48293, 0, 0, -1, 0, 0, 1512, 1040, 1, 0, 0, 0, 41727, 1205109, 0, 26365), -- The Burning Coven
(47119, 0, 0, -1, 0, 0, 1220, 1021, 0, 0, 0, 0, 0, 1289000, 0, 26365); -- Tomb of Sargeras: Free The Tormented

UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0 WHERE (`QuestID`=42234 AND `BlobIndex`=0 AND `Idx1`=0); -- The Valarjar
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=48642 AND `BlobIndex`=2 AND `Idx1`=2); -- Argussian Reach
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=48642 AND `BlobIndex`=1 AND `Idx1`=1); -- Argussian Reach
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=48642 AND `BlobIndex`=0 AND `Idx1`=0); -- Argussian Reach
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0 WHERE (`QuestID`=42420 AND `BlobIndex`=0 AND `Idx1`=0); -- Court of Farondis
DELETE FROM `quest_poi_points` WHERE (`QuestID`=46746 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=46746 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=11 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=10 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=9 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=8 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=7 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=6 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=5 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=4 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=3 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=48293 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=47119 AND `Idx1`=0 AND `Idx2`=0);
INSERT INTO `quest_poi_points` (`QuestID`, `Idx1`, `Idx2`, `X`, `Y`, `VerifiedBuild`) VALUES
(46746, 1, 0, 3189, 1537, 26365), -- Supplies From the Valarjar
(46746, 0, 0, 3189, 1537, 26365), -- Supplies From the Valarjar
(48293, 11, 0, -1514, 1055, 26365), -- The Burning Coven
(48293, 10, 0, 2337, -5386, 26365), -- The Burning Coven
(48293, 9, 0, 943, 1061, 26365), -- The Burning Coven
(48293, 8, 0, 3973, 7324, 26365), -- The Burning Coven
(48293, 7, 0, -890, 4560, 26365), -- The Burning Coven
(48293, 6, 0, 724, 3566, 26365), -- The Burning Coven
(48293, 5, 0, 1138, 7219, 26365), -- The Burning Coven
(48293, 4, 0, 4535, 5290, 26365), -- The Burning Coven
(48293, 3, 0, 1583, 1435, 26365), -- The Burning Coven
(48293, 2, 0, 3044, 883, 26365), -- The Burning Coven
(48293, 1, 0, -886, 4631, 26365), -- The Burning Coven
(48293, 0, 0, 1340, 1336, 26365), -- The Burning Coven
(47119, 0, 0, -1625, 3202, 26365); -- Tomb of Sargeras: Free The Tormented



UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=115157; -- 115157 (隐秘通途游侠)
UPDATE `creature_template_addon` SET `auras`='170133 18950' WHERE `entry`=118316; -- 118316 (伊利达雷执行者)
UPDATE `creature_template_addon` SET `bytes1`=1 WHERE `entry`=115156; -- 115156 (隐秘通途游侠)
UPDATE `creature_template_addon` SET `bytes1`=0, `auras`='170133 13236' WHERE `entry`=120400; -- 120400 (铁枝德鲁伊)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=118978; -- 118978 (抗魔联军哨兵)
UPDATE `creature_template_addon` SET `auras`='84186' WHERE `entry`=120404; -- 120404 (利爪德鲁伊)
UPDATE `creature_template_addon` SET `bytes2`=2 WHERE `entry`=117506; -- 117506 (抗魔联军哨兵)
UPDATE `creature_template_addon` SET `bytes1`=1, `auras`='170133' WHERE `entry`=120401; -- 120401 (铁枝德鲁伊)


UPDATE `creature_model_info` SET `BoundingRadius`=2.115664, `VerifiedBuild`=26365 WHERE `DisplayID`=65688;
UPDATE `creature_model_info` SET `BoundingRadius`=0.5056454, `VerifiedBuild`=26365 WHERE `DisplayID`=2722;




UPDATE `gameobject_template_addon` SET `flags`=2113540 WHERE `entry`=265554; -- Shipwrecked Supplies
UPDATE `gameobject_template_addon` SET `flags`=2113540 WHERE `entry`=265552; -- Shipwrecked Supplies
UPDATE `gameobject_template_addon` SET `flags`=2113540 WHERE `entry`=265551; -- Shipwrecked Supplies


SET NAMES 'latin1';

UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=44748 AND `BlobIndex`=0 AND `Idx1`=2); -- Winged Terrors
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=44748 AND `BlobIndex`=0 AND `Idx1`=1); -- Winged Terrors
UPDATE `quest_poi` SET `AlwaysAllowMergingBlobs`=0, `VerifiedBuild`=26365 WHERE (`QuestID`=44748 AND `BlobIndex`=0 AND `Idx1`=0); -- Winged Terrors

SET @CGUID= 453612; -- 158
SET @OGUID= 105275; -- 54

DELETE FROM `creature` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+157;
INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
(@CGUID+0, 120311, 1220, 7543, 8554, 1, '0', 0, 0, 0, -1723.49, 3232.728, 114.9656, 4.173349, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 剧毒飞蛾 (Area: -Unknown- - Difficulty: 1)
(@CGUID+1, 117754, 1220, 7543, 8588, 1, '0', 0, 0, 0, -1755.983, 3158.678, 12.3416, 3.730407, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+2, 120311, 1220, 7543, 8588, 1, '0', 0, 0, 0, -1765.726, 3188.095, 70.61742, 4.637851, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 剧毒飞蛾 (Area: -Unknown- - Difficulty: 1)
(@CGUID+3, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1688.775, 3079.318, 41.39329, 6.118871, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+4, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1775.049, 3141.924, 14.30581, 6.033606, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)

(@CGUID+12, 120311, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1764.587, 3242.695, 93.1861, 5.161726, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 剧毒飞蛾 (Area: -Unknown- - Difficulty: 1)
(@CGUID+13, 10779, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1803.125, 3196.875, 24.74603, 2.995762, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 被感染的松鼠 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+14, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1779.714, 3089.523, 6.647705, 5.34241, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+15, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1762.413, 3090.048, 7.961142, 1.612723, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+16, 120311, 1220, 7543, 8588, 1, '0', 0, 0, 0, -1824.97, 3210.089, 35.01928, 2.245708, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 剧毒飞蛾 (Area: -Unknown- - Difficulty: 1)
(@CGUID+17, 120386, 1220, 7543, 8588, 1, '0', 0, 0, 0, -1802.519, 3247.458, 60.51028, 3.651805, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 食腐乌鸦 (Area: -Unknown- - Difficulty: 1)
(@CGUID+18, 117754, 1220, 7543, 8588, 1, '0', 0, 0, 0, -1803.864, 3077.405, 2.427093, 3.757757, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+19, 120311, 1220, 7543, 8588, 1, '0', 0, 0, 0, -1848.586, 3193.147, 22.71472, 0.8768545, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 剧毒飞蛾 (Area: -Unknown- - Difficulty: 1)
(@CGUID+20, 115056, 1220, 7543, 8588, 1, '0', 0, 0, 0, -1847.183, 3173.027, 30.17494, 3.126698, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+21, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1812.778, 3085.297, 2.849982, 2.735381, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+22, 120386, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1831.203, 3195.941, 20.0541, 2.523995, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 食腐乌鸦 (Area: -Unknown- - Difficulty: 1)
(@CGUID+23, 117754, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1851.987, 3123.192, 4.710389, 3.063078, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
-- (@CGUID+24, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1794.207, 3070.146, 3.0271, 3.598924, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+25, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1847.718, 3173.03, 23.81353, 0.004319378, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+26, 10779, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1839.142, 3189.915, 16.92217, 4.713208, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 被感染的松鼠 (Area: -Unknown- - Difficulty: 1)
(@CGUID+27, 116534, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1814.137, 3107, 4.748979, 5.637185, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+28, 120386, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1831.311, 3200.809, 21.36562, 4.369439, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 食腐乌鸦 (Area: -Unknown- - Difficulty: 1)
(@CGUID+29, 120386, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1849.919, 3216.87, 57.13169, 4.446843, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 食腐乌鸦 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+30, 116534, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1861.977, 3159.2, 3.968221, 5.220068, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+31, 116171, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1812.36, 3105.09, 4.699592, 2.250876, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 魔刃哨兵 (Area: -Unknown- - Difficulty: 1)
(@CGUID+32, 120386, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1835.627, 3199.597, 19.65533, 6.012193, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 食腐乌鸦 (Area: -Unknown- - Difficulty: 1)
(@CGUID+33, 117754, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1864.313, 3135.131, 4.400596, 0.7184092, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+34, 100048, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1862.45, 3157.14, 3.88265, 1.865255, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 愤怒卫士夺灵者 (Area: -Unknown- - Difficulty: 1) (Auras: 204087 - -Unknown-)
(@CGUID+35, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1722.747, 3108.799, 50.62222, 5.270657, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+36, 100048, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1847.566, 3098.078, 4.040113, 5.720875, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 愤怒卫士夺灵者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+37, 117793, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1865.035, 3085.844, 18.02884, 0.9323744, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
-- (@CGUID+38, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1879.393, 3121.36, 4.555561, 3.885624, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+39, 116533, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1789.754, 3056.651, 3.210419, 5.555552, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+40, 116534, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1884.76, 3110.873, 3.872954, 6.26904, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+41, 117793, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1850.983, 3087.157, 18.02884, 6.216489, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+42, 117793, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1850.232, 3091.83, 18.02884, 1.338579, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+43, 117754, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1860.846, 3098.882, 3.766119, 4.024529, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+44, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1868.396, 3094.571, 23.40546, 0.3566774, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+45, 116534, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1876.958, 3149.018, 3.42473, 5.637185, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+46, 116171, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1882.74, 3111.3, 4.064107, 3.353848, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 魔刃哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: )
-- (@CGUID+47, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1846.724, 3079.253, 2.28108, 3.939877, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+48, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1828.582, 3133.703, 5.222563, 2.665755, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
-- (@CGUID+49, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1856.259, 3065.422, 0.9656105, 4.175683, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+50, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1865.279, 3074.353, 1.198645, 3.696256, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+51, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1854.529, 3068.809, 1.152784, 4.302225, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+52, 116533, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1894.149, 3133.729, 3.784154, 5.68669, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+53, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1859.391, 3069.379, 36.63078, 6.266534, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+54, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1907.304, 3096.943, 24.75586, 5.716108, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+55, 117754, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1858.335, 3237.684, 15.8281, 0.2046779, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+56, 116534, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1928.366, 3139.168, 8.505208, 6.113865, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+57, 116534, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1928.877, 3144.332, 8.92882, 6.113865, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+58, 118993, 1220, 7543, 8590, 1, '0', 0, 0, 0, -2048.987, 3164.616, -0.4134388, 5.883267, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 恐眼 (Area: -Unknown- - Difficulty: 1) (Auras: 236261 - -Unknown-)
(@CGUID+59, 117754, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1910.048, 3211.165, -0.05351222, 3.041667, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1)
(@CGUID+60, 118255, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1931.656, 3240.384, -0.2683029, 3.014219, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 海鳞鳄鱼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+61, 118255, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1951.15, 3206.642, 2.837071, 2.839445, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 海鳞鳄鱼 (Area: -Unknown- - Difficulty: 1)
(@CGUID+62, 117754, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1970.35, 3140.466, 2.020112, 3.167954, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+63, 116533, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1843.56, 3048.347, 0.8406101, 5.637185, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+64, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1832.588, 3052.097, 0.8697201, 0.9879605, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1)
(@CGUID+65, 116534, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1868.039, 3041.985, 0.8818493, 0.2513067, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+66, 100048, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1872.64, 3040.804, 0.58732, 0.2516089, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 愤怒卫士夺灵者 (Area: -Unknown- - Difficulty: 1) (Auras: 204087 - -Unknown-)
(@CGUID+67, 123230, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1933.521, 3053.968, -9.132687, 4.412874, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 损坏的潜水头盔 (Area: -Unknown- - Difficulty: 1) (Auras: 142433 - -Unknown-, 144301 - -Unknown-, 245506 - -Unknown-)
(@CGUID+68, 116533, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1861.271, 3022.99, 0.1739435, 0.4081767, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+69, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1803.455, 3078.795, 17.48145, 2.521769, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+70, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1787.388, 3096.533, 32.31449, 2.492504, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+71, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1808.383, 3042.119, 0.9497547, 6.128848, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+72, 117754, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1822.048, 3031.374, 0.8836021, 4.546259, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1)
(@CGUID+73, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1856.816, 3010.52, 0.7798191, 5.236652, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: )
-- (@CGUID+74, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1846.327, 3009.369, 0.8406105, 5.074311, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+75, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1805.769, 3035.487, 23.40546, 3.847537, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+76, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1810.861, 3016.125, 23.40546, 4.747313, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+77, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1845.815, 2989.629, 23.40546, 4.407279, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+78, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1789.168, 3014.307, 23.40546, 6.01249, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+79, 123230, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1895.26, 2976.575, -19.33214, 3.086387, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 损坏的潜水头盔 (Area: -Unknown- - Difficulty: 1) (Auras: 142433 - -Unknown-, 144301 - -Unknown-, 245506 - -Unknown-)
-- (@CGUID+80, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1930.648, 2989.831, -3.222408, 0.7866217, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+81, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1852.528, 3019.297, 23.40546, 2.521769, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+82, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1907.304, 3096.943, 24.75586, 0.8073674, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+83, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1775.723, 3029.098, 2.303911, 3.295728, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1)
(@CGUID+84, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1869.372, 3060.259, 0.8971565, 1.736705, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+85, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1823.594, 3062.889, 0.9372311, 5.663168, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: )
-- (@CGUID+86, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1782.024, 3092.318, 32.31449, 2.521769, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+87, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1803.455, 3078.795, 17.48145, 5.270657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+88, 117754, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1764.943, 3034.456, 4.278409, 0.7964475, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+89, 117793, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1744.178, 3031.564, 20.65312, 4.686399, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+90, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1747.703, 3030.224, 23.40546, 0.5995551, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+91, 116534, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1754.476, 3007.372, 4.843774, 6.19587, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 白银之手保卫者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+92, 100048, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1751.57, 3007.569, 5.528374, 3.121088, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 愤怒卫士夺灵者 (Area: -Unknown- - Difficulty: 1) (Auras: 204087 - -Unknown-)
(@CGUID+93, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1825.819, 3163.582, 30.17494, 2.521769, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+94, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1880.701, 3120.075, 36.63078, 4.147233, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+95, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1761.639, 3091.155, 8.027039, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+96, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1860.972, 3009.628, 0.2156101, 1.934389, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+97, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1803.455, 3078.795, 17.48145, 2.521769, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+98, 117754, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1788.78, 2955.945, 0.1296959, 0.4511273, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+99, 120932, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1788.309, 2955.773, 0.2361145, 2.032878, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 燃烧哨兵 (Area: -Unknown- - Difficulty: 1)
(@CGUID+100, 117754, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1705.777, 3007.669, 16.64463, 3.47044, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 石化蟹 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+101, 121344, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1808.499, 2956.124, 1.230732, 2.348785, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+102, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1870.048, 3053.329, 24.75586, 0.4101972, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+103, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1818.875, 3027.392, 0.9131134, 4.564538, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+104, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1823.594, 3062.889, 0.9372311, 5.355022, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+105, 120934, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1804.423, 2958.15, 0.1247569, 0.5455209, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: 211762 - -Unknown-) (possible waypoints or random movement)
(@CGUID+106, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1869.41, 3127.501, 36.63078, 0.3509499, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+107, 120513, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1803.536, 2950.623, 0.2361111, 0.1353908, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+108, 120934, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1802.102, 2959.576, 0.05209675, 0.5399889, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: 211762 - -Unknown-)
(@CGUID+109, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1791.655, 3021.775, 1.032904, 4.196104, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+110, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1844.927, 3098.825, 4.076522, 4.722672, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: )
-- (@CGUID+111, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1759.222, 3063.731, 19.35583, 5.270657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+112, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1879.955, 2973.908, 16.16485, 1.749088, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+113, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1774.385, 3077.163, 32.3145, 4.892466, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+114, 123230, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1966.951, 3028.097, -25.29299, 5.066613, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 损坏的潜水头盔 (Area: -Unknown- - Difficulty: 1) (Auras: 142433 - -Unknown-, 144301 - -Unknown-, 245506 - -Unknown-)
(@CGUID+115, 120933, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1807.625, 2934.721, 0.2247267, 4.237484, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+116, 120933, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1787.691, 2924.232, 0.6802304, 4.728013, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+117, 100048, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1748.712, 3019.485, 6.069789, 2.182411, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 愤怒卫士夺灵者 (Area: -Unknown- - Difficulty: 1) (Auras: 204087 - -Unknown-)
(@CGUID+118, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1829.563, 3105.138, 36.63078, 4.907302, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+119, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1859.408, 3006.439, 0.1739434, 1.642615, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+120, 121344, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1769.787, 2945.248, 0.0373615, 2.430848, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
(@CGUID+121, 120934, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1794.287, 2935.057, 0.3106095, 2.578604, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: 211762 - -Unknown-) (possible waypoints or random movement)
(@CGUID+122, 120934, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1792.803, 2933.622, 0.436987, 2.577745, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: 211762 - -Unknown-)
(@CGUID+123, 117793, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1754.21, 3028.451, 20.73645, 3.916095, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
-- (@CGUID+124, 117793, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1754.21, 3028.451, 20.73645, 2.017355, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 幼年魔蝠 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+125, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1827.775, 3135.422, 4.533703, 4.591638, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+126, 120934, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1800.148, 2946.121, 0.1528681, 1.992326, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: 211762 - -Unknown-)
-- (@CGUID+127, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1803.455, 3078.795, 17.48145, 2.521769, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+128, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1852.528, 3019.297, 23.40546, 2.521769, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+129, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1759.222, 3063.731, 19.35583, 2.521769, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+130, 100048, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1875.06, 3146.85, 3.519261, 2.267562, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 愤怒卫士夺灵者 (Area: -Unknown- - Difficulty: 1) (Auras: 204087 - -Unknown-, 238637 - -Unknown-)
(@CGUID+131, 100048, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1791.267, 3039.059, 1.365639, 2.971002, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 愤怒卫士夺灵者 (Area: -Unknown- - Difficulty: 1) (Auras: 204087 - -Unknown-)
(@CGUID+132, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1761.639, 3091.155, 8.027039, 5.774071, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+133, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1803.455, 3078.795, 17.48145, 5.270657, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+134, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1907.304, 3096.943, 24.75586, 0.8073674, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+135, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1782.024, 3092.318, 32.31449, 2.521769, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+136, 100048, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1830.449, 3014.381, 0.6347613, 2.82355, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 愤怒卫士夺灵者 (Area: -Unknown- - Difficulty: 1) (Auras: 204087 - -Unknown-)
-- (@CGUID+137, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1880.701, 3120.075, 36.63078, 0.6129429, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+138, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1767.393, 3069.836, 19.35584, 2.623297, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+139, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1869.372, 3060.259, 0.8971565, 1.683051, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+140, 116171, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1860.514, 3116.089, 4.435109, 3.353829, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 魔刃哨兵 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+141, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1907.304, 3096.943, 24.75586, 0.8073674, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+142, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1803.455, 3078.795, 17.48145, 5.270657, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+143, 116171, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1856.122, 3136.272, 4.339743, 2.182411, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 魔刃哨兵 (Area: -Unknown- - Difficulty: 1)
(@CGUID+144, 115434, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1961.933, 2991.061, -13.03915, 3.932415, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 岛礁锤头鲨 (Area: -Unknown- - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+145, 120513, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1788.986, 2928.861, 0.2373551, 1.520227, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+146, 120934, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1804.77, 2954.752, 0.1527978, 1.999811, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪火小鬼 (Area: -Unknown- - Difficulty: 1) (Auras: 211762 - -Unknown-)
(@CGUID+147, 123230, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1887.071, 2908.232, -30.09178, 1.322379, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 损坏的潜水头盔 (Area: -Unknown- - Difficulty: 1) (Auras: 142433 - -Unknown-, 144301 - -Unknown-, 245506 - -Unknown-)
(@CGUID+148, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1784.261, 3049.075, 32.3145, 3.851078, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
(@CGUID+149, 121344, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1784.264, 2912.156, 1.32879, 5.219446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪能火球 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+150, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1803.455, 3078.795, 17.48145, 5.270657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: )
(@CGUID+151, 120933, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1786.134, 2905.41, 0.5299613, 2.390044, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 活性邪焰元素 (Area: -Unknown- - Difficulty: 1)
(@CGUID+152, 120513, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1747.49, 2929.04, 1.859822, 1.030218, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- General Purpose Stalker (RKS) (Area: -Unknown- - Difficulty: 1)
(@CGUID+153, 115054, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1738.135, 3037.165, 8.789782, 1.082756, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365); -- 虫语清道夫 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+154, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1759.222, 3063.731, 19.35583, 3.896213, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+155, 115056, 1220, 7543, 8590, 1, '0', 0, 0, 0, -1871.455, 3109.956, 11.67362, 4.227256, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1) (Auras: )
-- (@CGUID+156, 115056, 1220, 7543, 8571, 3, '0', 0, 0, 0, -1852.528, 3019.297, 23.40546, 5.270657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
-- (@CGUID+157, 115056, 1220, 7543, 8571, 3, '0', 0, 0, 0, -1880.701, 3120.075, 36.63078, 0.6129429, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26365); -- 邪翼吞噬者 (Area: -Unknown- - Difficulty: 1)
DELETE FROM `creature_addon` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+157;
INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+0, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 剧毒飞蛾
(@CGUID+1, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+2, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 剧毒飞蛾
(@CGUID+3, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+4, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫

(@CGUID+12, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 剧毒飞蛾
(@CGUID+13, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被感染的松鼠
-- (@CGUID+14, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+15, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+16, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 剧毒飞蛾
(@CGUID+17, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 食腐乌鸦
(@CGUID+18, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+19, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 剧毒飞蛾
(@CGUID+20, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
-- (@CGUID+21, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+22, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 食腐乌鸦
(@CGUID+23, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
-- (@CGUID+24, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+25, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+26, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被感染的松鼠
(@CGUID+27, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
(@CGUID+28, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 食腐乌鸦
(@CGUID+29, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 食腐乌鸦
(@CGUID+30, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
(@CGUID+31, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 魔刃哨兵
(@CGUID+32, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 食腐乌鸦
(@CGUID+33, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+34, 0, 0, 0, 1, 0, 0, 0, 0, '204087'), -- 愤怒卫士夺灵者 - 204087 - -Unknown-
(@CGUID+35, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+36, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 愤怒卫士夺灵者
(@CGUID+37, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
-- (@CGUID+38, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+39, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
(@CGUID+40, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
(@CGUID+41, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+42, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+43, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+44, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+45, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
(@CGUID+46, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 魔刃哨兵
-- (@CGUID+47, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+48, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
-- (@CGUID+49, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+50, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
-- (@CGUID+51, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+52, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
(@CGUID+53, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+54, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+55, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+56, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
(@CGUID+57, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
(@CGUID+58, 0, 0, 0, 1, 0, 0, 0, 0, '236261'), -- 恐眼 - 236261 - -Unknown-
(@CGUID+59, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+60, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 海鳞鳄鱼
(@CGUID+61, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 海鳞鳄鱼
(@CGUID+62, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+63, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
(@CGUID+64, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+65, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
(@CGUID+66, 0, 0, 0, 1, 0, 0, 0, 0, '204087'), -- 愤怒卫士夺灵者 - 204087 - -Unknown-
(@CGUID+67, 0, 0, 0, 1, 0, 0, 0, 0, '142433 144301 245506'), -- 损坏的潜水头盔 - 142433 - -Unknown-, 144301 - -Unknown-, 245506 - -Unknown-
(@CGUID+68, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
-- (@CGUID+69, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+70, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
-- (@CGUID+71, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+72, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+73, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
-- (@CGUID+74, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+75, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+76, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+77, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+78, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+79, 0, 0, 0, 1, 0, 0, 0, 0, '142433 144301 245506'), -- 损坏的潜水头盔 - 142433 - -Unknown-, 144301 - -Unknown-, 245506 - -Unknown-
-- (@CGUID+80, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+81, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+82, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+83, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+84, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+85, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
-- (@CGUID+86, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
-- (@CGUID+87, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+88, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+89, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+90, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+91, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 白银之手保卫者
(@CGUID+92, 0, 0, 0, 1, 0, 0, 0, 0, '204087'), -- 愤怒卫士夺灵者 - 204087 - -Unknown-
(@CGUID+93, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+94, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+95, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+96, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+97, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+98, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+99, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 燃烧哨兵
(@CGUID+100, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 石化蟹
(@CGUID+101, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+102, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+103, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+104, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+105, 0, 0, 0, 1, 0, 0, 0, 0, '211762'), -- 邪火小鬼 - 211762 - -Unknown-
(@CGUID+106, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+107, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+108, 0, 0, 0, 1, 0, 0, 0, 0, '211762'), -- 邪火小鬼 - 211762 - -Unknown-
(@CGUID+109, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+110, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
-- (@CGUID+111, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+112, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+113, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+114, 0, 0, 0, 1, 0, 0, 0, 0, '142433 144301 245506'), -- 损坏的潜水头盔 - 142433 - -Unknown-, 144301 - -Unknown-, 245506 - -Unknown-
(@CGUID+115, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+116, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+117, 0, 0, 0, 1, 0, 0, 0, 0, '204087'), -- 愤怒卫士夺灵者 - 204087 - -Unknown-
(@CGUID+118, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+119, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+120, 0, 0, 33554432, 1, 0, 0, 0, 0, ''), -- 邪能火球
(@CGUID+121, 0, 0, 0, 1, 0, 0, 0, 0, '211762'), -- 邪火小鬼 - 211762 - -Unknown-
(@CGUID+122, 0, 0, 0, 1, 0, 0, 0, 0, '211762'), -- 邪火小鬼 - 211762 - -Unknown-
(@CGUID+123, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
-- (@CGUID+124, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 幼年魔蝠
(@CGUID+125, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+126, 0, 0, 0, 1, 0, 0, 0, 0, '211762'), -- 邪火小鬼 - 211762 - -Unknown-
-- (@CGUID+127, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+128, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+129, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+130, 0, 0, 0, 1, 0, 0, 0, 0, '204087 238637'), -- 愤怒卫士夺灵者 - 204087 - -Unknown-, 238637 - -Unknown-
(@CGUID+131, 0, 0, 0, 1, 0, 0, 0, 0, '204087'), -- 愤怒卫士夺灵者 - 204087 - -Unknown-
(@CGUID+132, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+133, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+134, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+135, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+136, 0, 0, 0, 1, 0, 0, 0, 0, '204087'), -- 愤怒卫士夺灵者 - 204087 - -Unknown-
-- (@CGUID+137, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+138, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+139, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虫语清道夫
(@CGUID+140, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 魔刃哨兵
(@CGUID+141, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+142, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+143, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 魔刃哨兵
(@CGUID+144, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 岛礁锤头鲨
(@CGUID+145, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+146, 0, 0, 0, 1, 0, 0, 0, 0, '211762'), -- 邪火小鬼 - 211762 - -Unknown-
(@CGUID+147, 0, 0, 0, 1, 0, 0, 0, 0, '142433 144301 245506'), -- 损坏的潜水头盔 - 142433 - -Unknown-, 144301 - -Unknown-, 245506 - -Unknown-
(@CGUID+148, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+149, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 邪能火球
-- (@CGUID+150, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
(@CGUID+151, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 活性邪焰元素
(@CGUID+152, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- General Purpose Stalker (RKS)
(@CGUID+153, 0, 0, 0, 1, 0, 0, 0, 0, ''); -- 虫语清道夫
-- (@CGUID+154, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
-- (@CGUID+155, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
-- (@CGUID+156, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 邪翼吞噬者
-- (@CGUID+157, 0, 0, 50331648, 1, 0, 0, 0, 0, ''); -- 邪翼吞噬者

DELETE FROM `gameobject` WHERE `guid` BETWEEN @OGUID+0 AND @OGUID+53;
INSERT INTO `gameobject` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `position_x`, `position_y`, `position_z`, `orientation`, `rotation0`, `rotation1`, `rotation2`, `rotation3`, `spawntimesecs`, `animprogress`, `state`, `VerifiedBuild`) VALUES
(@OGUID+0, 268435, 1220, 7543, 8590, 1, '0', 0, -1789.304, 3145.814, 13.56332, 0.0611744, 0, 0, 0.03058243, 0.9995323, 7200, 255, 1, 26365), -- Ancient Shrine (Area: -Unknown- - Difficulty: 1)
-- (@OGUID+1, 265572, 1220, 7543, 8590, 1, '0', 0, -1722.207, 3275.417, 30.73859, 0.5090845, 0, 0, 0.2518024, 0.9677787, 7200, 255, 1, 26365), -- Prison Cage (Area: -Unknown- - Difficulty: 1)
(@OGUID+2, 268527, 1220, 7543, 8590, 1, '0', 0, -1731.575, 3077.718, 18.60085, 3.179367, 0.1840429, 0.15973, -0.9686422, 0.04844331, 7200, 255, 1, 26365), -- 掩饰灌木丛 (Area: -Unknown- - Difficulty: 1)
(@OGUID+3, 268525, 1220, 7543, 8590, 1, '0', 0, -1732.625, 3076.675, 19.08115, 3.797835, 0, 0, -0.9466496, 0.3222649, 7200, 255, 1, 26365), -- 此处绝对没有秘密！ (Area: -Unknown- - Difficulty: 1)
(@OGUID+4, 233281, 1220, 7543, 8590, 1, '0', 0, -1833.575, 3197.097, 19.14446, 3.050599, -0.06858253, -0.0524292, 0.9953966, 0.04163152, 7200, 255, 1, 26365), -- Animal Bones (Area: -Unknown- - Difficulty: 1)
(@OGUID+5, 265551, 1220, 7543, 8590, 1, '0', 0, -1819.708, 3108.845, 4.236556, 0.02884121, 0.03117704, 0.1981516, 0.007260323, 0.9796485, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+6, 265552, 1220, 7543, 8590, 1, '0', 0, -1775.925, 3059.018, 4.239159, 6.108816, -0.005505562, 0.1342554, -0.08398342, 0.9873662, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+7, 265542, 1220, 7543, 8590, 1, '0', 0, -1828.325, 3135.947, 6.283218, 2.951528, 0.1340575, 0.8639097, -0.4830265, 0.04872303, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+8, 265551, 1220, 7543, 8590, 1, '0', 0, -1893.134, 3157.473, 2.767396, 0.02884121, 0.03117704, 0.1981516, 0.007260323, 0.9796485, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+9, 265542, 1220, 7543, 8590, 1, '0', 0, -1880.847, 3169.521, 7.855486, 0.3759878, 0.9771757, 0.181776, 0.05769253, 0.09357691, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+10, 241726, 1220, 7543, 8590, 1, '0', 0, -1880.839, 3197.786, 6.546088, 6.159349, -0.139225, -0.1338854, -0.07961369, 0.9779329, 7200, 255, 1, 26365), -- Leystone Deposit (Area: -Unknown- - Difficulty: 1)
(@OGUID+11, 265542, 1220, 7543, 8590, 1, '0', 0, -1892.847, 3125.399, 4.55938, 4.789401, -0.5676208, 0.6046066, -0.3111658, 0.464148, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+12, 265551, 1220, 7543, 8590, 1, '0', 0, -1824.845, 3054.96, 0.4777655, 0.02884121, 0.03117704, 0.1981516, 0.007260323, 0.9796485, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+13, 265554, 1220, 7543, 8590, 1, '0', 0, -1877.047, 3070.236, 0.5043408, 0, 0, 0, 0, 1, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+14, 244774, 1220, 7543, 8590, 1, '0', 0, -1902.288, 3184.841, 3.924684, 0, 0, 0, 0, 1, 7200, 255, 1, 26365), -- Aethril (Area: -Unknown- - Difficulty: 1)
(@OGUID+15, 265551, 1220, 7543, 8590, 1, '0', 0, -1941.865, 3111.485, 0.4702789, 0.02884121, 0.03117704, 0.1981516, 0.007260323, 0.9796485, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+16, 265542, 1220, 7543, 8590, 1, '0', 0, -1836.254, 3041.806, 1.371229, 3.603556, -0.1328878, 0.8185863, -0.5174131, 0.2110471, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+17, 265554, 1220, 7543, 8590, 1, '0', 0, -1887.832, 3055.89, 0.1537109, 0, 0, 0, 0, 1, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+18, 265554, 1220, 7543, 8590, 1, '0', 0, -1867.745, 3031.292, 0.1070185, 0, 0, 0, 0, 1, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+19, 265552, 1220, 7543, 8590, 1, '0', 0, -1876.965, 3031.543, -0.2336972, 6.108816, -0.005505562, 0.1342554, -0.08398342, 0.9873662, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+20, 265542, 1220, 7543, 8590, 1, '0', 0, -1870.403, 3021.236, 4.885727, 2.628017, -0.2563519, -0.9603119, -0.1092911, 0.01184019, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+21, 265542, 1220, 7543, 8590, 1, '0', 0, -1810.177, 3097.066, 4.992649, 3.795937, -0.2317219, 0.8429804, -0.4206476, 0.2423729, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+22, 265542, 1220, 7543, 8590, 1, '0', 0, -1880.806, 3089.711, 5.418179, 2.628017, -0.2563519, -0.9603119, -0.1092911, 0.01184019, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+23, 265542, 1220, 7543, 8590, 1, '0', 0, -1870.884, 3016.767, 3.710441, 0.3759878, 0.9771757, 0.181776, 0.05769253, 0.09357691, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+24, 265551, 1220, 7543, 8590, 1, '0', 0, -1818.274, 3027.49, 0.5511296, 0.02884121, 0.03117704, 0.1981516, 0.007260323, 0.9796485, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+25, 265552, 1220, 7543, 8590, 1, '0', 0, -1862.901, 2992.23, -0.3849352, 6.108816, -0.005505562, 0.1342554, -0.08398342, 0.9873662, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+26, 265554, 1220, 7543, 8590, 1, '0', 0, -1845.59, 2992.575, 0.09061008, 0, 0, 0, 0, 1, 7200, 255, 0, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+27, 265552, 1220, 7543, 8590, 1, '0', 0, -1823.408, 2984.984, -0.4604535, 6.108816, -0.005505562, 0.1342554, -0.08398342, 0.9873662, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+28, 252565, 1220, 7543, 8590, 1, '0', 0, -1842.495, 3473.328, 6.074741, 0, 0, 0, 0, 1, 7200, 255, 1, 26365), -- Hungering Orb (Area: -Unknown- - Difficulty: 1)
(@OGUID+29, 265542, 1220, 7543, 8590, 1, '0', 0, -1848.273, 3095.735, 4.149483, 4.789401, -0.5676208, 0.6046066, -0.3111658, 0.464148, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+30, 265542, 1220, 7543, 8590, 1, '0', 0, -1881.217, 3092.864, 5.831958, 5.90304, 0.975266, -0.1917601, 0.01907825, 0.1082606, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+31, 265542, 1220, 7543, 8590, 1, '0', 0, -1892.847, 3125.399, 4.55938, 4.789401, -0.5676208, 0.6046066, -0.3111658, 0.464148, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+32, 265552, 1220, 7543, 8590, 1, '0', 0, -1741.153, 3033.201, 7.093102, 6.108816, -0.005505562, 0.1342554, -0.08398342, 0.9873662, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+33, 265542, 1220, 7543, 8590, 1, '0', 0, -1783.986, 2999.392, 3.590076, 1.165229, 0.8321867, 0.5434885, 0.0892334, 0.06421038, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+34, 265542, 1220, 7543, 8590, 1, '0', 0, -1880.847, 3169.521, 7.855486, 0.3759878, 0.9771757, 0.181776, 0.05769253, 0.09357691, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+35, 265542, 1220, 7543, 8590, 1, '0', 0, -1870.983, 3057.333, 1.62727, 5.165765, -0.6707053, 0.4877462, -0.2188435, 0.5141649, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+36, 265542, 1220, 7543, 8590, 1, '0', 0, -1841.875, 2995.481, 2.662946, 0.3759878, 0.9771757, 0.181776, 0.05769253, 0.09357691, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+37, 265554, 1220, 7543, 8590, 1, '0', 0, -1755.826, 2997.171, 3.259759, 0, 0, 0, 0, 1, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+38, 265554, 1220, 7543, 8590, 1, '0', 0, -1782.891, 2972.657, -0.2121792, 0, 0, 0, 0, 1, 7200, 255, 1, 26365), -- Shipwrecked Supplies (Area: -Unknown- - Difficulty: 1)
(@OGUID+39, 241538, 1220, 7543, 8590, 1, '0', 0, -1689.986, 3065.258, 33.15203, 3.126718, 0, 0, 0.9999723, 0.007437279, 7200, 255, 1, 26365), -- Doom Shroom (Area: -Unknown- - Difficulty: 1)
(@OGUID+40, 246493, 1220, 7543, 8590, 1, '0', 0, -1765.639, 2967.053, 0, 0, 0, 0, 0, 1, 7200, 255, 1, 26365), -- Black Barracuda School (Area: -Unknown- - Difficulty: 1)
(@OGUID+41, 265542, 1220, 7543, 8590, 1, '0', 0, -1776.806, 3005.586, 4.219074, 6.046948, 0.9865284, -0.12115, 0.0268116, 0.106609, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+42, 265542, 1220, 7543, 8590, 1, '0', 0, -1827.549, 2994.354, 0.638816, 5.655841, -0.7689943, 0.3104677, -0.08757305, 0.5518954, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+43, 265542, 1220, 7543, 8590, 1, '0', 0, -1892.847, 3125.399, 4.55938, 4.789401, -0.5676208, 0.6046066, -0.3111658, 0.464148, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+44, 267428, 1220, 7543, 8590, 1, '0', 0, -1929.26, 2945.232, -52.89086, 3.165514, 0, 0, -0.9999285, 0.0119604, 7200, 255, 1, 26365), -- 冒泡的鲍鱼 (Area: -Unknown- - Difficulty: 1)
(@OGUID+45, 265542, 1220, 7543, 8590, 1, '0', 0, -1836.254, 3041.806, 1.371229, 3.603556, -0.1328878, 0.8185863, -0.5174131, 0.2110471, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+46, 265542, 1220, 7543, 8590, 1, '0', 0, -1881.217, 3092.864, 5.831958, 5.90304, 0.975266, -0.1917601, 0.01907825, 0.1082606, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+47, 265542, 1220, 7543, 8590, 1, '0', 0, -1828.325, 3135.947, 6.283218, 2.951528, 0.1340575, 0.8639097, -0.4830265, 0.04872303, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+48, 265542, 1220, 7543, 8590, 1, '0', 0, -1870.884, 3016.767, 3.710441, 0.3759878, 0.9771757, 0.181776, 0.05769253, 0.09357691, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+49, 265542, 1220, 7543, 8590, 1, '0', 0, -1810.177, 3097.066, 4.992649, 3.795937, -0.2317219, 0.8429804, -0.4206476, 0.2423729, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+50, 265542, 1220, 7543, 8590, 1, '0', 0, -1880.806, 3089.711, 5.418179, 2.628017, -0.2563519, -0.9603119, -0.1092911, 0.01184019, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+51, 265542, 1220, 7543, 8590, 1, '0', 0, -1783.986, 2999.392, 3.590076, 1.165229, 0.8321867, 0.5434885, 0.0892334, 0.06421038, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+52, 265542, 1220, 7543, 8590, 1, '0', 0, -1770.788, 3007.841, 4.904708, 6.142138, 0.930584, -0.1115808, 0.1097431, 0.3309376, 7200, 255, 1, 26365), -- Salvaged Spear (Area: -Unknown- - Difficulty: 1)
(@OGUID+53, 241536, 1220, 7543, 8590, 1, '0', 0, -1810.8, 2922.58, 0.1540222, 0.4206357, 0, 0, 0.2087708, 0.9779646, 7200, 255, 1, 26365); -- Moongrass (Area: -Unknown- - Difficulty: 1)
DELETE FROM `gameobject_addon` WHERE `guid` BETWEEN @OGUID+0 AND @OGUID+53;


UPDATE `creature_template_addon` SET `auras`='211762' WHERE `entry`=120934; -- 120934 (邪火小鬼)
UPDATE `creature_template_addon` SET `bytes1`=50331648 WHERE `entry`=120386; -- 120386 (食腐乌鸦)


UPDATE `creature_template` SET `unit_flags`=32784 WHERE `entry`=120933; -- 活性邪焰元素
UPDATE `creature_template` SET `unit_flags`=67141632 WHERE `entry`=115056; -- 邪翼吞噬者

SET NAMES 'utf8';
SET @GROUP_ID=0;
SET @ID=0;
DELETE FROM `creature_text` WHERE (`CreatureID`=108799);
INSERT INTO `creature_text` (`CreatureID`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextId`, `comment`) VALUES
(108799, @GROUP_ID+0, @ID+0, 'You will burn!', 12, 0, 100, 0, 0, 67121, 87913, '黑暗收割祈祷者');

DELETE FROM `creature_text_locale` WHERE (`CreatureID`=108799  AND `locale`='zhCN');
INSERT INTO `creature_text_locale` (`CreatureID`, `GroupID`, `ID`, `locale`, `Text`) VALUES
(108799, @GROUP_ID+0, @ID+0, 'zhCN', '我要烧死你！');




UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=3, `type_flags`=512, `HealthModifier`=1.5, `VerifiedBuild`=26365 WHERE `entry`=120933; -- 活性邪焰元素
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=15, `VerifiedBuild`=26365 WHERE `entry`=119138; -- 守望者新兵
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `rank`=6, `type`=3, `HealthModifier`=0.5, `VerifiedBuild`=26365 WHERE `entry`=120934; -- 邪火小鬼
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=4, `type_flags`=1048576, `VerifiedBuild`=26365 WHERE `entry`=121344; -- 邪能火球
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=3, `HealthModifier`=3, `VerifiedBuild`=26365 WHERE `entry`=120932; -- 燃烧哨兵
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `rank`=2, `type`=3, `type_flags`=2097736, `type_flags2`=65536, `HealthModifier`=45, `movementId`=381, `VerifiedBuild`=26365 WHERE `entry`=118993; -- 恐眼
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=7, `VerifiedBuild`=26365 WHERE `entry`=116533; -- 白银之手保卫者
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=7, `VerifiedBuild`=26365 WHERE `entry`=116534; -- 白银之手保卫者
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=3, `HealthModifier`=1.6, `VerifiedBuild`=26365 WHERE `entry`=116171; -- 魔刃哨兵
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=3, `type_flags`=524288, `HealthModifier`=3,`InhabitType`=4, `VerifiedBuild`=26365 WHERE `entry`=115056; -- 邪翼吞噬者
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=3, `VerifiedBuild`=26365 WHERE `entry`=115054; -- 虫语清道夫
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=8, `HealthModifier`=0.05, `VerifiedBuild`=26365 WHERE `entry`=117754; -- 石化蟹

UPDATE `gameobject_template` SET `data1` = 265552 WHERE `entry` = 265552 AND `type` IN (3, 50);
DELETE FROM `gameobject_loot_template` WHERE `entry` = '265552';
INSERT INTO `gameobject_loot_template` (`entry`, `Item`, `Reference`, `Chance`, `QuestRequired`, `LootMode`, `GroupId`, `MinCount`, `MaxCount`, `Comment`) VALUES
('265552', '142079', '0', '100', '1', '1', '0', '1', '1', 'quest 44748');

UPDATE `gameobject_template` SET `data1` = 265554 WHERE `entry` = 265554 AND `type` IN (3, 50);
DELETE FROM `gameobject_loot_template` WHERE `entry` = '265554';
INSERT INTO `gameobject_loot_template` (`entry`, `Item`, `Reference`, `Chance`, `QuestRequired`, `LootMode`, `GroupId`, `MinCount`, `MaxCount`, `Comment`) VALUES
('265554', '142079', '0', '100', '1', '1', '0', '1', '1', 'quest 44748');

UPDATE `creature_template` SET `lootid` = 115054 WHERE `entry` = 115054 AND `lootid` = 0;
DELETE FROM `creature_loot_template` WHERE `entry` = '115054';
INSERT INTO `creature_loot_template` (`entry`, `Item`, `Reference`, `Chance`, `QuestRequired`, `LootMode`, `GroupId`, `MinCount`, `MaxCount`, `Comment`) VALUES
('115054', '121331', '0', '0.06089805', '0', '1', '0', '1', '1', ''),
('115054', '124437', '0', '10.77161', '0', '1', '0', '1', '3', ''),
('115054', '132199', '0', '21.60585', '0', '1', '0', '1', '1', ''),
('115054', '132200', '0', '3.771792', '0', '1', '0', '1', '1', ''),
('115054', '132204', '0', '74', '0', '1', '0', '1', '1', ''),
('115054', '137677', '0', '0.07752624', '1', '1', '0', '1', '1', ''),
('115054', '138781', '0', '0.2375456', '0', '1', '0', '1', '1', ''),
('115054', '138782', '0', '0.05161218', '0', '1', '0', '1', '1', ''),
('115054', '138817', '0', '0.05312383', '0', '1', '0', '1', '1', ''),
('115054', '138991', '0', '0.06370541', '1', '1', '0', '1', '1', ''),
('115054', '140220', '0', '0.04340606', '0', '1', '0', '1', '1', ''),
('115054', '140221', '0', '0.07666244', '0', '1', '0', '1', '1', ''),
('115054', '140222', '0', '0.1757837', '0', '1', '0', '1', '1', ''),
('115054', '140224', '0', '0.008853972', '0', '1', '0', '1', '1', ''),
('115054', '140225', '0', '0.08616427', '0', '1', '0', '1', '1', ''),
('115054', '140226', '0', '0.03822324', '0', '1', '0', '1', '1', ''),
('115054', '140227', '0', '0.3671159', '0', '1', '0', '1', '1', ''),
('115054', '142079', '0', '24.89651', '1', '1', '0', '1', '1', 'quest 44748'),
('115054', '144330', '0', '0.05549929', '0', '1', '0', '1', '1', ''),
('115054', '144345', '0', '0.08141335', '0', '1', '0', '1', '1', ''),
('115054', '146684', '0', '0.196299', '1', '1', '0', '1', '1', ''),
('115054', '146692', '0', '0.08853972', '1', '1', '0', '1', '1', ''),
('115054', '146700', '0', '0.02332266', '1', '1', '0', '1', '1', ''),
('115054', '146708', '0', '0.3943257', '1', '1', '0', '1', '1', ''),
('115054', '147212', '0', '0.02720977', '0', '1', '0', '1', '1', ''),
('115054', '147213', '0', '0.01036563', '0', '1', '0', '1', '1', ''),
('115054', '147214', '0', '0.03779135', '0', '1', '0', '1', '1', ''),
('115054', '147215', '0', '0.04707722', '0', '1', '0', '1', '1', ''),
('115054', '147216', '0', '0.01360488', '0', '1', '0', '1', '1', ''),
('115054', '147217', '0', '0.02397051', '0', '1', '0', '1', '1', ''),
('115054', '147218', '0', '0.01468464', '0', '1', '0', '1', '1', ''),
('115054', '147219', '0', '0.03239258', '0', '1', '0', '1', '1', ''),
('115054', '147220', '0', '0.009717775', '0', '1', '0', '1', '1', ''),
('115054', '147221', '0', '0.01749199', '0', '1', '0', '1', '1', ''),
('115054', '147222', '0', '0.01122943', '0', '1', '0', '1', '1', ''),
('115054', '147223', '0', '0.01511654', '0', '1', '0', '1', '1', ''),
('115054', '147430', '0', '0.1716807', '1', '1', '0', '1', '1', ''),
('115054', '147729', '0', '0.07731029', '0', '1', '0', '1', '1', ''),
('115054', '153202', '0', '0.009069922', '0', '1', '0', '1', '1', '');

UPDATE `creature_template` SET `lootid` = 115056 WHERE `entry` = 115056 AND `lootid` = 0;
DELETE FROM `creature_loot_template` WHERE `entry` = '115056';
INSERT INTO `creature_loot_template` (`entry`, `Item`, `Reference`, `Chance`, `QuestRequired`, `LootMode`, `GroupId`, `MinCount`, `MaxCount`, `Comment`) VALUES
('115056', '121331', '0', '0.1430215', '0', '1', '0', '1', '1', ''),
('115056', '124113', '0', '0.05264071', '0', '1', '0', '1', '1', ''),
('115056', '124438', '0', '0.01367926', '0', '1', '0', '3', '8', ''),
('115056', '124439', '0', '0.004641176', '0', '1', '0', '3', '8', ''),
('115056', '132197', '0', '5.363734', '0', '1', '0', '1', '1', ''),
('115056', '132199', '0', '17.84337', '0', '1', '0', '1', '1', ''),
('115056', '132231', '0', '76.71999', '0', '1', '0', '1', '1', ''),
('115056', '132749', '0', '0.003419814', '1', '1', '0', '1', '1', ''),
('115056', '137677', '0', '0.09697615', '1', '1', '0', '1', '1', ''),
('115056', '138781', '0', '0.2667455', '0', '1', '0', '1', '1', ''),
('115056', '138782', '0', '0.02039675', '0', '1', '0', '1', '1', ''),
('115056', '138817', '0', '0.04433544', '0', '1', '0', '1', '1', ''),
('115056', '138991', '0', '0.05862538', '1', '1', '0', '1', '1', ''),
('115056', '140220', '0', '0.0593582', '0', '1', '0', '1', '1', ''),
('115056', '140221', '0', '0.1218919', '0', '1', '0', '1', '1', ''),
('115056', '140222', '0', '0.2115399', '0', '1', '0', '1', '1', ''),
('115056', '140224', '0', '0.01367926', '0', '1', '0', '1', '1', ''),
('115056', '140225', '0', '0.01245789', '0', '1', '0', '1', '1', ''),
('115056', '140226', '0', '0.03725154', '0', '1', '0', '1', '1', ''),
('115056', '140227', '0', '0.3356303', '0', '1', '0', '1', '1', ''),
('115056', '141035', '0', '0.004885449', '0', '1', '0', '1', '1', ''),
('115056', '144330', '0', '0.1872348', '0', '1', '0', '1', '1', ''),
('115056', '144345', '0', '0.06021315', '0', '1', '0', '1', '1', ''),
('115056', '147212', '0', '0.1553573', '0', '1', '0', '1', '1', ''),
('115056', '147213', '0', '0.08867089', '0', '1', '0', '1', '1', ''),
('115056', '147214', '0', '0.01575557', '0', '1', '0', '1', '1', ''),
('115056', '147215', '0', '0.04763312', '0', '1', '0', '1', '1', ''),
('115056', '147216', '0', '0.01612198', '0', '1', '0', '1', '1', ''),
('115056', '147217', '0', '0.1118768', '0', '1', '0', '1', '1', ''),
('115056', '147218', '0', '0.04531254', '0', '1', '0', '1', '1', ''),
('115056', '147219', '0', '0.0411599', '0', '1', '0', '1', '1', ''),
('115056', '147220', '0', '0.05752616', '0', '1', '0', '1', '1', ''),
('115056', '147221', '0', '0.1027166', '0', '1', '0', '1', '1', ''),
('115056', '147222', '0', '0.04213699', '0', '1', '0', '1', '1', ''),
('115056', '147223', '0', '0.05642693', '0', '1', '0', '1', '1', ''),
('115056', '147430', '0', '0.1343498', '1', '1', '0', '1', '1', ''),
('115056', '147729', '0', '0.2255856', '0', '1', '0', '1', '1', ''),
('115056', '153202', '0', '0.005618266', '0', '1', '0', '1', '1', ''),
('115056', '153248', '0', '0.0070839', '0', '1', '0', '1', '1', '');

UPDATE `creature_template` SET `lootid` = 100048 WHERE `entry` = 100048 AND `lootid` = 0;
DELETE FROM `creature_loot_template` WHERE `entry` = '100048';
INSERT INTO `creature_loot_template` (`entry`, `Item`, `Reference`, `Chance`, `QuestRequired`, `LootMode`, `GroupId`, `MinCount`, `MaxCount`, `Comment`) VALUES
('100048', '121331', '0', '0.09415588', '0', '1', '0', '1', '1', ''),
('100048', '124437', '0', '11.66425', '0', '1', '0', '1', '3', ''),
('100048', '132199', '0', '21.2063', '0', '1', '0', '1', '1', ''),
('100048', '132200', '0', '5.407501', '0', '1', '0', '1', '1', ''),
('100048', '132204', '0', '73.31419', '0', '1', '0', '1', '1', ''),
('100048', '137677', '0', '0.09784826', '1', '1', '0', '1', '1', ''),
('100048', '138781', '0', '0.0886173', '0', '1', '0', '1', '1', ''),
('100048', '138782', '0', '0.05907819', '0', '1', '0', '1', '1', ''),
('100048', '138817', '0', '0.05446271', '0', '1', '0', '1', '1', ''),
('100048', '138991', '0', '0.09692516', '1', '1', '0', '1', '1', ''),
('100048', '140220', '0', '0.05446271', '0', '1', '0', '1', '1', ''),
('100048', '140221', '0', '0.1347721', '0', '1', '0', '1', '1', ''),
('100048', '140222', '0', '0.105233', '0', '1', '0', '1', '1', ''),
('100048', '140225', '0', '0.03692387', '0', '1', '0', '1', '1', ''),
('100048', '140227', '0', '0.123695', '0', '1', '0', '1', '1', ''),
('100048', '144330', '0', '0.03138529', '0', '1', '0', '1', '1', ''),
('100048', '144345', '0', '0.1061561', '0', '1', '0', '1', '1', ''),
('100048', '146684', '0', '0.180927', '1', '1', '0', '1', '1', ''),
('100048', '146692', '0', '0.04153936', '1', '1', '0', '1', '1', ''),
('100048', '146700', '0', '0.03600078', '1', '1', '0', '1', '1', ''),
('100048', '146708', '0', '0.6240134', '1', '1', '0', '1', '1', ''),
('100048', '147212', '0', '0.04246245', '0', '1', '0', '1', '1', ''),
('100048', '147430', '0', '0.4892413', '1', '1', '0', '1', '1', ''),
('100048', '147729', '0', '0.05446271', '0', '1', '0', '1', '1', '');

UPDATE `creature_template` SET `lootid` = 116171 WHERE `entry` = 116171 AND `lootid` = 0;
DELETE FROM `creature_loot_template` WHERE `entry` = '116171';
INSERT INTO `creature_loot_template` (`entry`, `Item`, `Reference`, `Chance`, `QuestRequired`, `LootMode`, `GroupId`, `MinCount`, `MaxCount`, `Comment`) VALUES
('116171', '121331', '0', '0.1042495', '0', '1', '0', '1', '1', ''),
('116171', '124437', '0', '11.44398', '0', '1', '0', '1', '3', ''),
('116171', '132199', '0', '25.59324', '0', '1', '0', '1', '1', ''),
('116171', '132200', '0', '2.387313', '0', '1', '0', '1', '1', ''),
('116171', '132204', '0', '71.83049', '0', '1', '0', '1', '1', ''),
('116171', '137677', '0', '0.05733721', '1', '1', '0', '1', '1', ''),
('116171', '138781', '0', '0.1954678', '0', '1', '0', '1', '1', ''),
('116171', '138782', '0', '0.252805', '0', '1', '0', '1', '1', ''),
('116171', '138817', '0', '0.06254968', '0', '1', '0', '1', '1', ''),
('116171', '138991', '0', '0.1146744', '1', '1', '0', '1', '1', ''),
('116171', '140221', '0', '0.1250994', '0', '1', '0', '1', '1', ''),
('116171', '140222', '0', '0.1459493', '0', '1', '0', '1', '1', ''),
('116171', '140224', '0', '1.492071', '0', '1', '0', '1', '1', ''),
('116171', '140226', '0', '0.04169979', '0', '1', '0', '1', '1', ''),
('116171', '140227', '0', '0.6750153', '0', '1', '0', '1', '1', ''),
('116171', '144330', '0', '0.12119', '0', '1', '0', '1', '1', ''),
('116171', '144345', '0', '0.0351842', '0', '1', '0', '1', '1', ''),
('116171', '146684', '0', '0.6945621', '1', '1', '0', '1', '1', ''),
('116171', '146692', '0', '1', '1', '1', '0', '1', '1', ''),
('116171', '146700', '0', '0.04430602', '1', '1', '0', '1', '1', ''),
('116171', '146708', '0', '0.04039667', '1', '1', '0', '1', '1', ''),
('116171', '147212', '0', '0.08861205', '0', '1', '0', '1', '1', ''),
('116171', '147214', '0', '0.1094619', '0', '1', '0', '1', '1', ''),
('116171', '147218', '0', '0.03909355', '0', '1', '0', '1', '1', ''),
('116171', '147430', '0', '0.3648731', '1', '1', '0', '1', '1', ''),
('116171', '147729', '0', '0.06254968', '0', '1', '0', '1', '1', '');