# TrinityCore - WowPacketParser
# File name: multi
# Detected build: V7_3_5_26124
# Detected locale: zhCN
# Targeted database: Legion
# Parsing date: 03/12/2018 19:15:54


UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=11808;
UPDATE `areatrigger_template` SET `Flags`=2 WHERE `Id`=9482;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=12498;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=11189;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=11393;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=12493;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=12469;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=12401;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=11547;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=10594;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=11808;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=12307;
UPDATE `areatrigger_template` SET `Flags`=5 WHERE `Id`=10003;
UPDATE `areatrigger_template` SET `Data0`=3, `Data1`=3, `VerifiedBuild`=26124 WHERE `Id`=12307;
UPDATE `areatrigger_template` SET `Data0`=5, `Data1`=5, `VerifiedBuild`=26124 WHERE `Id`=12307;
UPDATE `areatrigger_template` SET `Flags`=1028, `VerifiedBuild`=26124 WHERE `Id`=11338;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=11338;
UPDATE `areatrigger_template` SET `Flags`=0, `VerifiedBuild`=26124 WHERE `Id`=11427;
UPDATE `areatrigger_template` SET `Type`=0, `Data0`=4, `Data1`=4, `Data2`=0, `Data3`=0, `Data4`=0, `Data5`=0 WHERE `Id`=6197;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=12506;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=12673;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=12516;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=12516;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=12310;
UPDATE `areatrigger_template` SET `VerifiedBuild`=26124 WHERE `Id`=11022;
UPDATE `areatrigger_template` SET `Data0`=9, `Data1`=9, `VerifiedBuild`=26124 WHERE `Id`=12549;
UPDATE `areatrigger_template` SET `Flags`=2 WHERE `Id`=9397;



DELETE FROM `conversation_actors` WHERE (`ConversationId`=3416 AND `Idx`=1) OR (`ConversationId`=3416 AND `Idx`=0) OR (`ConversationId`=3273 AND `Idx`=1) OR (`ConversationId`=3273 AND `Idx`=0) OR (`ConversationId`=3618 AND `Idx`=0) OR (`ConversationId`=3417 AND `Idx`=1) OR (`ConversationId`=3417 AND `Idx`=0) OR (`ConversationId`=3417 AND `Idx`=2) OR (`ConversationId`=3617 AND `Idx`=0) OR (`ConversationId`=3626 AND `Idx`=0) OR (`ConversationId`=3602 AND `Idx`=0) OR (`ConversationId`=3601 AND `Idx`=0) OR (`ConversationId`=3608 AND `Idx`=0) OR (`ConversationId`=3408 AND `Idx`=1) OR (`ConversationId`=3408 AND `Idx`=0) OR (`ConversationId`=3609 AND `Idx`=0) OR (`ConversationId`=3797 AND `Idx`=0) OR (`ConversationId`=3620 AND `Idx`=0);
INSERT INTO `conversation_actors` (`ConversationId`, `ConversationActorId`, `Idx`, `VerifiedBuild`) VALUES
(3416, 3494144, 1, 26124),
(3416, 1829328, 0, 26124),
(3273, 7272448, 1, 26124),
(3273, 1628961, 0, 26124),
(3618, 55299, 0, 26124),
(3417, 3494144, 1, 26124),
(3417, 1829328, 0, 26124),
(3417, 6696704, 2, 26124),
(3617, 55299, 0, 26124),
(3626, 55299, 0, 26124),
(3602, 55299, 0, 26124),
(3601, 55299, 0, 26124),
(3608, 55299, 0, 26124),
(3408, 1829328, 1, 26124),
(3408, 1829328, 0, 26124),
(3609, 55299, 0, 26124),
(3797, 1628828, 0, 26124),
(3620, 55299, 0, 26124);


DELETE FROM `conversation_actor_template` WHERE `Id`=55299;
INSERT INTO `conversation_actor_template` (`Id`, `CreatureId`, `CreatureModelId`, `VerifiedBuild`) VALUES
(55299, 106482, 70004, 26124);


DELETE FROM `conversation_line_template` WHERE `Id` IN (7162, 7161, 8107, 8106, 7169, 7168, 7167, 7166, 7165, 7164, 7163, 8105, 8104, 8124, 8070, 8069, 8081, 8080, 7138, 7137, 8083, 8082, 8112, 8111, 8110);
INSERT INTO `conversation_line_template` (`Id`, `StartTime`, `UiCameraID`, `ActorIdx`, `Flags`, `VerifiedBuild`) VALUES
(7162, 5682, 2931214560, 1, 0, 26124),
(7161, 0, 2931214560, 0, 0, 26124),
(8107, 14478, 98, 0, 0, 26124),
(8106, 0, 98, 0, 0, 26124),
(7169, 39531, 716869900, 1, 0, 26124),
(7168, 34430, 716869900, 0, 0, 26124),
(7167, 22769, 716869900, 2, 0, 26124),
(7166, 17636, 716869900, 0, 0, 26124),
(7165, 14103, 716869900, 2, 0, 26124),
(7164, 9777, 716869900, 1, 0, 26124),
(7163, 0, 716869900, 0, 0, 26124),
(8105, 10024, 98, 0, 18758, 26124),
(8104, 0, 98, 0, 0, 26124),
(8124, 0, 98, 0, 0, 26124),
(8070, 0, 98, 0, 0, 26124),
(8069, 0, 98, 0, 0, 26124),
(8081, 8973, 98, 0, 0, 26124),
(8080, 0, 98, 0, 0, 26124),
(7138, 5681, 2931213200, 1, 0, 26124),
(7137, 0, 2931213200, 0, 0, 26124),
(8083, 14498, 98, 0, 8241, 26124),
(8082, 0, 98, 0, 0, 26124),
(8112, 17807, 98, 0, 0, 26124),
(8111, 6167, 98, 0, 8241, 26124),
(8110, 0, 98, 0, 0, 26124);

UPDATE `conversation_line_template` SET `StartTime`=6815, `VerifiedBuild`=26124 WHERE `Id`=6908;
UPDATE `conversation_line_template` SET `VerifiedBuild`=26124 WHERE `Id`=6907;
UPDATE `conversation_line_template` SET `StartTime`=6815, `VerifiedBuild`=26124 WHERE `Id`=6908;
UPDATE `conversation_line_template` SET `VerifiedBuild`=26124 WHERE `Id`=6907;
UPDATE `conversation_line_template` SET `StartTime`=34148, `UiCameraID`=2985740640, `VerifiedBuild`=26124 WHERE `Id`=8457;
UPDATE `conversation_line_template` SET `StartTime`=21335, `UiCameraID`=2985740640, `VerifiedBuild`=26124 WHERE `Id`=8456;


DELETE FROM `conversation_template` WHERE `Id` IN (3618, 3617, 3626, 3602, 3601, 3417, 3408, 3416, 3620, 3609, 3608);
INSERT INTO `conversation_template` (`Id`, `FirstLineID`, `LastLineEndTime`, `VerifiedBuild`) VALUES
(3618, 8106, 27572, 26124),
(3617, 8104, 25869, 26124),
(3626, 8124, 11490, 26124),
(3602, 8070, 15653, 26124),
(3601, 8069, 11458, 26124),
(3417, 7163, 43271, 26124),
(3408, 7137, 11083, 26124),
(3416, 7161, 9931, 26124),
(3620, 8110, 28033, 26124),
(3609, 8082, 18458, 26124),
(3608, 8080, 18981, 26124);

UPDATE `conversation_template` SET `LastLineEndTime`=49654 WHERE `Id`=3797;
UPDATE `conversation_template` SET `LastLineEndTime`=9677 WHERE `Id`=3273;
UPDATE `conversation_template` SET `LastLineEndTime`=9677 WHERE `Id`=3273;

DELETE FROM `gameobject_template_addon` WHERE `entry` IN (248849 /*根须墙*/, 248848 /*占位符*/, 248850 /*根须墙*/, 251555 /*伊格诺斯之眼力场*/, 251997 /*传送门*/, 255000 /*扭曲根须*/, 251995 /*传送门*/, 254168 /*梦魇战利品*/, 252003 /*传送门*/, 252006 /*传送门*/, 251980 /*梦魇之虹*/, 248929 /*巨龙之藤*/, 248928 /*灰色藤蔓*/, 260552 /*Doodad_7DU_Nightmare_RootWall010*/, 260551 /*Doodad_7DU_Nightmare_RootWall009*/, 260550 /*Doodad_7DU_Nightmare_RootWall008*/, 248925 /*入口藤蔓*/, 248927 /*雷霆崖藤蔓*/, 248926 /*安戈洛藤蔓*/, 251533 /*占位符*/, 251535 /*占位符*/, 251534 /*占位符*/, 251536 /*占位符*/, 254271 /*雷霆崖*/, 254270 /*安戈洛环形山*/, 254273 /*翡翠梦境之路*/, 254272 /*灰熊丘陵*/, 252043 /*门*/, 252042 /*门*/, 252004 /*传送门*/);
INSERT INTO `gameobject_template_addon` (`entry`, `faction`, `flags`) VALUES
(248849, 0, 48), -- 根须墙
(248848, 0, 48), -- 占位符
(248850, 0, 48), -- 根须墙
(251555, 0, 48), -- 伊格诺斯之眼力场
(251997, 0, 32), -- 传送门
(255000, 0, 48), -- 扭曲根须
(251995, 0, 32), -- 传送门
(254168, 94, 16416), -- 梦魇战利品
(252003, 0, 32), -- 传送门
(252006, 0, 32), -- 传送门
(251980, 0, 16), -- 梦魇之虹
(248929, 1375, 32), -- 巨龙之藤
(248928, 1375, 32), -- 灰色藤蔓
(260552, 1375, 32), -- Doodad_7DU_Nightmare_RootWall010
(260551, 114, 32), -- Doodad_7DU_Nightmare_RootWall009
(260550, 1375, 32), -- Doodad_7DU_Nightmare_RootWall008
(248925, 1375, 32), -- 入口藤蔓
(248927, 1375, 32), -- 雷霆崖藤蔓
(248926, 1375, 32), -- 安戈洛藤蔓
(251533, 0, 48), -- 占位符
(251535, 0, 48), -- 占位符
(251534, 0, 48), -- 占位符
(251536, 0, 48), -- 占位符
(254271, 1375, 32), -- 雷霆崖
(254270, 1375, 32), -- 安戈洛环形山
(254273, 114, 32), -- 翡翠梦境之路
(254272, 1375, 32), -- 灰熊丘陵
(252043, 1375, 32), -- 门
(252042, 1375, 32), -- 门
(252004, 0, 32); -- 传送门

UPDATE `gameobject_template_addon` SET `flags`=4 WHERE `entry`=265474; -- 邪能箱
UPDATE `gameobject_template_addon` SET `flags`=2375680 WHERE `entry`=244774; -- 安瑟瑞尔花




/*
SET NAMES 'latin1';
SET @CGUID=1083569; -- 2000
SET @OGUID=216780; -- 400
UPDATE `quest_details` SET `VerifiedBuild`=26124 WHERE `ID`=29451; -- -Unknown-

DELETE FROM `creature` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+1889;
INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
-- (@CGUID+567, 92870, 1520, 8026, 8190, 245760, '0', 0, 0, 0, 548.1551, -12805.23, 16.90839, 5.500551, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辛达苟萨之怒 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+568, 102682, 1520, 8026, 8190, 245760, '0', 0, 0, 0, 626.309, -12835.79, 3.864407, 2.84749, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 莱索恩 (Area: -Unknown- - Difficulty: 17) (Auras: 205283 - -Unknown-)
(@CGUID+569, 111208, 1520, 8026, 8041, 245760, '0', 0, 0, 0, -3270.071, 8365.466, 12.06479, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 虚空残渣 (Area: -Unknown- - Difficulty: 17)
-- (@CGUID+570, 32638, UNKNOWN, 8026, 8190, 245760, '0', 0, 0, 0, 0, 0, 0, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- -Unknown- (Area: -Unknown- - Difficulty: 17) (Auras: 61424 - -Unknown-) - !!! on transport - transport template not found !!!
(@CGUID+571, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11301.5, -12718.97, 493.3111, 6.137208, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+572, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11386.31, -12629.07, 494.0032, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+573, 11822, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11269.65, -12582.07, 534.606, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 月光林地守望者 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+574, 113533, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11381.16, -12806.11, 466.8237, 0.6687708, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 艾林裂隙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+575, 11822, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11224.47, -12594.83, 542.4224, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 月光林地守望者 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+576, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11328.79, -12639.98, 501.7011, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+577, 49844, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11223.21, -12656.91, 535.979, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 丝翅蛾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+578, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11350.33, -12631.73, 483.5507, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+579, 11822, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11232.09, -12690.52, 524.4948, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 月光林地守望者 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+580, 113049, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11162.25, -12556.98, 568.0786, 6.042472, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+581, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11310.52, -12730.82, 478.5088, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+582, 49735, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11175.79, -12595.58, 553.5817, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+583, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11289.82, -12686.07, 498.6578, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+584, 106482, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11220.59, -12617.1, 542.7306, 5.570274, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 玛法里奥·怒风 (Area: -Unknown- - Difficulty: 17) (Auras: 223185 - -Unknown-)
(@CGUID+585, 49735, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11188.9, -12570.2, 544.9171, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+586, 113048, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11209.83, -12735.12, 534.2112, 4.956421, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的鹿 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+587, 113049, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11190.55, -12596.1, 550.0576, 1.816367, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+588, 721, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11171.45, -12600.2, 555.0376, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 兔子 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+589, 49735, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11206.39, -12519.23, 563.5006, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+590, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11340.83, -12638.69, 480.0015, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+591, 112263, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11244, -12665.44, 524.9516, 1.82876, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Druid Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+592, 112260, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11245.08, -12650.38, 526.777, 4.68608, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 恐魂污染者 (Area: -Unknown- - Difficulty: 17) (Auras: 195110 - -Unknown-)
(@CGUID+593, 112261, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11248.75, -12642.71, 526.9299, 4.286773, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 恐魂腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 195110 - -Unknown-)
(@CGUID+594, 113050, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11175.7, -12718.02, 550.0228, 2.407656, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的丝翅蛾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+595, 113048, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11131.04, -12640.42, 579.2302, 1.484248, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的鹿 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+596, 113049, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11232.28, -12525.84, 559.4009, 1.655259, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+597, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11361.27, -12630.76, 485.6013, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+598, 113050, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11260.46, -12686.94, 513.5209, 5.259044, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的丝翅蛾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+599, 112263, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11292.85, -12582, 530.2181, 5.338868, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Druid Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+600, 112260, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11245.85, -12650.85, 526.0253, 5.879334, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 恐魂污染者 (Area: -Unknown- - Difficulty: 17) (Auras: 195110 - -Unknown-)
(@CGUID+601, 112261, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11245.14, -12651.52, 526.3358, 2.290912, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 恐魂腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 195110 - -Unknown-)
(@CGUID+602, 113050, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11255.84, -12571.51, 544.9214, 6.044941, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的丝翅蛾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+603, 113048, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11236.63, -12547.26, 551.5598, 1.226603, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的鹿 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+604, 113049, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11196.25, -12519.79, 571.6449, 3.141593, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+605, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11372.99, -12626.23, 498.6578, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+606, 113520, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11545.42, -12490.42, 728.0602, 5.554263, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 古代灵魂 (Area: -Unknown- - Difficulty: 17) (Auras: 225758 - -Unknown-)
(@CGUID+607, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11295.87, -12701.05, 489.3531, 6.137208, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+608, 113050, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11354.8, -12553.63, 527.6464, 3.532422, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的丝翅蛾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+609, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11309.15, -12650.41, 502.9033, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+610, 11956, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11323.19, -12579.54, 522.5522, 5.868322, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 巨熊之灵 (Area: -Unknown- - Difficulty: 17) (Auras: 17327 - -Unknown-, 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+611, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11321.86, -12734.92, 485.872, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+612, 49735, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11183.58, -12526.33, 576.6127, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+613, 11957, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11200.58, -12650.64, 542.5798, 6.130147, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 巨豹之灵 (Area: -Unknown- - Difficulty: 17) (Auras: 17327 - -Unknown-, 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+614, 113050, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11239.32, -12723.18, 523.9058, 0.01171821, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的丝翅蛾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+615, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11318.29, -12643.83, 506.1948, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+616, 49735, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11209.54, -12591.57, 544.9692, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+617, 113050, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11255.53, -12525.8, 555.1443, 0.5030299, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的丝翅蛾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+618, 113048, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11235.35, -12518.46, 564.301, 5.562058, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的鹿 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+619, 113049, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11166.26, -12583.66, 557.8303, 5.763555, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+620, 49735, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11161.38, -12567.62, 565.2437, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+621, 883, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11218.88, -12671.38, 535.399, 6.1657, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 鹿 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-, 96733 - -Unknown-)
(@CGUID+622, 104636, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11366.03, -12739.22, 487.8647, 2.548181, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 塞纳留斯 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+623, 113050, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11301.83, -12604.21, 522.7221, 1.886385, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的丝翅蛾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+624, 113048, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11279.46, -12572.62, 534.7545, 2.970126, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的鹿 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+625, 113049, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11221.57, -12565.54, 551.6754, 1.745101, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+626, 112263, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11259.75, -12623.23, 527.1385, 3.849692, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Druid Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+627, 112260, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11289.24, -12597.34, 526.9456, 1.998373, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 恐魂污染者 (Area: -Unknown- - Difficulty: 17) (Auras: 195110 - -Unknown-)
(@CGUID+628, 112261, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11283.45, -12573.97, 534.4734, 5.220275, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 恐魂腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 195110 - -Unknown-)
(@CGUID+629, 113050, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11222.67, -12603.11, 545.7836, 6.199751, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的丝翅蛾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+630, 113048, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11368.73, -12528.66, 535.8693, 0.03078737, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的鹿 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+631, 113049, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11224.67, -12553.17, 552.5969, 2.466242, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+632, 113050, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11308.99, -12565.4, 534.3719, 2.284274, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的丝翅蛾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+633, 113048, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11213.4, -12670.43, 537.3397, 0.2305315, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的鹿 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+634, 113049, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11189.43, -12523.96, 573.6013, 0.04025245, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的金蟾 (Area: -Unknown- - Difficulty: 17) (Auras: 224942 - -Unknown-)
(@CGUID+635, 112320, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11261.5, -12619.58, 527.7299, 2.842085, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 纠缠梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: 208288 - -Unknown-)
(@CGUID+636, 112320, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11245.09, -12665.35, 525.0152, 2.805488, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 纠缠梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: 208288 - -Unknown-)
(@CGUID+637, 112320, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11256.62, -12615.43, 529.5605, 2.842085, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 纠缠梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: 208288 - -Unknown-)
(@CGUID+638, 112320, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11251.17, -12667.86, 523.6486, 2.805488, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 纠缠梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: 208288 - -Unknown-)
(@CGUID+639, 112320, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11252.47, -12618.85, 529.9259, 2.842085, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 纠缠梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: 208288 - -Unknown-)
(@CGUID+640, 112320, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11252.03, -12661.91, 524.2959, 2.805488, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 纠缠梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: 208288 - -Unknown-)
(@CGUID+641, 112320, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11256.77, -12619.74, 528.6261, 2.842085, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 纠缠梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: 208288 - -Unknown-)
(@CGUID+642, 112320, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11245.75, -12661.03, 525.0657, 2.805488, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 纠缠梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: 208288 - -Unknown-)
(@CGUID+643, 112320, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11248.91, -12663.67, 524.8335, 2.805488, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 纠缠梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: 208288 - -Unknown-)
(@CGUID+644, 112320, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11255.51, -12623.6, 528.1769, 2.842085, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 纠缠梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: 208288 - -Unknown-)
(@CGUID+645, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11332.97, -12747.68, 487.0833, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+646, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11433.69, -12675.47, 506.8883, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+647, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11414, -12649.72, 485.5281, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+648, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11343.25, -12755.39, 487.0833, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+649, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11426.94, -12670.23, 494.6511, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+650, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11355.12, -12760.05, 487.9925, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+651, 111374, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11366.04, -12712.16, 487.0317, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 萨拉塔斯 (Area: -Unknown- - Difficulty: 17)
(@CGUID+652, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11421.69, -12661.75, 467.206, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+653, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11410.55, -12741.61, 478.1465, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+654, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11365.24, -12762.84, 460.7242, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+655, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11437.44, -12687.77, 498.05, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+656, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11427.86, -12725.86, 497.3374, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+657, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11436.58, -12697.48, 508.75, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+658, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11373.95, -12760.83, 479.5167, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+659, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11416.04, -12736.9, 469.1016, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+660, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11421.74, -12731.82, 467.2188, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+661, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11434.22, -12707.44, 461.1684, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+662, 109249, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11431.77, -12716.57, 461.0816, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 强势梦魇 (Area: -Unknown- - Difficulty: 17) (Auras: )
-- (@CGUID+663, 92870, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11358.22, -12738.61, 496.9395, 1.17555, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 辛达苟萨之怒 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+664, 106898, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11391.16, -12669.98, 487.1887, 4.211618, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的翡翠龙蛋 (Area: -Unknown- - Difficulty: 17) (Auras: 212604 - -Unknown-)
(@CGUID+665, 106427, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11339.53, -12719.25, 487.334, 0.8423653, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇树苗 (Area: -Unknown- - Difficulty: 17) (Auras: 210861 - -Unknown-)
(@CGUID+666, 106895, 1520, 8026, 8092, 245760, '0', 0, 0, 0, 11405.33, -12723.71, 487.2244, 2.237746, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被折磨的幽魂 (Area: -Unknown- - Difficulty: 17) (Auras: 212178 - -Unknown-)


(@CGUID+1102, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1823.354, 1445.099, 431.4407, 0.1317522, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1103, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1832.146, 1367.51, 369.5058, 5.178071, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1104, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1833.247, 1361.557, 369.9185, 5.480655, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1105, 111221, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1844.078, 1375.168, 369.5849, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 萨拉塔斯 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1106, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1836.452, 1367.442, 369.5058, 5.055207, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1107, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1850.988, 1365.646, 369.5058, 3.855613, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1108, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1816.537, 1436.019, 431.6881, 4.943546, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1109, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1826.148, 1356.934, 370.1802, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1110, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1846.378, 1369.103, 369.5058, 0.5877802, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1111, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1822.193, 1447.919, 432.164, 5.368996, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1112, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1871.949, 1371.59, 369.5058, 2.112433, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1113, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1848.049, 1379.597, 370.0779, 2.97559, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1114, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1857.39, 1366.185, 369.5058, 3.471893, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1115, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1820.669, 1447.348, 432.4069, 5.703431, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
-- (@CGUID+1116, 62822, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1807.417, 1423.055, 354.5237, 0.3966045, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- -Unknown- (Area: -Unknown- - Difficulty: 17)
-- (@CGUID+1117, 62821, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1808.734, 1426.778, 354.0188, 5.932487, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- -Unknown- (Area: -Unknown- - Difficulty: 17)
(@CGUID+1118, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1820.168, 1446.164, 432.3438, 6.179906, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1119, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1851.004, 1354.667, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1120, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1857.214, 1353.695, 369.5058, 3.135317, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1121, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1823.679, 1445.207, 431.3386, 5.413689, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1122, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1820.693, 1444.235, 431.9413, 0.1075972, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1123, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1841.418, 1359.52, 369.5058, 5.982894, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1124, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1848.606, 1348.315, 369.5058, 5.808783, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1125, 111535, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1827.38, 1447.875, 431.2662, 5.191414, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- Fog Beast Spawner Stalker (Area: -Unknown- - Difficulty: 17) (Auras: 222115 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1126, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1869.47, 1348.549, 369.8037, 4.900371, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1127, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1846.584, 1337.742, 369.5058, 5.997251, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1128, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1871.637, 1357.871, 369.5058, 1.685331, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1129, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1820.536, 1411.113, 431.574, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1130, 111528, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1887.181, 1438.097, 418.0688, 3.921275, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 死根古树 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-)
(@CGUID+1131, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1874.927, 1367.595, 369.8037, 2.209157, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1132, 111535, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1807.82, 1424.934, 433.3084, 3.946324, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- Fog Beast Spawner Stalker (Area: -Unknown- - Difficulty: 17) (Auras: 222115 - -Unknown-) (possible waypoints or random movement)
-- (@CGUID+1133, 32638, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1808.922, 1426.709, 354.1195, 5.932487, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- -Unknown- (Area: -Unknown- - Difficulty: 17)
-- (@CGUID+1134, 32639, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1807.605, 1422.986, 354.6183, 5.932487, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- -Unknown- (Area: -Unknown- - Difficulty: 17)
(@CGUID+1135, 111354, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1845.021, 1454.809, 429.4262, 2.886564, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-)
(@CGUID+1136, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1847.648, 1334.728, 369.5058, 0.1127548, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1137, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1860.115, 1457.059, 426.618, 3.180312, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1138, 111354, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1802.972, 1454.76, 437.2332, 0.4712858, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 污心腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1139, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1863.736, 1447.7, 424.4965, 5.492575, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1140, 111355, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1854.255, 1456.842, 427.9671, 5.935637, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心拷问者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1141, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1853.995, 1448.974, 426.9198, 1.219027, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1142, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1862.809, 1351.451, 369.5058, 4.279904, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1143, 111535, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1796.401, 1419.744, 435.4384, 4.551991, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- Fog Beast Spawner Stalker (Area: -Unknown- - Difficulty: 17) (Auras: 222115 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1144, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1754.461, 1465.96, 441.3563, 5.915639, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1145, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1878.97, 1331.707, 369.8037, 5.38281, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1146, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1889.16, 1354.355, 369.5058, 3.830174, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1147, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1879.258, 1345.492, 369.5058, 1.75916, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1148, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1754.233, 1466, 441.4551, 5.80572, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1149, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1754.22, 1470.436, 442.8545, 6.001748, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1150, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1826.201, 1459.931, 434.1348, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1151, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1751.572, 1469.818, 443.2557, 5.956472, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1152, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1896.481, 1434.031, 415.0979, 0.8612939, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1153, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1750.901, 1467.502, 442.6856, 5.922718, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1154, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1886.941, 1344.649, 369.8037, 2.92355, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1155, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1899.645, 1442.249, 416.242, 0.5980375, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1156, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1896.263, 1436.113, 415.6393, 0.6006292, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1157, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1810.868, 1459.615, 436.6425, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1158, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1893.439, 1435.707, 416.2679, 0.9797122, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1159, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1893.207, 1434.201, 415.9446, 0.8451246, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1160, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1746.882, 1436.335, 439.4376, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1161, 111354, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1739.259, 1446.411, 440.3677, 5.396381, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 污心腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1162, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1755.266, 1468.17, 441.826, 6.009219, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1163, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1895.636, 1436.024, 415.7731, 1.404232, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1164, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1810.868, 1459.615, 436.6425, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1165, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1843.529, 1330.304, 369.5058, 0.5265567, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1166, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1751.875, 1465.36, 441.8454, 5.821655, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1167, 111355, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1914.986, 1413.175, 407.6575, 6.011025, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心拷问者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1168, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1894.59, 1433.049, 415.3623, 0.775376, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1169, 111004, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1873.543, 1315.319, 369.5058, 2.608393, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐朽软泥怪 (Area: -Unknown- - Difficulty: 17) (Auras: 220978 - -Unknown-, 220189 - -Unknown-)
(@CGUID+1170, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1915.352, 1419.446, 408.5957, 5.069936, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1171, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1734.481, 1455.002, 441.9596, 6.054873, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1172, 111355, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1726.646, 1454.752, 443.1257, 0.4158382, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 污心拷问者 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1173, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1730.264, 1463.752, 444.7323, 4.226765, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1174, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1904.078, 1345.275, 369.5058, 0.4408445, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1175, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1863.512, 1320.145, 369.5058, 4.561471, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1176, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1877.726, 1316.323, 369.8037, 6.157198, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1177, 111535, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1909.714, 1433.427, 412.1189, 2.745139, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- Fog Beast Spawner Stalker (Area: -Unknown- - Difficulty: 17) (Auras: 222115 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1178, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1909.739, 1347.557, 369.5058, 1.540584, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1179, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1829.192, 1304.852, 369.5058, 2.201416, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1180, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1878.458, 1323.955, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1181, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1884.372, 1318.148, 369.5058, 5.289825, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1182, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1920.398, 1417.788, 407.2242, 3.772905, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1183, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1844.92, 1303.837, 369.5058, 5.1086, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1184, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1852.293, 1305.214, 369.5058, 4.624685, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1185, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1899.035, 1330.2, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1186, 111355, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1922.304, 1410.497, 405.6225, 2.797683, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心拷问者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1187, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1901.616, 1340.952, 369.5058, 4.917275, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1188, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1911.484, 1354.851, 369.5058, 5.773961, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1189, 111355, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1718.644, 1459.719, 445.1511, 1.932514, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 污心拷问者 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1190, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1856.189, 1299.156, 369.5058, 2.934082, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1191, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1892.943, 1309.121, 369.5058, 4.639288, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1192, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1903.732, 1317.658, 369.5058, 2.384256, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1193, 111004, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1857.823, 1289.755, 369.5153, 0.06223929, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐朽软泥怪 (Area: -Unknown- - Difficulty: 17) (Auras: 220978 - -Unknown-, 220189 - -Unknown-)
(@CGUID+1194, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1918.797, 1336.938, 369.5058, 1.772137, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1195, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1831.653, 1291.751, 369.5058, 5.377114, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1196, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1855.677, 1291.274, 369.8037, 4.382962, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1197, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1842.573, 1284.957, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1198, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1921.84, 1342.53, 369.5058, 6.108335, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1199, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1932.8, 1407.998, 403.3316, 6.078135, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1200, 111004, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1896.371, 1317.146, 369.5058, 1.030675, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐朽软泥怪 (Area: -Unknown- - Difficulty: 17) (Auras: 220978 - -Unknown-, 220189 - -Unknown-)
(@CGUID+1201, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1912.63, 1319.729, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1202, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1858.378, 1284.95, 369.5058, 4.827562, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1203, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1836.714, 1293.176, 369.5058, 6.036114, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1204, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1715.667, 1467.818, 447.1746, 5.054961, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1205, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1927.46, 1325.25, 369.5058, 5.600975, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1206, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1907.065, 1311.247, 369.5058, 4.45718, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1207, 102672, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1892.227, 1297.517, 369.5849, 2.358792, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 尼珊德拉 (Area: -Unknown- - Difficulty: 17) (Auras: 220189 - -Unknown-)
(@CGUID+1208, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1898.893, 1303.13, 369.5058, 5.797207, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1209, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1957.07, 1389.451, 397.9655, 5.207807, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1210, 111535, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1948.575, 1427.866, 403.751, 5.274538, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- Fog Beast Spawner Stalker (Area: -Unknown- - Difficulty: 17) (Auras: 222115 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1211, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1868.391, 1289.058, 369.5058, 5.410319, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1212, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1934.633, 1331.84, 369.5058, 6.128349, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1213, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1913.366, 1306.694, 369.8037, 5.29119, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1214, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1871.82, 1275.88, 369.5058, 6.251937, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1215, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1894.396, 1286.176, 369.5058, 6.0637, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1216, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1961.817, 1390.069, 397.6125, 5.399714, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1217, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1850.98, 1268.119, 369.5058, 2.46879, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1218, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1958.331, 1390.538, 397.973, 5.30599, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1219, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1903.693, 1292.188, 369.8037, 1.856464, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1220, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1926.045, 1319.339, 369.5058, 4.019173, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1221, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1888.035, 1283.318, 369.5058, 3.334534, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1222, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1904.133, 1298.124, 369.5058, 3.748363, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1223, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1963.503, 1386.261, 396.9066, 5.347638, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1224, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1867.266, 1281.678, 369.5058, 1.925543, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1225, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1957.977, 1387.381, 397.5783, 5.240121, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1226, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1862.971, 1277.051, 369.5058, 5.946187, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1227, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1919.689, 1304.618, 369.8037, 0.9458573, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1228, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1961.617, 1385.686, 396.9752, 5.257878, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1229, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1967.197, 1382.116, 396.0298, 5.957419, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1230, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1925.694, 1298.839, 369.96, 3.969781, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1231, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1883.358, 1271.175, 369.5849, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1232, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1877.265, 1265.999, 369.5058, 5.832468, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1233, 111535, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1962.631, 1409.565, 400.6185, 5.902343, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Fog Beast Spawner Stalker (Area: -Unknown- - Difficulty: 17) (Auras: 222115 - -Unknown-)
(@CGUID+1234, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1889.351, 1276.259, 369.8037, 3.754173, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1235, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1705.635, 1511.592, 457.39, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1236, 111004, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1916.719, 1298.681, 369.5058, 3.56593, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐朽软泥怪 (Area: -Unknown- - Difficulty: 17) (Auras: 220978 - -Unknown-, 220189 - -Unknown-)
(@CGUID+1237, 111004, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1886.989, 1277.871, 369.5058, 4.151157, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐朽软泥怪 (Area: -Unknown- - Difficulty: 17) (Auras: 220978 - -Unknown-, 220189 - -Unknown-)
(@CGUID+1238, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1871.877, 1268.854, 369.5058, 4.058297, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1239, 111354, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1985.547, 1392.521, 396.2651, 5.826765, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 污心腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1240, 111355, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1951.458, 1294.252, 391.4996, 0.8959343, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心拷问者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1241, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1800.226, 1538.95, 502.382, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1242, 111528, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1990.212, 1352.776, 391.5014, 2.116023, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 死根古树 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-)
(@CGUID+1243, 111354, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1996.84, 1381.214, 393.9272, 2.030297, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-)
(@CGUID+1244, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1897.979, 1268.497, 369.8037, 3.965591, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1245, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1915.365, 1280.99, 369.5058, 0.9621426, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1246, 111355, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1955.911, 1306.438, 391.4996, 5.278434, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心拷问者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1247, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1993.28, 1389.113, 395.2649, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1248, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1798.455, 1557.703, 498.9833, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1249, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1971.747, 1337.233, 391.4997, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124); -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17)

INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
(@CGUID+1250, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1784.451, 1543.879, 491.2439, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1251, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1955.66, 1299.469, 391.4996, 4.031293, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: 220189 - -Unknown-)
(@CGUID+1252, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1822.705, 1501.42, 534.6617, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1253, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1773.483, 1561.457, 487.1157, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1254, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1834.276, 1519.351, 526.5553, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1255, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1771.212, 1541.177, 483.5253, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1256, 111535, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1979.879, 1344.532, 391.4651, 5.444004, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Fog Beast Spawner Stalker (Area: -Unknown- - Difficulty: 17) (Auras: 222115 - -Unknown-)
(@CGUID+1257, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1962.686, 1304.368, 391.4997, 2.824217, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1258, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1815.46, 1520.983, 519.0347, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1259, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1901.141, 1265.186, 369.5058, 2.962784, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1260, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1823.271, 1541.898, 511.6868, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1261, 111528, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1950.599, 1239.528, 391.5001, 3.921275, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 死根古树 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-)
(@CGUID+1262, 106482, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1871.188, 1344.372, 598.0057, 4.987593, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 玛法里奥·怒风 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1263, 113520, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1941.919, 1271.434, 648.8111, 0.5960549, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 古代灵魂 (Area: -Unknown- - Difficulty: 17) (Auras: 225758 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1264, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1856.495, 1339.196, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1265, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1869.786, 1363.481, 369.5849, 3.350113, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1266, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1864.905, 1371.484, 369.7633, 3.350113, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1267, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1928.916, 1306.112, 369.5058, 4.786861, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1268, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1870.03, 1297.071, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1269, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1919.505, 1320.14, 369.5058, 4.429486, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1270, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1860.669, 1306.71, 369.5058, 1.789497, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1271, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1874.167, 1309.657, 369.5058, 5.610916, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1272, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1874.722, 1290.217, 369.8037, 0.07161091, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1273, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1917.745, 1296.5, 369.8037, 0.7208655, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1274, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1887.458, 1313.431, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1275, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1923.389, 1290.651, 369.95, 4.210717, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1276, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1843.882, 1294.769, 369.8037, 4.233522, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1277, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1899.431, 1287.469, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1278, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1854.798, 1313.209, 369.5058, 2.808769, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1279, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1834.659, 1320.021, 369.5058, 5.869534, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1280, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1915.444, 1288.519, 369.8037, 4.329938, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1281, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1882.886, 1278.166, 369.5058, 1.216717, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1282, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1835.566, 1299.131, 369.5058, 5.5157, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1283, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1865.035, 1300.13, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1284, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1846.24, 1318.06, 369.5058, 3.54581, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1285, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1901.85, 1282.131, 369.5058, 3.093804, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1286, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1909.488, 1292.903, 369.8037, 5.849483, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1287, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1891.18, 1299.297, 369.5058, 4.432178, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1288, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1919.79, 1327.898, 369.8037, 5.543531, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1289, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1858.793, 1334.257, 369.5058, 2.531558, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1290, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1916.714, 1313.675, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1291, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1894.954, 1282.189, 369.5058, 1.372578, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1292, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1842.911, 1373.936, 369.5849, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1293, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1882.668, 1365.656, 369.8037, 5.849483, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1294, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1912.105, 1268.064, 369.5058, 5.422548, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1295, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1862.214, 1345.755, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1296, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1863.278, 1364.042, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1297, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1853.634, 1283.854, 369.8037, 2.01596, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1298, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1866.066, 1331.925, 369.8037, 4.222933, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1299, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1881.546, 1290.523, 369.5058, 5.374682, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1300, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1897.627, 1294.516, 369.5058, 4.588302, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1301, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1848.893, 1312.294, 369.5058, 1.288932, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1302, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1841.212, 1322.227, 370.0233, 5.778304, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1303, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1905.23, 1325.011, 369.5058, 5.385299, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1304, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1884.42, 1298.688, 369.5058, 2.501559, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1305, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1916.835, 1346.083, 369.5849, 2.465329, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1306, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1865.039, 1269.391, 369.5058, 4.908674, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1307, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1893.85, 1292.573, 369.5058, 6.140905, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1308, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1842.25, 1307.931, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1309, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1844.523, 1273.041, 369.5058, 2.247509, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1310, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1854.677, 1330.065, 369.5058, 5.103307, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1311, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1907.236, 1353.225, 369.5058, 6.252183, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1312, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1881.129, 1309.219, 369.5058, 5.096517, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1313, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1887.322, 1305.704, 369.5058, 1.593084, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1314, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1858.424, 1268.804, 369.5058, 5.376566, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1315, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1867.912, 1306.664, 369.5058, 1.599465, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1316, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1840.453, 1288.263, 369.5058, 5.345534, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1317, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1920.347, 1351.486, 369.8423, 2.160364, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1318, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1840.689, 1301.678, 369.5058, 0.8579044, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1319, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1907.97, 1285.613, 369.8037, 0.8940318, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1320, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1932.707, 1314.45, 369.9585, 4.096579, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1321, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1876.661, 1376.557, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1322, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1849.686, 1341.486, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1323, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1913.603, 1274.831, 369.5058, 0.5959978, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1324, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1906.215, 1270.106, 369.8037, 0.8221166, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1325, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1882.585, 1379.431, 369.8037, 1.808127, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1326, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1850.823, 1376.127, 369.5849, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1327, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1835.005, 1376.102, 370.8189, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1328, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1837.953, 1380.017, 369.8918, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1329, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1865.299, 1339.075, 369.8037, 1.532334, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1330, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1833.988, 1345.519, 370.5764, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1331, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1880.635, 1283.244, 369.5058, 4.746522, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1332, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1853.9, 1319.274, 369.5058, 3.343481, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1333, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1909.951, 1298.289, 369.5058, 3.990123, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1334, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1889.255, 1339.439, 369.8037, 2.329065, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1335, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1865.434, 1323.863, 369.5058, 4.663693, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1336, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1872.63, 1328.352, 369.8037, 5.431541, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1337, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1846.368, 1281.651, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1338, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1831.798, 1287.128, 369.5058, 3.588956, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1339, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1905.944, 1332.354, 369.8037, 6.279105, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1340, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1905.268, 1304.621, 369.5058, 4.102924, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1341, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1835.378, 1305.001, 369.5058, 5.003269, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1342, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1883.945, 1350.562, 369.5058, 3.588742, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1343, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1923.92, 1312.679, 369.8037, 2.861897, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1344, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1899.394, 1275.498, 369.5058, 2.208896, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1345, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1827.931, 1299.209, 369.5058, 5.16521, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1346, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1885.607, 1358.657, 369.5058, 3.526237, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1347, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1881.031, 1338.552, 369.8037, 1.235428, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1348, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1858.26, 1324.894, 369.5058, 4.9207, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1349, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1873.56, 1342.151, 369.5058, 6.279606, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1350, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1873.903, 1303.722, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1351, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1927.561, 1346.115, 369.5058, 6.279068, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1352, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1896.872, 1315.624, 369.5058, 0.05570611, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1353, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1841.953, 1345.714, 369.9219, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1354, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1857.55, 1373.149, 369.5849, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1355, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1849.146, 1361.708, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1356, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1835.87, 1354.819, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1357, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1835.464, 1326.783, 370.8009, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1358, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1877.351, 1351.042, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1359, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1881.418, 1357.243, 369.8037, 5.849483, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1360, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1836.281, 1333.439, 370.8318, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1361, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1900.693, 1310.436, 369.8037, 4.800632, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1362, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1890.705, 1319.898, 369.5058, 5.368058, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1363, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1909.31, 1340.063, 369.5058, 1.453418, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1364, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1850.884, 1296.639, 369.8037, 2.550112, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1365, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1928.884, 1340.533, 369.5058, 2.096749, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1366, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1848.124, 1289.744, 369.5058, 2.624397, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1367, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1884.988, 1326.372, 369.8037, 5.084334, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1368, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1877.996, 1296.745, 369.5058, 6.119954, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1369, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1869.413, 1315.474, 369.8037, 5.718964, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1370, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1834.73, 1282.117, 369.5058, 6.199847, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1371, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1893.658, 1346.3, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1372, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1924.697, 1334.998, 369.5058, 3.715675, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1373, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1906.813, 1278.704, 369.5058, 1.163233, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1374, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1872.903, 1281.236, 369.5058, 3.320292, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1375, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1841.354, 1276.804, 369.8919, 1.675589, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1376, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1893.526, 1334.139, 369.8037, 0.1642661, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1377, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1854.872, 1273.119, 369.5058, 2.568274, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1378, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1897.226, 1338.661, 369.5058, 5.243203, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1379, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1848.792, 1276.984, 369.5058, 2.687441, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1380, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1892.73, 1327.901, 369.5058, 4.261236, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1381, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1873.565, 1337.439, 369.5058, 1.233901, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1382, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1891.34, 1270.274, 369.8037, 3.287158, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1383, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1836.385, 1340.276, 370.7581, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1384, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1843.059, 1352.915, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1385, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1857.623, 1358.951, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1386, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1877.328, 1360.932, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1387, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1855.854, 1346.396, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1388, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1829.142, 1350.655, 370.4399, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1389, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1849.194, 1325.129, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1390, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1880.839, 1372.274, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1391, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1826.556, 1364.142, 371.383, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1392, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1864.453, 1356.738, 369.8037, 3.981254, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1393, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1838.848, 1313.237, 369.5058, 0.08564196, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1394, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1896.63, 1323.285, 369.8037, 4.847903, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1395, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1862.161, 1293.507, 369.8037, 3.246567, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1396, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1994.985, 1318.196, 391.5058, 0.8379433, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1397, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1994.296, 1316.237, 391.5058, 0.9459955, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1398, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1913.811, 1332.455, 369.5849, 5.976618, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1399, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1999.087, 1324.552, 391.5058, 1.59437, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1400, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1882.128, 1303.761, 369.5058, 4.173485, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1401, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1897.314, 1352.888, 369.5058, 2.565758, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1402, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1994.658, 1319.269, 391.5058, 0.8967671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1403, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1914.389, 1340.38, 369.5849, 0.1783292, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1404, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1831.64, 1313.555, 369.9134, 5.658935, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1405, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1887.144, 1290.264, 369.8037, 4.840919, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1406, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1995.855, 1314.944, 391.5058, 0.9453639, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1407, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1886.098, 1334.539, 369.5058, 1.888946, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1408, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1912.746, 1326.961, 369.5058, 1.134016, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1409, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1862.906, 1312.569, 369.8037, 2.059482, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1410, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1993.002, 1314.321, 391.5058, 1.052257, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1411, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1872.135, 1321.094, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1412, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1922.13, 1282.396, 369.8438, 2.744017, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1413, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1855.958, 1279.513, 369.5058, 3.477075, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1414, 113113, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1994.409, 1315.007, 391.5058, 1.020541, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇精华 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1415, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1876.885, 1274.98, 369.5058, 1.777033, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1416, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1935.857, 1322.191, 369.5058, 5.433249, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1417, 111535, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1982.545, 1281.858, 391.4819, 0.5130492, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Fog Beast Spawner Stalker (Area: -Unknown- - Difficulty: 17) (Auras: 222115 - -Unknown-)
(@CGUID+1418, 111535, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1944.262, 1246.135, 391.4162, 3.551723, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Fog Beast Spawner Stalker (Area: -Unknown- - Difficulty: 17) (Auras: 222115 - -Unknown-)
(@CGUID+1419, 111354, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 2003.656, 1318.365, 391.5013, 5.050732, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-)
(@CGUID+1420, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1916.04, 1225.286, 390.6955, 1.732571, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1421, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 2021.486, 1310.934, 391.4996, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1422, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1936.858, 1218.12, 391.6076, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1423, 111354, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1982.46, 1268.599, 391.5004, 5.071206, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-)
(@CGUID+1424, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1986.705, 1257.625, 391.5, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1425, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1925.148, 1215.988, 391.9325, 5.960646, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1426, 111354, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1942.509, 1221.488, 391.5006, 3.7994, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-)
(@CGUID+1427, 111355, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1913.49, 1221.507, 391.1349, 1.587296, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心拷问者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1428, 111355, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1930.222, 1214.599, 391.955, 2.8914, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心拷问者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1429, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 2030.389, 1336.981, 391.5563, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1430, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1955.616, 1291.406, 391.4995, 4.643345, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1431, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1975.347, 1243.995, 391.5011, 5.168855, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1432, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 2006.637, 1309.858, 391.5013, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1433, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1918.92, 1224.342, 390.8856, 1.802808, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: 220189 - -Unknown-)
(@CGUID+1434, 111355, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1978.752, 1240.436, 391.5016, 4.391056, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心拷问者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1435, 111354, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1980.884, 1248.866, 391.5008, 0.9160576, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心腐蚀者 (Area: -Unknown- - Difficulty: 17) (Auras: 8279 - -Unknown-)
(@CGUID+1436, 111333, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1972.321, 1233.694, 391.5017, 0.5385828, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心欺诈者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1437, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1992.845, 1242.507, 391.1701, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1438, 111355, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1977.852, 1235.13, 391.502, 1.529918, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 污心拷问者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1439, 102930, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1878.178, 1342.251, 369.5851, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Breath Stalker (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1440, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1843.845, 1367.415, 369.8037, 4.449775, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1441, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1860.201, 1285.375, 369.8037, 6.139786, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1442, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1912.63, 1319.729, 369.8037, 4.123195, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1443, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1901.932, 1338.024, 369.8037, 1.236164, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1444, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1877.726, 1316.323, 369.8037, 5.140408, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1445, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1850.613, 1276.095, 369.8037, 2.695907, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1446, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1845.873, 1271.359, 369.914, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1447, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1834.123, 1300.523, 369.8037, 5.307792, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1448, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1829.889, 1294.002, 369.9467, 5.508425, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1449, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1855.868, 1319.677, 369.8037, 5.178638, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1450, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1892.979, 1309.609, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1451, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1870.03, 1297.071, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1452, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1924.745, 1333.901, 369.5849, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1453, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1894.559, 1280.224, 369.8037, 3.477404, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1454, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1891.715, 1292.879, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1455, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1834.267, 1320.193, 370.7612, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1456, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1880.601, 1284.245, 369.8037, 5.926648, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1457, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1893.526, 1334.139, 369.8037, 6.002367, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1458, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1915.009, 1280.733, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1459, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1849.146, 1361.708, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1460, 111412, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 2052.248, 1389.566, 395.4434, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Satyr Channel Cosmetic Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1461, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1887.227, 1282.571, 369.8037, 2.718695, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1462, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1873.903, 1303.722, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1463, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1876.661, 1376.557, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1464, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1859.486, 1267.405, 370.0468, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1465, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1857.623, 1358.951, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1466, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1873.431, 1310.243, 369.8037, 3.350113, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1467, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1863.056, 1275.91, 369.8037, 0.1797096, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1468, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1886.12, 1297.422, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1469, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1904.951, 1298.693, 369.8037, 4.077594, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1470, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1842.911, 1373.936, 369.5849, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1471, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1837.288, 1295.082, 369.8037, 3.378272, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1472, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1871.87, 1355.847, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1473, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1896.201, 1340.406, 369.8037, 5.185566, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1474, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1849.194, 1325.129, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1475, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1859.609, 1333.686, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1476, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1841.953, 1345.714, 369.9219, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1477, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1843.656, 1338.602, 369.944, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1478, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1916.714, 1313.675, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1479, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1857.536, 1365.943, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1480, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1886.911, 1306.354, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1481, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1843.059, 1352.915, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1482, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1920.347, 1351.486, 369.8423, 5.375928, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1483, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1848.938, 1348.642, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1484, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1874.894, 1281.595, 369.5849, 3.350113, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1485, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1906.092, 1353.26, 369.5849, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1486, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1841.436, 1360.629, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1487, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1903.172, 1344.847, 369.8037, 5.375928, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1488, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1922.03, 1341.059, 369.5849, 0.7172686, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1489, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1902.422, 1265.703, 369.5849, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1490, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1911.28, 1299.797, 369.8037, 0.7158598, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1491, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1855.677, 1291.274, 369.8037, 4.382962, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1492, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1870.047, 1275.936, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1493, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1904.601, 1325.8, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1494, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1856.91, 1278.594, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1495, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1903.693, 1292.188, 369.8037, 1.856464, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1496, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1899.431, 1287.469, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1497, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1867.113, 1282.813, 369.8037, 0.1797096, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1498, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1862.592, 1319.01, 369.8037, 4.323256, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1499, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1862.906, 1312.569, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124); -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)

INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
(@CGUID+1500, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1880.7, 1310.28, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1501, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1839.941, 1300.813, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1502, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1836.281, 1333.439, 370.8318, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1503, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1849.004, 1289.243, 369.8037, 3.378272, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1504, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1862.214, 1345.755, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1505, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1866.066, 1331.925, 369.8037, 3.982305, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1506, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1889.255, 1339.439, 369.8037, 2.58062, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1507, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1896.63, 1323.285, 369.8037, 3.600093, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1508, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1853.634, 1283.854, 369.8037, 0.6463534, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1509, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1835.005, 1376.102, 370.8189, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1510, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1851.764, 1267.495, 369.9876, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1511, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1912.323, 1326.056, 369.8037, 1.273544, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1512, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1833.988, 1345.519, 370.5764, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1513, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1870.786, 1268.684, 370.0659, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1514, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1889.351, 1276.259, 369.8037, 3.754173, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1515, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1923.92, 1312.679, 369.8037, 0.1607963, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1516, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1884.988, 1326.372, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1517, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1925.552, 1346.123, 369.7483, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1518, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1841.212, 1322.227, 370.0233, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1519, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1827.559, 1307.153, 370.9604, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1520, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1911.818, 1273.62, 369.8037, 0.7511542, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1521, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1879.448, 1344.497, 369.8037, 2.126622, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1522, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1872.896, 1335.53, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1523, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1867.583, 1307.047, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1524, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1919.783, 1321.097, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1525, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1864.816, 1270.514, 369.9823, 4.424389, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1526, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1922.13, 1282.396, 369.8438, 2.744017, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1527, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1905.776, 1305.349, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1528, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1899.035, 1330.2, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1529, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1835.09, 1305.964, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1530, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1855.266, 1313.047, 369.8037, 2.255409, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1531, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1860.885, 1305.736, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1532, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1880.839, 1372.274, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1533, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1863.278, 1364.042, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1534, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1853.479, 1305.17, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1535, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1899.005, 1351.79, 369.8037, 0.2308369, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1536, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1932.707, 1314.45, 369.9585, 2.183316, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1537, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1851.642, 1367.655, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1538, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1897.979, 1268.497, 369.8037, 0.7511542, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1539, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1935.2, 1322.939, 369.8926, 3.296494, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1540, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1869.413, 1315.474, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1541, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1827.052, 1301.016, 370.4774, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1542, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1923.389, 1290.651, 369.95, 2.517448, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1543, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1826.148, 1356.934, 370.1802, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1544, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1846.146, 1303.403, 369.8037, 1.235432, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1545, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1881.038, 1302.568, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1546, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1896.526, 1316.139, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1547, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1886.54, 1359.035, 369.8037, 1.199596, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1548, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1831.28, 1313.814, 370.8091, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1549, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1929.392, 1339.658, 369.9034, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1550, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1872.556, 1342.155, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1551, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1869.786, 1363.481, 369.5849, 3.350113, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1552, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1842.653, 1329.795, 369.9912, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1553, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1916.835, 1346.083, 369.5849, 0.7172686, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1554, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1893.418, 1286.394, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1555, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1858.613, 1326.115, 369.8037, 2.255409, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1556, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1830.724, 1370.339, 371.5142, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1557, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1878.97, 1331.707, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1558, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1851.004, 1354.667, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1559, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1887.144, 1290.264, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1560, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1836.111, 1368.398, 369.936, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1561, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1848.049, 1379.597, 370.0779, 2.962776, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1562, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1928.858, 1306.887, 370.0046, 4.12848, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1563, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1854.241, 1331.123, 369.8037, 3.840447, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1564, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1839.175, 1313.903, 370.0234, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1565, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1882.54, 1277.231, 369.8037, 0.950156, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1566, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1901.186, 1281.389, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1567, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1872.63, 1328.352, 369.8037, 5.551569, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1568, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1849.686, 1341.486, 369.8037, 2.280106, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1569, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1881.031, 1338.552, 369.8037, 1.622084, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1570, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1850.884, 1296.639, 369.8037, 4.611696, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1571, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1891.892, 1327.882, 369.8037, 1.670439, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1572, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1842.573, 1284.957, 369.8037, 5.190146, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1573, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1865.035, 1300.13, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1574, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1926.686, 1320.109, 369.8037, 3.256984, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1575, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1919.689, 1304.618, 369.8037, 0.9458573, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1576, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1890.089, 1320.7, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1577, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1837.953, 1380.017, 369.8918, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1578, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1891.34, 1270.274, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1579, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1867.828, 1289.729, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1580, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1906.215, 1270.106, 369.8037, 2.517448, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1581, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1856.495, 1339.196, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1582, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1913.811, 1332.455, 369.5849, 6.197451, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1583, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1882.585, 1379.431, 369.8037, 1.808127, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1584, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1913.41, 1354.127, 369.5849, 5.375928, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1585, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1878.458, 1323.955, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1586, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1874.722, 1290.217, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1587, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1865.483, 1324.866, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1588, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1857.55, 1373.149, 369.5849, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1589, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1829.142, 1350.655, 370.4399, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1590, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1913.366, 1306.694, 369.8037, 3.737542, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1591, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1865.299, 1339.075, 369.8037, 1.532334, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1592, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1855.854, 1346.396, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1593, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1915.444, 1288.519, 369.8037, 2.517448, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1594, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1850.823, 1376.127, 369.5849, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1595, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1870.858, 1373.01, 369.8037, 3.751128, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1596, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1927.262, 1326.648, 369.8037, 2.821038, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1597, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1919.79, 1327.898, 369.8037, 6.150631, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1598, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1907.97, 1285.613, 369.8037, 0.7511542, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1599, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1877.351, 1351.042, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1600, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1918.983, 1336.028, 369.5849, 0.7172686, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1601, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1857.747, 1352.304, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1602, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1910.538, 1266.911, 369.5849, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1603, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1877.09, 1274.002, 369.5849, 0.5813468, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1604, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1865.066, 1351.481, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1605, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1906.411, 1277.774, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1606, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1835.87, 1354.819, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1607, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1886.41, 1333.592, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1608, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1891.535, 1353.592, 369.8037, 2.280827, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1609, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1877.328, 1360.932, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1610, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1839.774, 1289.188, 369.8037, 3.378272, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1611, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1891.595, 1300.71, 369.8037, 3.359577, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1612, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1876.998, 1296.91, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1613, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1846.368, 1281.651, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1614, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1857.328, 1298.917, 369.8037, 2.347776, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1615, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1849.828, 1333.918, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1616, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1909.708, 1346.556, 369.5849, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1617, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1847.156, 1318.451, 369.8037, 0.4890075, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1618, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1909.488, 1292.903, 369.8037, 5.849483, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1619, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1899.215, 1275.214, 369.8037, 3.868422, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1620, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1826.556, 1364.142, 371.383, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1621, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1898.521, 1303.326, 369.8037, 1.259065, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1622, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1887.458, 1313.431, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1623, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1833.247, 1361.557, 369.9185, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1624, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1856.573, 1272.021, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1625, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1914.389, 1340.38, 369.5849, 6.197451, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1626, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1917.745, 1296.5, 369.8037, 0.7208655, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1627, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1841.354, 1276.804, 369.8919, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1628, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1903.563, 1318.33, 369.8037, 4.016508, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1629, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1905.944, 1332.354, 369.8037, 3.502384, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1630, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1909.014, 1339.477, 369.5849, 1.497306, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1631, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1900.693, 1310.436, 369.8037, 4.327612, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1632, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1835.464, 1326.783, 370.8009, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1633, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1884.851, 1350.997, 369.8037, 5.491098, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1634, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1836.491, 1281.87, 369.9623, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1635, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1872.135, 1321.094, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1636, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1893.658, 1346.3, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1637, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1874.927, 1367.595, 369.8037, 5.849483, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1638, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1862.161, 1293.507, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1639, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1864.453, 1356.738, 369.8037, 3.981254, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1640, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1883.818, 1318.998, 369.8037, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1641, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1886.941, 1344.649, 369.8037, 2.92355, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1642, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1925.694, 1298.839, 369.96, 5.011698, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1643, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1881.418, 1357.243, 369.8037, 5.849483, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1644, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1864.905, 1371.484, 369.7633, 3.350113, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1645, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1843.882, 1294.769, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1646, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1836.385, 1340.276, 370.7581, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1647, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1933.642, 1331.995, 369.8719, 4.01577, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1648, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1880.925, 1291.319, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1649, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1882.668, 1365.656, 369.8037, 5.849483, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1650, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1848.575, 1311.194, 369.8037, 1.635446, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1651, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1876.352, 1266.441, 369.8606, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1652, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1842.25, 1307.931, 369.8037, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1653, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1897.752, 1295.517, 369.8037, 1.151611, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1654, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1832.703, 1287.563, 369.9419, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1655, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1907.321, 1312.229, 369.8037, 5.178958, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1656, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1869.47, 1348.549, 369.8037, 3.622348, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1657, 102998, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1883.358, 1271.175, 369.5849, 0.6343671, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐化的害虫 (Area: -Unknown- - Difficulty: 17) (Auras: 196285 - -Unknown-)
(@CGUID+1658, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1851.219, 1477.656, 554.028, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1659, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1844.425, 1499.59, 539.881, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1660, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1831.26, 1484.613, 548.5795, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1661, 113203, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1839.127, 1461.273, 564.5984, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 幼龙之怒 (Area: -Unknown- - Difficulty: 17) (Auras: 225324 - -Unknown-)
(@CGUID+1662, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1838.51, 1502.705, 563.1713, 3.583608, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1663, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1861.05, 1473.559, 589.626, 4.973018, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1664, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1813.786, 1498.537, 570.1702, 4.098057, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1665, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1798.056, 1550.634, 541.6788, 3.695366, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1666, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1834.482, 1472.771, 598.4672, 4.265785, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1667, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1843.805, 1526.378, 579.3725, 6.030221, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1668, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1869.345, 1444.197, 617.413, 6.281173, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1669, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1781.351, 1550.471, 541.0408, 0.4793104, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1670, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1814.219, 1555.914, 562.3557, 2.776803, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1671, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1763.496, 1555.548, 523.1027, 0.5654973, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1672, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1794.976, 1529.958, 569.3203, 3.608782, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1673, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1843.187, 1481.63, 608.9248, 1.044947, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1674, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1830.348, 1477.06, 613.4768, 4.908576, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1675, 111567, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1841.502, 1445.752, 624.3356, 1.248292, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇幼龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1676, 113575, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1870.299, 1330.564, 601.2935, 1.895005, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 彩虹 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1677, 113575, 1520, 8026, 8026, 245760, '0', 0, 0, 0, 1871.915, 1322.559, 600.4058, 1.895005, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 彩虹 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1678, 113604, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11358.95, 11178.88, 10.25148, 1.00329, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 艾乐瑞瑟·雷弗拉尔 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1679, 113091, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11247.43, 11082.81, -0.4744453, 4.813612, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 感染的平原陆行鸟 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1680, 113106, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11269.92, 11049.19, 15.54949, 4.799772, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 生病的山狮 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1681, 113103, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11264.45, 11015.17, 48.59206, 6.000045, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 腐化的猛鹫 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1682, 113108, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11251.86, 11037.49, 24.16111, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇兔 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-)
(@CGUID+1683, 113091, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11289.87, 11142.16, -32.25455, 6.197124, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 感染的平原陆行鸟 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1684, 113093, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11286.6, 11082.05, -7.616, 4.375046, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 感染的瞪羚 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1685, 113103, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11267.77, 11062.74, 16.99946, 3.673166, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 腐化的猛鹫 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1686, 113108, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11292.97, 11062.71, 1.034427, 3.74552, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇兔 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1687, 113093, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11215.98, 11114.84, -9.254367, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 感染的瞪羚 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-)
(@CGUID+1688, 113609, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11405.57, 11401.25, -84.33374, 4.618897, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 艾乐瑞瑟·雷弗拉尔 (Area: -Unknown- - Difficulty: 17) (Auras: 221869 - -Unknown-)
(@CGUID+1689, 113108, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11343.74, 11052.3, 9.164311, 2.444305, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇兔 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1690, 113093, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11283.72, 11014.78, 34.66455, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 感染的瞪羚 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-)
(@CGUID+1691, 113103, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11315.89, 11121.84, -7.991978, 4.432117, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 腐化的猛鹫 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1692, 113106, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11219.48, 11082.63, 4.558537, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 生病的山狮 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-)
(@CGUID+1693, 113108, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11302.37, 11109.55, -18.97635, 1.207339, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇兔 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1694, 113091, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11318.18, 11040.51, 13.92924, 2.042086, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 感染的平原陆行鸟 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1695, 113093, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11252.64, 11194.16, -29.80326, 4.9585, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 感染的瞪羚 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1696, 113520, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11742.31, 11517.75, 206.8567, 3.914329, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 古代灵魂 (Area: -Unknown- - Difficulty: 17) (Auras: 225758 - -Unknown-)
(@CGUID+1697, 113091, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11184, 11113.13, -8.846759, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 感染的平原陆行鸟 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-)
(@CGUID+1698, 113108, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11277.09, 11199.13, -53.47104, 2.11628, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇兔 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1699, 113103, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11267.93, 11134.59, -12.73773, 5.09409, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 腐化的猛鹫 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1700, 113091, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11251.78, 11016.02, 34.71265, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 感染的平原陆行鸟 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-)
(@CGUID+1701, 113106, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11261.85, 11097.04, -13.60762, 6.038234, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 生病的山狮 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1702, 113103, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11312.54, 11165.69, -35.04244, 2.55231, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 腐化的猛鹫 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1703, 113108, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11239.73, 11111.75, -10.64041, 6.184242, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 梦魇兔 (Area: -Unknown- - Difficulty: 17) (Auras: 225048 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1704, 111933, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11393.99, 11218.61, -100.0619, 5.518013, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-)
(@CGUID+1705, 111933, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11361.39, 11225.64, -99.74743, 3.877637, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-)
(@CGUID+1706, 106510, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11383.93, 11230.11, -101.7834, 0.6881555, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Flight Loc Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1707, 111933, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11355.58, 11240.7, -99.96526, 3.779868, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-)
(@CGUID+1708, 111933, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11406.56, 11222.3, -99.89276, 2.126848, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-)
(@CGUID+1709, 111933, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11372.58, 11237.44, -99.70802, 4.323269, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-)
(@CGUID+1710, 112039, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11377.27, 11236.97, -99.85159, 4.19788, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 尖叫小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-)
(@CGUID+1711, 111975, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11396.65, 11259.03, -98.38519, 4.35463, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 影羽 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1712, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11461.16, 11230.02, -92.37112, 3.738153, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1713, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11456.07, 11228.26, -93.49833, 4.726341, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1714, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11460.8, 11225.38, -91.39921, 0.1309221, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1715, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11371.71, 11320.16, -97.94533, 2.579887, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1716, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11371.63, 11307.51, -99.78006, 1.900046, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1717, 112078, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11367.77, 11317.74, -98.66963, 0.744361, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 蠕动的卵囊 (Area: -Unknown- - Difficulty: 17) (Auras: 215581 - -Unknown-)
(@CGUID+1718, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11453.47, 11243.43, -97.59705, 2.689895, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1719, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11381.17, 11323.22, -97.77774, 0.9876615, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
-- (@CGUID+1720, 107767, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, 3, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) (Auras: 46598 - -Unknown-) - !!! on transport - transport template not found !!!
-- (@CGUID+1721, 113626, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, -5, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 46598 - -Unknown-, 210229 - -Unknown-) - !!! on transport - transport template not found !!!
(@CGUID+1722, 112078, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11375.86, 11342.35, -134.8346, 3.740242, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 蠕动的卵囊 (Area: -Unknown- - Difficulty: 17) (Auras: 215581 - -Unknown-)
(@CGUID+1723, 111439, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11368.08, 11364.66, -88.46585, 5.327215, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) (Auras: 221869 - -Unknown-, 210792 - -Unknown-)
-- (@CGUID+1724, 107767, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, 6, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) (Auras: 46598 - -Unknown-) - !!! on transport - transport template not found !!!
-- (@CGUID+1725, 107767, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, 3, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) (Auras: 46598 - -Unknown-) - !!! on transport - transport template not found !!!
-- (@CGUID+1726, 107767, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, 3, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) (Auras: 46598 - -Unknown-) - !!! on transport - transport template not found !!!
(@CGUID+1727, 111933, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11522.87, 11275.37, -87.08472, 0.8220224, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-)
(@CGUID+1728, 111933, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11514.57, 11287.46, -87.86613, 3.617323, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-)
-- (@CGUID+1729, 107767, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, 5, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) (Auras: 46598 - -Unknown-) - !!! on transport - transport template not found !!!
-- (@CGUID+1730, 107767, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, 6, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) (Auras: 46598 - -Unknown-) - !!! on transport - transport template not found !!!
-- (@CGUID+1731, 107767, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, 6, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) - !!! on transport - transport template not found !!!
-- (@CGUID+1732, 107767, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, 5, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) - !!! on transport - transport template not found !!!
-- (@CGUID+1733, 107767, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, 4, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) - !!! on transport - transport template not found !!!
(@CGUID+1734, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11525.65, 11243.38, -83.12895, 0.9063579, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1735, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11503.75, 11314.49, -91.74477, 3.308665, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1736, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11535.05, 11237.57, -78.58669, 3.932218, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1737, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11498.35, 11298.54, -90.56091, 0.2761064, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1738, 106510, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11530.34, 11291.86, -87.50114, 2.3668, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Flight Loc Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1739, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11501.89, 11306.27, -89.95432, 1.861119, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1740, 109849, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11533.97, 11288.43, -86.98074, 2.259803, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Nightmare Spawn Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1741, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11491.68, 11327.99, -92.87758, 3.3239, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1742, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11493.73, 11318.83, -89.72164, 2.562719, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1743, 112039, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11540.85, 11288.94, -86.53442, 0.4211531, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 尖叫小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1744, 111933, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11518.58, 11322.15, -90.74825, 5.994691, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-)
-- (@CGUID+1745, 107767, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, 4, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) (Auras: 46598 - -Unknown-) - !!! on transport - transport template not found !!!
-- (@CGUID+1746, 107767, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, 3, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 扭曲之影 (Area: -Unknown- - Difficulty: 17) (Auras: 46598 - -Unknown-) - !!! on transport - transport template not found !!!
(@CGUID+1747, 111933, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11539.08, 11323.23, -87.9502, 4.107985, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-)
(@CGUID+1748, 111933, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11548.64, 11309.57, -86.73672, 6.156408, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-)
(@CGUID+1749, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11427.08, 11417.47, -87.77983, 1.350163, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124); -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)

INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
(@CGUID+1750, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11551.95, 11166.75, -122.9444, 4.669069, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1751, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11397.43, 11433.34, -86.39198, 1.304258, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1752, 112078, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11412.6, 11429.79, -85.85125, 0.7151823, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 蠕动的卵囊 (Area: -Unknown- - Difficulty: 17) (Auras: 215581 - -Unknown-)
(@CGUID+1753, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11514.84, 11343.25, -93.07131, 1.95821, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1754, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11415.62, 11427.03, -86.3543, 2.207303, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1755, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11426.97, 11421.8, -87.46895, 5.473705, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1756, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11524.95, 11342.62, -91.29549, 1.562536, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1757, 112078, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11554.47, 11254.2, -80.89885, 3.674757, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 蠕动的卵囊 (Area: -Unknown- - Difficulty: 17) (Auras: 215581 - -Unknown-)
(@CGUID+1758, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11523.52, 11337.05, -90.44707, 5.986601, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1759, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11388.41, 11422.77, -85.50974, 3.107261, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1760, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11560.66, 11269.95, -84.02898, 1.15526, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1761, 106510, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11411.78, 11408.35, -85.40462, 5.27214, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- Flight Loc Stalker (Area: -Unknown- - Difficulty: 17)
(@CGUID+1762, 111980, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11556.92, 11291.44, -84.95747, 2.852022, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 暗夜蛛母 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1763, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11573.02, 11276.76, -79.84315, 3.932218, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1764, 112078, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11556.26, 11156.44, -122.4317, 6.170538, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 蠕动的卵囊 (Area: -Unknown- - Difficulty: 17) (Auras: 215581 - -Unknown-)
(@CGUID+1765, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11556.87, 11156.7, -122.9171, 0.298992, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1766, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11400.86, 11435.66, -86.00256, 2.350103, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1767, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11580.81, 11285.73, -79.86621, 5.066329, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1768, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11575.44, 11326.29, -85.62497, 6.237844, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1769, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11582.79, 11296.32, -79.14374, 0.8784533, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1770, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11568.64, 11331.99, -84.76928, 4.607918, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1771, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11413.83, 11442.82, -83.6813, 2.158482, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1772, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11420.98, 11439.68, -84.75169, 1.29152, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1773, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11409.25, 11445.28, -79.97234, 1.090847, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1774, 108540, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11403.76, 11443.26, -83.58125, 2.035463, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 脉动的卵囊 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1775, 112078, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11551.41, 11403.62, -117.489, 3.740242, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 蠕动的卵囊 (Area: -Unknown- - Difficulty: 17) (Auras: 215581 - -Unknown-)
-- (@CGUID+1776, 113626, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, -5, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-) - !!! on transport - transport template not found !!!
(@CGUID+1777, 111374, 1520, 8026, 8298, 245760, '0', 0, 0, 0, 11408.77, 11389.7, -85.87389, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 萨拉塔斯 (Area: -Unknown- - Difficulty: 17)
-- (@CGUID+1778, 107459, UNKNOWN, 8026, 8298, 245760, '0', 0, 0, 0, 0, 0, -5, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 剧毒小蜘蛛 (Area: -Unknown- - Difficulty: 17) (Auras: 210229 - -Unknown-) - !!! on transport - transport template not found !!!
(@CGUID+1779, 113041, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13191.02, 12172.8, -249.9495, 4.972114, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 感染的双帆龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1780, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13208.6, 12180.85, -248.2362, 2.703719, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1781, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13020.92, 12100.96, -262.6891, 5.270913, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (Auras: 223423 - -Unknown-)
(@CGUID+1782, 112168, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12951.84, 12117.76, -270.7899, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1783, 112143, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13079.82, 12225.17, -262.7098, 2.811718, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 血瓣花鞭笞者 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1784, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13049.48, 12121.5, -264.246, 4.712389, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1785, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13077.32, 12222.51, -262.8891, 5.699848, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1786, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13122.66, 12225.67, -258.5604, 4.270349, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1787, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13154.22, 12015.86, -248.3068, 4.647579, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1788, 113041, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13176.09, 12223.58, -255.2009, 6.207985, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 感染的双帆龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1789, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13225.21, 12174.19, -247.3594, 4.511834, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1790, 112143, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13025.08, 12111.31, -263.2595, 0.7569256, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 血瓣花鞭笞者 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1791, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13019.81, 12097.01, -262.8966, 1.706308, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (Auras: 223423 - -Unknown-)
(@CGUID+1792, 112168, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12953.19, 12054.02, -265.3214, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1793, 112143, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13062.51, 12247.2, -264.6306, 2.004203, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 血瓣花鞭笞者 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1794, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13126.04, 12248.45, -261.56, 2.7108, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1795, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13157.6, 12037.49, -249.3352, 5.900543, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1796, 113040, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13124.03, 12275.61, -230.4874, 5.179381, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 狂怒的翼手龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1797, 113041, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13077.03, 12274.24, -266.4825, 0.06696451, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 感染的双帆龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1798, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13217.67, 12153.54, -244.7183, 3.81138, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1799, 112168, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13000.01, 12147.08, -271.0989, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1800, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13062.72, 12219.48, -265.6347, 0.4480587, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1801, 112143, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12945.32, 12118.82, -270.7316, 0.536439, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 血瓣花鞭笞者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1802, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13124, 12236.42, -259.7426, 3.990142, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1803, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13019.71, 12191.28, -282.9666, 3.522449, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1804, 113040, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13207.34, 12203.91, -215.532, 2.626991, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 狂怒的翼手龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1805, 112143, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13001.64, 12159.55, -272.6864, 6.020757, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 血瓣花鞭笞者 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1806, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13085.9, 12209.33, -259.7682, 3.549903, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1807, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13124.84, 12253.88, -262.584, 5.61367, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1808, 112143, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13006.52, 12136.69, -268.2975, 4.557513, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 血瓣花鞭笞者 (Area: -Unknown- - Difficulty: 17) (Auras: 223400 - -Unknown-)
(@CGUID+1809, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13075.54, 12198.23, -261.6761, 4.702441, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1810, 105304, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12821.77, 12302.83, -248.1222, 3.830852, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 支配触须 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1811, 113920, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13009.98, 12181.1, -282.6068, 3.225168, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 伊格诺斯之鞭 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1812, 113040, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13092.57, 12282.93, -228.107, 1.84773, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 狂怒的翼手龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1813, 113040, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13012.86, 12130.23, -233.389, 1.094586, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 狂怒的翼手龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1814, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13062.38, 12142.05, -271.349, 2.430014, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1815, 112168, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13068.94, 12238.04, -264.2471, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1816, 112143, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12949, 12054.4, -265.5871, 2.643025, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 血瓣花鞭笞者 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1817, 112143, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13056.05, 12096.29, -258.1164, 0.9979525, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 血瓣花鞭笞者 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1818, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13084.37, 12224.53, -262.1941, 1.570796, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1819, 105304, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12843.59, 12331.36, -249.0134, 3.569767, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 支配触须 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1820, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13120.23, 12244.44, -261.3231, 0.997054, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1821, 113920, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13013.64, 12212.12, -282.9019, 3.692162, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 伊格诺斯之鞭 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1822, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13021.11, 12099.94, -262.7389, 6.126801, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (Auras: 223423 - -Unknown-)
(@CGUID+1823, 105906, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12818.11, 12328.26, -245.7215, 3.795443, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 伊格诺斯之眼 (Area: -Unknown- - Difficulty: 17) (Auras: 209915 - -Unknown-)
(@CGUID+1824, 113041, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13227.13, 12095.59, -242.2039, 5.995414, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 感染的双帆龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1825, 113041, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13168.37, 12012.63, -248.7688, 2.67445, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 感染的双帆龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1826, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13057.68, 12128.43, -265.5601, 0.5148699, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1827, 112168, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13003.16, 12082.14, -264.9324, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1828, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13217.55, 12180.39, -247.9381, 4.93986, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1829, 112143, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12972.04, 12054.68, -265.9893, 5.684216, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 血瓣花鞭笞者 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1830, 112143, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12994.3, 12083.12, -265.7912, 5.171886, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 血瓣花鞭笞者 (Area: -Unknown- - Difficulty: 17) (Auras: 223400 - -Unknown-)
(@CGUID+1831, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13069.74, 12208.14, -263.7902, 6.269515, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1832, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13019.08, 12099.98, -262.8581, 3.301312, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (Auras: 223423 - -Unknown-)
(@CGUID+1833, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13153.38, 12029.17, -248.6196, 2.390473, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1834, 113041, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12960.17, 12067.62, -265.7606, 5.331012, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 感染的双帆龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1835, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13061.33, 12158.36, -274.3694, 1.154489, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1836, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13025.44, 12190.92, -282.7889, 1.925701, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1837, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13212.8, 12172.66, -248.0065, 0.7349917, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1838, 112143, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13010.38, 12088.88, -263.9302, 3.060399, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 血瓣花鞭笞者 (Area: -Unknown- - Difficulty: 17) (Auras: 223400 - -Unknown-)
(@CGUID+1839, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13020.01, 12102.46, -262.8232, 4.643747, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (Auras: 223423 - -Unknown-)
(@CGUID+1840, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13165.78, 12011.61, -248.3007, 5.454672, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1841, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13020.4, 12191.37, -282.856, 4.37185, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1842, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13215.93, 12183.06, -247.5441, 0.6894428, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1843, 113520, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12802.35, 11888.9, -256.7805, 3.325872, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 古代灵魂 (Area: -Unknown- - Difficulty: 17) (Auras: 225758 - -Unknown-)
(@CGUID+1844, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13046.65, 12142.47, -266.7437, 1.161814, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1845, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13153.61, 12003.34, -249.1289, 5.47704, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1846, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13016.91, 12195.8, -282.8906, 2.259059, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1847, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13018.28, 12102.14, -262.8353, 4.030025, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (Auras: 223423 - -Unknown-)
(@CGUID+1848, 112168, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13042.92, 12104.54, -260.4368, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1849, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13072.71, 12128.79, -268.1322, 1.547356, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1850, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13140.79, 12239.82, -259.8432, 4.865902, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1851, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13162.85, 12025.45, -248.4571, 5.504475, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1852, 113040, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12961.33, 12035.03, -228.8227, 2.396533, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 狂怒的翼手龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1853, 111860, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12904.94, 12274.96, -263.6268, 4.046804, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 显赫的伯兰 (Area: -Unknown- - Difficulty: 17) (Auras: 222879 - -Unknown-)
(@CGUID+1854, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12918.82, 12060.12, -267.8368, 3.146963, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1855, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12907.79, 12050.19, -268.6146, 3.146963, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1856, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12909.09, 12072.83, -269.8171, 0.3327175, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1857, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12905.85, 12059.96, -268.9304, 3.146963, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1858, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12907.24, 12082.95, -270.8156, 3.903415, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (Auras: 223423 - -Unknown-) (possible waypoints or random movement)
(@CGUID+1859, 113040, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12910.28, 12087.55, -241.8836, 4.454252, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 狂怒的翼手龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1860, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12904.57, 12077.12, -270.8744, 1.537083, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (Auras: ) (possible waypoints or random movement)
(@CGUID+1861, 113920, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12943.43, 12209.2, -282.5562, 5.638984, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 伊格诺斯之鞭 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1862, 113920, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12978.41, 12240.78, -282.9702, 1.314652, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 伊格诺斯之鞭 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1863, 113920, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12902.55, 12134.26, -282.8074, 3.70326, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 伊格诺斯之鞭 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1864, 113920, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12922.15, 12156.79, -282.8256, 2.489175, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 伊格诺斯之鞭 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1865, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12999.91, 12274.37, -271.596, 4.024191, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1866, 113041, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12888.34, 11990.55, -270.0401, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 感染的双帆龙 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1867, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13009.22, 12293.01, -268.6046, 3.981834, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1868, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13008.3, 12287.52, -268.528, 2.811335, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1869, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12999.64, 12293.72, -269.8582, 0.1580959, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1870, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13020.52, 12293.49, -268.8279, 1.673899, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1871, 113920, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12873.41, 12175.43, -273.8024, 5.314514, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 伊格诺斯之鞭 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1872, 113920, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12977.35, 12298.38, -278.2577, 2.495864, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 伊格诺斯之鞭 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1873, 111221, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12901.48, 12278.59, -262.0751, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 萨拉塔斯 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1874, 113920, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12948.72, 12298.33, -276.9039, 3.859519, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 伊格诺斯之鞭 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1875, 113041, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13037.75, 12305.09, -269.618, 4.977737, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 感染的双帆龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1876, 112118, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -13008.4, 12307.65, -270.2571, 6.066669, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 被污染的血瓣花 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1877, 105393, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12792.02, 12353.46, -244.8482, 3.149815, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- -Unknown- (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1878, 113920, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12968.21, 12340.95, -278.3162, 4.346003, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 伊格诺斯之鞭 (Area: -Unknown- - Difficulty: 17)
(@CGUID+1879, 113040, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12994.04, 12380.99, -228.5406, 6.208237, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 狂怒的翼手龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1880, 113040, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12743.12, 12136.13, -226.6275, 3.19515, 7200, 10, 0, 0, 0, 1, 0, 0, 0, 26124), -- 狂怒的翼手龙 (Area: -Unknown- - Difficulty: 17) (possible waypoints or random movement)
(@CGUID+1881, 105322, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12849.17, 12338.94, -249.2572, 0.07828668, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 死光触须 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1882, 105591, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12852.11, 12298.65, -252.5724, 0, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 梦魇恐魔 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1883, 105383, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12837.65, 12332.17, -247.9438, 4.04042, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐蚀触须 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1884, 105383, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12836.86, 12333.24, -249.3577, 4.045614, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐蚀触须 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1885, 105322, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12811.02, 12294.36, -247.0895, 0.08163746, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 死光触须 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1886, 105322, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12817.74, 12297.57, -247.2344, 0.07463127, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 死光触须 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1887, 105322, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12817.74, 12297.57, -247.2344, 0.07463127, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 死光触须 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1888, 105383, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12820.86, 12312.03, -247.4556, 0.06092348, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124), -- 腐蚀触须 (Area: -Unknown- - Difficulty: 17) (Auras: )
(@CGUID+1889, 105383, 1520, 8026, 8034, 245760, '0', 0, 0, 0, -12819.38, 12300.72, -247.7564, 0.0612281, 7200, 0, 0, 0, 0, 0, 0, 0, 0, 26124); -- 腐蚀触须 (Area: -Unknown- - Difficulty: 17) (Auras: )

DELETE FROM `creature_addon` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+1889;
INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+567, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 辛达苟萨之怒
(@CGUID+568, 0, 0, 0, 1, 0, 0, 0, 0, '205283'), -- 莱索恩 - 205283 - -Unknown-
(@CGUID+569, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 虚空残渣
(@CGUID+570, 0, 0, 0, 1, 0, 0, 0, 0, '61424'), -- -Unknown- - 61424 - -Unknown-
(@CGUID+571, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+572, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+573, 0, 0, 0, 1, 0, 0, 0, 0, '224942 96733'), -- 月光林地守望者 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+574, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 艾林裂隙
(@CGUID+575, 0, 0, 0, 1, 0, 0, 0, 0, '224942 96733'), -- 月光林地守望者 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+576, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+577, 0, 0, 50331648, 1, 0, 0, 0, 0, '224942 96733'), -- 丝翅蛾 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+578, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+579, 0, 0, 0, 1, 0, 0, 0, 0, '224942 96733'), -- 月光林地守望者 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+580, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的金蟾 - 224942 - -Unknown-
(@CGUID+581, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+582, 0, 0, 0, 1, 0, 0, 0, 0, '224942 96733'), -- 金蟾 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+583, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+584, 0, 0, 0, 1, 0, 0, 0, 0, '223185'), -- 玛法里奥·怒风 - 223185 - -Unknown-
(@CGUID+585, 0, 0, 0, 1, 0, 0, 0, 0, '224942 96733'), -- 金蟾 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+586, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的鹿 - 224942 - -Unknown-
(@CGUID+587, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的金蟾 - 224942 - -Unknown-
(@CGUID+588, 0, 0, 0, 1, 0, 0, 0, 0, '224942 96733'), -- 兔子 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+589, 0, 0, 0, 1, 0, 0, 0, 0, '224942 96733'), -- 金蟾 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+590, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+591, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Druid Channel Cosmetic Stalker
(@CGUID+592, 0, 0, 0, 1, 0, 0, 0, 0, '195110'), -- 恐魂污染者 - 195110 - -Unknown-
(@CGUID+593, 0, 0, 0, 1, 0, 0, 0, 0, '195110'), -- 恐魂腐蚀者 - 195110 - -Unknown-
(@CGUID+594, 0, 0, 50331648, 1, 0, 0, 0, 0, '224942'), -- 腐化的丝翅蛾 - 224942 - -Unknown-
(@CGUID+595, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的鹿 - 224942 - -Unknown-
(@CGUID+596, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的金蟾 - 224942 - -Unknown-
(@CGUID+597, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+598, 0, 0, 50331648, 1, 0, 0, 0, 0, '224942'), -- 腐化的丝翅蛾 - 224942 - -Unknown-
(@CGUID+599, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Druid Channel Cosmetic Stalker
(@CGUID+600, 0, 0, 0, 1, 0, 0, 0, 0, '195110'), -- 恐魂污染者 - 195110 - -Unknown-
(@CGUID+601, 0, 0, 0, 1, 0, 0, 0, 0, '195110'), -- 恐魂腐蚀者 - 195110 - -Unknown-
(@CGUID+602, 0, 0, 50331648, 1, 0, 0, 0, 0, '224942'), -- 腐化的丝翅蛾 - 224942 - -Unknown-
(@CGUID+603, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的鹿 - 224942 - -Unknown-
(@CGUID+604, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的金蟾 - 224942 - -Unknown-
(@CGUID+605, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+606, 0, 0, 50331648, 1, 0, 0, 0, 0, '225758'), -- 古代灵魂 - 225758 - -Unknown-
(@CGUID+607, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+608, 0, 0, 50331648, 1, 0, 0, 0, 0, '224942'), -- 腐化的丝翅蛾 - 224942 - -Unknown-
(@CGUID+609, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+610, 0, 0, 0, 1, 0, 0, 0, 0, '17327 224942 96733'), -- 巨熊之灵 - 17327 - -Unknown-, 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+611, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+612, 0, 0, 0, 1, 0, 0, 0, 0, '224942 96733'), -- 金蟾 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+613, 0, 0, 0, 1, 0, 0, 0, 0, '17327 224942 96733'), -- 巨豹之灵 - 17327 - -Unknown-, 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+614, 0, 0, 50331648, 1, 0, 0, 0, 0, '224942'), -- 腐化的丝翅蛾 - 224942 - -Unknown-
(@CGUID+615, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+616, 0, 0, 0, 1, 0, 0, 0, 0, '224942 96733'), -- 金蟾 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+617, 0, 0, 50331648, 1, 0, 0, 0, 0, '224942'), -- 腐化的丝翅蛾 - 224942 - -Unknown-
(@CGUID+618, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的鹿 - 224942 - -Unknown-
(@CGUID+619, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的金蟾 - 224942 - -Unknown-
(@CGUID+620, 0, 0, 0, 1, 0, 0, 0, 0, '224942 96733'), -- 金蟾 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+621, 0, 0, 0, 1, 0, 0, 0, 0, '224942 96733'), -- 鹿 - 224942 - -Unknown-, 96733 - -Unknown-
(@CGUID+622, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 塞纳留斯
(@CGUID+623, 0, 0, 50331648, 1, 0, 0, 0, 0, '224942'), -- 腐化的丝翅蛾 - 224942 - -Unknown-
(@CGUID+624, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的鹿 - 224942 - -Unknown-
(@CGUID+625, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的金蟾 - 224942 - -Unknown-
(@CGUID+626, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Druid Channel Cosmetic Stalker
(@CGUID+627, 0, 0, 0, 1, 0, 0, 0, 0, '195110'), -- 恐魂污染者 - 195110 - -Unknown-
(@CGUID+628, 0, 0, 0, 1, 0, 0, 0, 0, '195110'), -- 恐魂腐蚀者 - 195110 - -Unknown-
(@CGUID+629, 0, 0, 50331648, 1, 0, 0, 0, 0, '224942'), -- 腐化的丝翅蛾 - 224942 - -Unknown-
(@CGUID+630, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的鹿 - 224942 - -Unknown-
(@CGUID+631, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的金蟾 - 224942 - -Unknown-
(@CGUID+632, 0, 0, 50331648, 1, 0, 0, 0, 0, '224942'), -- 腐化的丝翅蛾 - 224942 - -Unknown-
(@CGUID+633, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的鹿 - 224942 - -Unknown-
(@CGUID+634, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 腐化的金蟾 - 224942 - -Unknown-
(@CGUID+635, 0, 0, 0, 1, 0, 0, 0, 0, '208288'), -- 纠缠梦魇 - 208288 - -Unknown-
(@CGUID+636, 0, 0, 0, 1, 0, 0, 0, 0, '208288'), -- 纠缠梦魇 - 208288 - -Unknown-
(@CGUID+637, 0, 0, 0, 1, 0, 0, 0, 0, '208288'), -- 纠缠梦魇 - 208288 - -Unknown-
(@CGUID+638, 0, 0, 0, 1, 0, 0, 0, 0, '208288'), -- 纠缠梦魇 - 208288 - -Unknown-
(@CGUID+639, 0, 0, 0, 1, 0, 0, 0, 0, '208288'), -- 纠缠梦魇 - 208288 - -Unknown-
(@CGUID+640, 0, 0, 0, 1, 0, 0, 0, 0, '208288'), -- 纠缠梦魇 - 208288 - -Unknown-
(@CGUID+641, 0, 0, 0, 1, 0, 0, 0, 0, '208288'), -- 纠缠梦魇 - 208288 - -Unknown-
(@CGUID+642, 0, 0, 0, 1, 0, 0, 0, 0, '208288'), -- 纠缠梦魇 - 208288 - -Unknown-
(@CGUID+643, 0, 0, 0, 1, 0, 0, 0, 0, '208288'), -- 纠缠梦魇 - 208288 - -Unknown-
(@CGUID+644, 0, 0, 0, 1, 0, 0, 0, 0, '208288'), -- 纠缠梦魇 - 208288 - -Unknown-
(@CGUID+645, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+646, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+647, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+648, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+649, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+650, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+651, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 萨拉塔斯
(@CGUID+652, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+653, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+654, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+655, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+656, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+657, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+658, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+659, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+660, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+661, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+662, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 强势梦魇
(@CGUID+663, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 辛达苟萨之怒
(@CGUID+664, 0, 0, 0, 1, 0, 0, 0, 0, '212604'), -- 腐化的翡翠龙蛋 - 212604 - -Unknown-
(@CGUID+665, 0, 0, 0, 1, 0, 0, 0, 0, '210861'), -- 梦魇树苗 - 210861 - -Unknown-
(@CGUID+666, 0, 0, 0, 1, 0, 0, 0, 0, '212178'), -- 被折磨的幽魂 - 212178 - -Unknown-

(@CGUID+1102, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1103, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1104, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1105, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 萨拉塔斯
(@CGUID+1106, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1107, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1108, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1109, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1110, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1111, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1112, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1113, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1114, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1115, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1116, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- -Unknown-
(@CGUID+1117, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- -Unknown-
(@CGUID+1118, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1119, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1120, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1121, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1122, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1123, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1124, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1125, 0, 0, 0, 1, 0, 0, 0, 0, '222115'), -- Fog Beast Spawner Stalker - 222115 - -Unknown-
(@CGUID+1126, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1127, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1128, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1129, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1130, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 死根古树 - 8279 - -Unknown-
(@CGUID+1131, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1132, 0, 0, 0, 1, 0, 0, 0, 0, '222115'), -- Fog Beast Spawner Stalker - 222115 - -Unknown-
(@CGUID+1133, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- -Unknown-
(@CGUID+1134, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- -Unknown-
(@CGUID+1135, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 污心腐蚀者 - 8279 - -Unknown-
(@CGUID+1136, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1137, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1138, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 污心腐蚀者 - 8279 - -Unknown-
(@CGUID+1139, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1140, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心拷问者
(@CGUID+1141, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1142, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1143, 0, 0, 0, 1, 0, 0, 0, 0, '222115'), -- Fog Beast Spawner Stalker - 222115 - -Unknown-
(@CGUID+1144, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1145, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1146, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1147, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1148, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1149, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1150, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1151, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1152, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1153, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1154, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1155, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1156, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1157, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1158, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1159, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1160, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1161, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 污心腐蚀者 - 8279 - -Unknown-
(@CGUID+1162, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1163, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1164, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1165, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1166, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1167, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心拷问者
(@CGUID+1168, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1169, 0, 0, 0, 1, 0, 0, 0, 0, '220189'), -- 腐朽软泥怪 - 220978 - -Unknown-, 220189 - -Unknown-
(@CGUID+1170, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1171, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1172, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心拷问者
(@CGUID+1173, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1174, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1175, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1176, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1177, 0, 0, 0, 1, 0, 0, 0, 0, '222115'), -- Fog Beast Spawner Stalker - 222115 - -Unknown-
(@CGUID+1178, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1179, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1180, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1181, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1182, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1183, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1184, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1185, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1186, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心拷问者
(@CGUID+1187, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1188, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1189, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心拷问者
(@CGUID+1190, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1191, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1192, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1193, 0, 0, 0, 1, 0, 0, 0, 0, '220189'), -- 腐朽软泥怪 - 220978 - -Unknown-, 220189 - -Unknown-
(@CGUID+1194, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1195, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1196, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1197, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1198, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1199, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1200, 0, 0, 0, 1, 0, 0, 0, 0, '220189'), -- 腐朽软泥怪 - 220978 - -Unknown-, 220189 - -Unknown-
(@CGUID+1201, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1202, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 腐化的害虫
(@CGUID+1203, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1204, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1205, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1206, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1207, 0, 0, 0, 1, 0, 0, 0, 0, '220189'), -- 尼珊德拉 - 220189 - -Unknown-
(@CGUID+1208, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1209, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1210, 0, 0, 0, 1, 0, 0, 0, 0, '222115'), -- Fog Beast Spawner Stalker - 222115 - -Unknown-
(@CGUID+1211, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1212, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1213, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1214, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1215, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 腐化的害虫
(@CGUID+1216, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1217, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1218, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1219, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1220, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1221, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1222, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 腐化的害虫
(@CGUID+1223, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1224, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1225, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1226, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1227, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1228, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1229, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1230, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1231, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1232, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1233, 0, 0, 0, 1, 0, 0, 0, 0, '222115'), -- Fog Beast Spawner Stalker - 222115 - -Unknown-
(@CGUID+1234, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1235, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1236, 0, 0, 0, 1, 0, 0, 0, 0, '220189'), -- 腐朽软泥怪 - 220978 - -Unknown-, 220189 - -Unknown-
(@CGUID+1237, 0, 0, 0, 1, 0, 0, 0, 0, '220189'), -- 腐朽软泥怪 - 220978 - -Unknown-, 220189 - -Unknown-
(@CGUID+1238, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1239, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 污心腐蚀者 - 8279 - -Unknown-
(@CGUID+1240, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心拷问者
(@CGUID+1241, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1242, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 死根古树 - 8279 - -Unknown-
(@CGUID+1243, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 污心腐蚀者 - 8279 - -Unknown-
(@CGUID+1244, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1245, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 腐化的害虫
(@CGUID+1246, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心拷问者
(@CGUID+1247, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1248, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1249, 0, 0, 0, 1, 0, 0, 0, 0, ''); -- Satyr Channel Cosmetic Stalker

INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+1250, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1251, 0, 0, 0, 1, 0, 0, 0, 0, '220189'), -- 污心欺诈者 - 220189 - -Unknown-
(@CGUID+1252, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1253, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1254, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1255, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1256, 0, 0, 0, 1, 0, 0, 0, 0, '222115'), -- Fog Beast Spawner Stalker - 222115 - -Unknown-
(@CGUID+1257, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1258, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1259, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1260, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1261, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 死根古树 - 8279 - -Unknown-
(@CGUID+1262, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 玛法里奥·怒风
(@CGUID+1263, 0, 0, 50331648, 1, 0, 0, 0, 0, '225758'), -- 古代灵魂 - 225758 - -Unknown-
(@CGUID+1264, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1265, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1266, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1267, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1268, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1269, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1270, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1271, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1272, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1273, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1274, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1275, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1276, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1277, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1278, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1279, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1280, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1281, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1282, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1283, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1284, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1285, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1286, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1287, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1288, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1289, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1290, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1291, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1292, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1293, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1294, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1295, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1296, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1297, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1298, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1299, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1300, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1301, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1302, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1303, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1304, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1305, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1306, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1307, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1308, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1309, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1310, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1311, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1312, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1313, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1314, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1315, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1316, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1317, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1318, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1319, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1320, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1321, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1322, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1323, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1324, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1325, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1326, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1327, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1328, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1329, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1330, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1331, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1332, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1333, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1334, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1335, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1336, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1337, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1338, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1339, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1340, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1341, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1342, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1343, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1344, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1345, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1346, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1347, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1348, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1349, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1350, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1351, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1352, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1353, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1354, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1355, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1356, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1357, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1358, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1359, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1360, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1361, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1362, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1363, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1364, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1365, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1366, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1367, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1368, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1369, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1370, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1371, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1372, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1373, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1374, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1375, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1376, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1377, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1378, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1379, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1380, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1381, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1382, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1383, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1384, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1385, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1386, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1387, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1388, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1389, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1390, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1391, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1392, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1393, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1394, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1395, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1396, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1397, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1398, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1399, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1400, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1401, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1402, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1403, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1404, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1405, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1406, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1407, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1408, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1409, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1410, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1411, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1412, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1413, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1414, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇精华
(@CGUID+1415, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1416, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1417, 0, 0, 0, 1, 0, 0, 0, 0, '222115'), -- Fog Beast Spawner Stalker - 222115 - -Unknown-
(@CGUID+1418, 0, 0, 0, 1, 0, 0, 0, 0, '222115'), -- Fog Beast Spawner Stalker - 222115 - -Unknown-
(@CGUID+1419, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 污心腐蚀者 - 8279 - -Unknown-
(@CGUID+1420, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1421, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1422, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1423, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 污心腐蚀者 - 8279 - -Unknown-
(@CGUID+1424, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1425, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1426, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 污心腐蚀者 - 8279 - -Unknown-
(@CGUID+1427, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心拷问者
(@CGUID+1428, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心拷问者
(@CGUID+1429, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1430, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1431, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1432, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1433, 0, 0, 0, 1, 0, 0, 0, 0, '220189'), -- 污心欺诈者 - 220189 - -Unknown-
(@CGUID+1434, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心拷问者
(@CGUID+1435, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 污心腐蚀者 - 8279 - -Unknown-
(@CGUID+1436, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 污心欺诈者
(@CGUID+1437, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1438, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 污心拷问者
(@CGUID+1439, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- Breath Stalker
(@CGUID+1440, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1441, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1442, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1443, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1444, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1445, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1446, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1447, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1448, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1449, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1450, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1451, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1452, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1453, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1454, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1455, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1456, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1457, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1458, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1459, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1460, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- Satyr Channel Cosmetic Stalker
(@CGUID+1461, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1462, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1463, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1464, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1465, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1466, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1467, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1468, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1469, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1470, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1471, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1472, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1473, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1474, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1475, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1476, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1477, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1478, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1479, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1480, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1481, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1482, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1483, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1484, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1485, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1486, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1487, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1488, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1489, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1490, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1491, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1492, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1493, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1494, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1495, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1496, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1497, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1498, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1499, 0, 0, 0, 1, 0, 0, 0, 0, '196285'); -- 腐化的害虫 - 196285 - -Unknown-

INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+1500, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1501, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1502, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1503, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1504, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1505, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1506, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1507, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1508, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1509, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1510, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1511, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1512, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1513, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1514, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1515, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1516, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1517, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1518, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1519, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1520, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1521, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1522, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1523, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1524, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1525, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1526, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1527, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1528, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1529, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1530, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1531, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1532, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1533, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1534, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1535, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1536, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1537, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1538, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1539, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1540, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1541, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1542, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1543, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1544, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1545, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1546, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1547, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1548, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1549, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1550, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1551, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1552, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1553, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1554, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1555, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1556, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1557, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1558, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1559, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1560, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1561, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1562, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1563, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1564, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1565, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1566, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1567, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1568, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1569, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1570, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1571, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1572, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1573, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1574, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1575, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1576, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1577, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1578, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1579, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1580, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1581, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1582, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1583, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1584, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1585, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1586, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1587, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1588, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1589, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1590, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1591, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1592, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1593, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1594, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1595, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1596, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1597, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1598, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1599, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1600, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1601, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1602, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1603, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1604, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1605, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1606, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1607, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1608, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1609, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1610, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1611, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1612, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1613, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1614, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1615, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1616, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1617, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1618, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1619, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1620, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1621, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1622, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1623, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1624, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1625, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1626, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1627, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1628, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1629, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1630, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1631, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1632, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1633, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1634, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1635, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1636, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1637, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1638, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1639, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1640, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1641, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1642, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1643, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1644, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1645, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1646, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1647, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1648, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1649, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1650, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1651, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1652, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1653, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1654, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1655, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1656, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1657, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 腐化的害虫 - 196285 - -Unknown-
(@CGUID+1658, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1659, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1660, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1661, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 幼龙之怒 - 225324 - -Unknown-
(@CGUID+1662, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1663, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1664, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1665, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1666, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1667, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1668, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1669, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1670, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1671, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1672, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1673, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1674, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1675, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 梦魇幼龙
(@CGUID+1676, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 彩虹
(@CGUID+1677, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 彩虹
(@CGUID+1678, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 艾乐瑞瑟·雷弗拉尔
(@CGUID+1679, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 感染的平原陆行鸟 - 225048 - -Unknown-
(@CGUID+1680, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 生病的山狮 - 225048 - -Unknown-
(@CGUID+1681, 0, 0, 50331648, 1, 0, 0, 0, 0, '225048'), -- 腐化的猛鹫 - 225048 - -Unknown-
(@CGUID+1682, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 梦魇兔 - 225048 - -Unknown-
(@CGUID+1683, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 感染的平原陆行鸟 - 225048 - -Unknown-
(@CGUID+1684, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 感染的瞪羚 - 225048 - -Unknown-
(@CGUID+1685, 0, 0, 50331648, 1, 0, 0, 0, 0, '225048'), -- 腐化的猛鹫 - 225048 - -Unknown-
(@CGUID+1686, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 梦魇兔 - 225048 - -Unknown-
(@CGUID+1687, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 感染的瞪羚 - 225048 - -Unknown-
(@CGUID+1688, 0, 0, 50331648, 1, 0, 0, 0, 0, '221869'), -- 艾乐瑞瑟·雷弗拉尔 - 221869 - -Unknown-
(@CGUID+1689, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 梦魇兔 - 225048 - -Unknown-
(@CGUID+1690, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 感染的瞪羚 - 225048 - -Unknown-
(@CGUID+1691, 0, 0, 50331648, 1, 0, 0, 0, 0, '225048'), -- 腐化的猛鹫 - 225048 - -Unknown-
(@CGUID+1692, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 生病的山狮 - 225048 - -Unknown-
(@CGUID+1693, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 梦魇兔 - 225048 - -Unknown-
(@CGUID+1694, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 感染的平原陆行鸟 - 225048 - -Unknown-
(@CGUID+1695, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 感染的瞪羚 - 225048 - -Unknown-
(@CGUID+1696, 0, 0, 50331648, 1, 0, 0, 0, 0, '225758'), -- 古代灵魂 - 225758 - -Unknown-
(@CGUID+1697, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 感染的平原陆行鸟 - 225048 - -Unknown-
(@CGUID+1698, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 梦魇兔 - 225048 - -Unknown-
(@CGUID+1699, 0, 0, 50331648, 1, 0, 0, 0, 0, '225048'), -- 腐化的猛鹫 - 225048 - -Unknown-
(@CGUID+1700, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 感染的平原陆行鸟 - 225048 - -Unknown-
(@CGUID+1701, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 生病的山狮 - 225048 - -Unknown-
(@CGUID+1702, 0, 0, 50331648, 1, 0, 0, 0, 0, '225048'), -- 腐化的猛鹫 - 225048 - -Unknown-
(@CGUID+1703, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 梦魇兔 - 225048 - -Unknown-
(@CGUID+1704, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1705, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1706, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- Flight Loc Stalker
(@CGUID+1707, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1708, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1709, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1710, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 尖叫小蜘蛛 - 210229 - -Unknown-
(@CGUID+1711, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 影羽
(@CGUID+1712, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1713, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1714, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1715, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1716, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1717, 0, 0, 0, 1, 0, 0, 0, 0, '215581'), -- 蠕动的卵囊 - 215581 - -Unknown-
(@CGUID+1718, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1719, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1720, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 扭曲之影 - 46598 - -Unknown-
(@CGUID+1721, 0, 0, 0, 1, 0, 0, 0, 0, '46598 210229'), -- 剧毒小蜘蛛 - 46598 - -Unknown-, 210229 - -Unknown-
(@CGUID+1722, 0, 0, 0, 1, 0, 0, 0, 0, '215581'), -- 蠕动的卵囊 - 215581 - -Unknown-
(@CGUID+1723, 0, 0, 50331648, 1, 0, 0, 0, 0, '221869 210792'), -- 扭曲之影 - 221869 - -Unknown-, 210792 - -Unknown-
(@CGUID+1724, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 扭曲之影 - 46598 - -Unknown-
(@CGUID+1725, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 扭曲之影 - 46598 - -Unknown-
(@CGUID+1726, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 扭曲之影 - 46598 - -Unknown-
(@CGUID+1727, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1728, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1729, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 扭曲之影 - 46598 - -Unknown-
(@CGUID+1730, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 扭曲之影 - 46598 - -Unknown-
(@CGUID+1731, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 扭曲之影
(@CGUID+1732, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 扭曲之影
(@CGUID+1733, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 扭曲之影
(@CGUID+1734, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1735, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1736, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1737, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1738, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- Flight Loc Stalker
(@CGUID+1739, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1740, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- Nightmare Spawn Stalker
(@CGUID+1741, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1742, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1743, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 尖叫小蜘蛛
(@CGUID+1744, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1745, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 扭曲之影 - 46598 - -Unknown-
(@CGUID+1746, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 扭曲之影 - 46598 - -Unknown-
(@CGUID+1747, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1748, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1749, 0, 0, 0, 1, 0, 0, 0, 0, ''); -- 脉动的卵囊

INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+1750, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1751, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1752, 0, 0, 0, 1, 0, 0, 0, 0, '215581'), -- 蠕动的卵囊 - 215581 - -Unknown-
(@CGUID+1753, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1754, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1755, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1756, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1757, 0, 0, 0, 1, 0, 0, 0, 0, '215581'), -- 蠕动的卵囊 - 215581 - -Unknown-
(@CGUID+1758, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1759, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1760, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1761, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- Flight Loc Stalker
(@CGUID+1762, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 暗夜蛛母
(@CGUID+1763, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1764, 0, 0, 0, 1, 0, 0, 0, 0, '215581'), -- 蠕动的卵囊 - 215581 - -Unknown-
(@CGUID+1765, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1766, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1767, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1768, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1769, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1770, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1771, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1772, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1773, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1774, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 脉动的卵囊
(@CGUID+1775, 0, 0, 0, 1, 0, 0, 0, 0, '215581'), -- 蠕动的卵囊 - 215581 - -Unknown-
(@CGUID+1776, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1777, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 萨拉塔斯
(@CGUID+1778, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 剧毒小蜘蛛 - 210229 - -Unknown-
(@CGUID+1779, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 感染的双帆龙
(@CGUID+1780, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1781, 0, 0, 0, 1, 0, 0, 0, 0, '223423'), -- 被污染的血瓣花 - 223423 - -Unknown-
(@CGUID+1782, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1783, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 血瓣花鞭笞者
(@CGUID+1784, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1785, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1786, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1787, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1788, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 感染的双帆龙
(@CGUID+1789, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1790, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 血瓣花鞭笞者
(@CGUID+1791, 0, 0, 0, 1, 0, 0, 0, 0, '223423'), -- 被污染的血瓣花 - 223423 - -Unknown-
(@CGUID+1792, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1793, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 血瓣花鞭笞者
(@CGUID+1794, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1795, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1796, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 狂怒的翼手龙
(@CGUID+1797, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 感染的双帆龙
(@CGUID+1798, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1799, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1800, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1801, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 血瓣花鞭笞者
(@CGUID+1802, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1803, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1804, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 狂怒的翼手龙
(@CGUID+1805, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 血瓣花鞭笞者
(@CGUID+1806, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1807, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1808, 0, 0, 0, 1, 0, 0, 0, 0, '223400'), -- 血瓣花鞭笞者 - 223400 - -Unknown-
(@CGUID+1809, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1810, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 支配触须
(@CGUID+1811, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 伊格诺斯之鞭
(@CGUID+1812, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 狂怒的翼手龙
(@CGUID+1813, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 狂怒的翼手龙
(@CGUID+1814, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1815, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1816, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 血瓣花鞭笞者
(@CGUID+1817, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 血瓣花鞭笞者
(@CGUID+1818, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1819, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 支配触须
(@CGUID+1820, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1821, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 伊格诺斯之鞭
(@CGUID+1822, 0, 0, 0, 1, 0, 0, 0, 0, '223423'), -- 被污染的血瓣花 - 223423 - -Unknown-
(@CGUID+1823, 0, 0, 50331648, 1, 0, 0, 0, 0, '209915'), -- 伊格诺斯之眼 - 209915 - -Unknown-
(@CGUID+1824, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 感染的双帆龙
(@CGUID+1825, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 感染的双帆龙
(@CGUID+1826, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1827, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1828, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1829, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 血瓣花鞭笞者
(@CGUID+1830, 0, 0, 0, 1, 0, 0, 0, 0, '223400'), -- 血瓣花鞭笞者 - 223400 - -Unknown-
(@CGUID+1831, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1832, 0, 0, 0, 1, 0, 0, 0, 0, '223423'), -- 被污染的血瓣花 - 223423 - -Unknown-
(@CGUID+1833, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1834, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 感染的双帆龙
(@CGUID+1835, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1836, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1837, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1838, 0, 0, 0, 1, 0, 0, 0, 0, '223400'), -- 血瓣花鞭笞者 - 223400 - -Unknown-
(@CGUID+1839, 0, 0, 0, 1, 0, 0, 0, 0, '223423'), -- 被污染的血瓣花 - 223423 - -Unknown-
(@CGUID+1840, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1841, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1842, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1843, 0, 0, 50331648, 1, 0, 0, 0, 0, '225758'), -- 古代灵魂 - 225758 - -Unknown-
(@CGUID+1844, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1845, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1846, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1847, 0, 0, 0, 1, 0, 0, 0, 0, '223423'), -- 被污染的血瓣花 - 223423 - -Unknown-
(@CGUID+1848, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1849, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1850, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1851, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1852, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 狂怒的翼手龙
(@CGUID+1853, 0, 0, 0, 1, 0, 0, 0, 0, '222879'), -- 显赫的伯兰 - 222879 - -Unknown-
(@CGUID+1854, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1855, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1856, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1857, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1858, 0, 0, 0, 1, 0, 0, 0, 0, '223423'), -- 被污染的血瓣花 - 223423 - -Unknown-
(@CGUID+1859, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 狂怒的翼手龙
(@CGUID+1860, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1861, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 伊格诺斯之鞭
(@CGUID+1862, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 伊格诺斯之鞭
(@CGUID+1863, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 伊格诺斯之鞭
(@CGUID+1864, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 伊格诺斯之鞭
(@CGUID+1865, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1866, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 感染的双帆龙
(@CGUID+1867, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1868, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1869, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1870, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1871, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 伊格诺斯之鞭
(@CGUID+1872, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 伊格诺斯之鞭
(@CGUID+1873, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 萨拉塔斯
(@CGUID+1874, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 伊格诺斯之鞭
(@CGUID+1875, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 感染的双帆龙
(@CGUID+1876, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 被污染的血瓣花
(@CGUID+1877, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- -Unknown-
(@CGUID+1878, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 伊格诺斯之鞭
(@CGUID+1879, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 狂怒的翼手龙
(@CGUID+1880, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 狂怒的翼手龙
(@CGUID+1881, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 死光触须
(@CGUID+1882, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 梦魇恐魔
(@CGUID+1883, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 腐蚀触须
(@CGUID+1884, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 腐蚀触须
(@CGUID+1885, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 死光触须
(@CGUID+1886, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 死光触须
(@CGUID+1887, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 死光触须
(@CGUID+1888, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 腐蚀触须
(@CGUID+1889, 0, 0, 0, 1, 0, 0, 0, 0, ''); -- 腐蚀触须


DELETE FROM `gameobject` WHERE `guid` BETWEEN @OGUID+0 AND @OGUID+318;
INSERT INTO `gameobject` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `position_x`, `position_y`, `position_z`, `orientation`, `rotation0`, `rotation1`, `rotation2`, `rotation3`, `spawntimesecs`, `animprogress`, `state`, `VerifiedBuild`) VALUES
(@OGUID+71, 254272, 1520, 8026, 0, 245760, '0', 0, 1988.717, 1339.299, 582.8891, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 灰熊丘陵 (Area: 0 - Difficulty: 17)
(@OGUID+72, 254273, 1520, 8026, 0, 245760, '0', 0, 1933.413, 1273.809, 643.7105, 2.268925, 0, 0, 0.9063072, 0.4226195, 7200, 255, 1, 26124), -- 翡翠梦境之路 (Area: 0 - Difficulty: 17)
(@OGUID+73, 253129, 1520, 8026, 0, 245760, '0', 0, 1790.936, 1421.97, 350.1419, 0.2969019, 0, 0, 0.1479063, 0.9890014, 7200, 255, 1, 26124), -- 副本传送门 (Area: 0 - Difficulty: 17)
(@OGUID+74, 254270, 1520, 8026, 0, 245760, '0', 0, 1793.171, 1331.155, 613.6365, 0, 0, 0, 0, 1, 7200, 255, 1, 26124), -- 安戈洛环形山 (Area: 0 - Difficulty: 17)
(@OGUID+75, 254271, 1520, 8026, 0, 245760, '0', 0, 1831.417, 1252.326, 615.4836, 0.9930774, 0, 0, 0.4763851, 0.8792367, 7200, 255, 1, 26124), -- 雷霆崖 (Area: 0 - Difficulty: 17)
(@OGUID+76, 251536, 1520, 8026, 0, 245760, '0', 0, 1848.6, 1384.651, 369.0928, 4.757155, 0, 0, -0.6911039, 0.7227554, 7200, 255, 0, 26124), -- 占位符 (Area: 0 - Difficulty: 17)
(@OGUID+77, 251534, 1520, 8026, 0, 245760, '0', 0, 1911.963, 1261.471, 368.3508, 4.885175, 0, 0, -0.6434565, 0.7654827, 7200, 255, 1, 26124), -- 占位符 (Area: 0 - Difficulty: 17)
(@OGUID+78, 251535, 1520, 8026, 0, 245760, '0', 0, 1837.144, 1385.495, 369.7708, 1.61907, 0, 0, 0.7239666, 0.689835, 7200, 255, 0, 26124), -- 占位符 (Area: 0 - Difficulty: 17)
(@OGUID+79, 251533, 1520, 8026, 0, 245760, '0', 0, 1903.908, 1261.17, 368.3508, 1.765096, 0, 0, 0.7723598, 0.6351852, 7200, 255, 1, 26124), -- 占位符 (Area: 0 - Difficulty: 17)
(@OGUID+80, 248926, 1520, 8026, 0, 245760, '0', 0, 1876.323, 1325.014, 597.8997, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 安戈洛藤蔓 (Area: 0 - Difficulty: 17)
(@OGUID+81, 248927, 1520, 8026, 0, 245760, '0', 0, 1876.323, 1325.014, 597.8997, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 雷霆崖藤蔓 (Area: 0 - Difficulty: 17)
(@OGUID+82, 248925, 1520, 8026, 0, 245760, '0', 0, 1876.323, 1325.014, 597.8997, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 入口藤蔓 (Area: 0 - Difficulty: 17)
(@OGUID+83, 260550, 1520, 8026, 0, 245760, '0', 0, 1864.35, 1407.664, 589.7158, 1.906457, -0.05629492, 0.0787735, 0.8097715, 0.5787017, 7200, 255, 1, 26124), -- Doodad_7DU_Nightmare_RootWall008 (Area: 0 - Difficulty: 17)
(@OGUID+84, 260551, 1520, 8026, 0, 245760, '0', 0, 1854.764, 1405.274, 589.7156, 1.906457, -0.05629492, 0.0787735, 0.8097715, 0.5787017, 7200, 255, 1, 26124), -- Doodad_7DU_Nightmare_RootWall009 (Area: 0 - Difficulty: 17)
(@OGUID+85, 260552, 1520, 8026, 0, 245760, '0', 0, 1845.235, 1401.094, 592.269, 1.93579, -0.05622149, 0.1728992, 0.8006535, 0.5708756, 7200, 255, 1, 26124), -- Doodad_7DU_Nightmare_RootWall010 (Area: 0 - Difficulty: 17)
(@OGUID+86, 248928, 1520, 8026, 0, 245760, '0', 0, 1876.323, 1325.014, 597.8997, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 灰色藤蔓 (Area: 0 - Difficulty: 17)
(@OGUID+87, 248929, 1520, 8026, 0, 245760, '0', 0, 1876.323, 1325.014, 597.8997, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 巨龙之藤 (Area: 0 - Difficulty: 17)
(@OGUID+88, 251980, 1520, 8026, 0, 245760, '0', 0, 1875.788, 1328.563, 598.7389, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 梦魇之虹 (Area: 0 - Difficulty: 17)

(@OGUID+90, 252006, 1520, 8026, 8190, 245760, '0', 0, 454.8681, -12729.91, 34.96235, 4.89565, 0, 0, -0.6394386, 0.7688421, 7200, 255, 1, 26124), -- 传送门 (Area: -Unknown- - Difficulty: 17)
-- (@OGUID+91, 209078, 1520, 8026, 8041, 245760, '0', 0, -3091.958, 8398.056, 14.456, 1.022245, 0, 0, 0.4891567, 0.8721959, 7200, 255, 1, 26124), -- 荷叶 (Area: -Unknown- - Difficulty: 17) - !!! might be temporary spawn !!!

(@OGUID+93, 252003, 1520, 8026, 8092, 245760, '0', 0, 11180.67, -12622.44, 557.9088, 3.38594, 0, 0, -0.9925461, 0.12187, 7200, 255, 1, 26124), -- 传送门 (Area: -Unknown- - Difficulty: 17)
(@OGUID+94, 254168, 1520, 8026, 8092, 245760, '0', 0, 11364.23, -12743.16, 488.0746, 1.572971, 0, 0, 0.7078753, 0.7063375, 7200, 255, 1, 26124), -- 梦魇战利品 (Area: -Unknown- - Difficulty: 17)


(@OGUID+286, 251536, 1520, 8026, 8026, 245760, '0', 0, 1848.6, 1384.651, 369.0928, 4.757155, 0, 0, -0.6911039, 0.7227554, 7200, 255, 0, 26124), -- 占位符 (Area: -Unknown- - Difficulty: 17)
(@OGUID+287, 251535, 1520, 8026, 8026, 245760, '0', 0, 1837.144, 1385.495, 369.7708, 1.61907, 0, 0, 0.7239666, 0.689835, 7200, 255, 0, 26124), -- 占位符 (Area: -Unknown- - Difficulty: 17)
(@OGUID+288, 253129, 1520, 8026, 8026, 245760, '0', 0, 1790.936, 1421.97, 350.1419, 0.2969019, 0, 0, 0.1479063, 0.9890014, 7200, 255, 1, 26124), -- 副本传送门 (Area: -Unknown- - Difficulty: 17)
(@OGUID+289, 251534, 1520, 8026, 8026, 245760, '0', 0, 1911.963, 1261.471, 368.3508, 4.885175, 0, 0, -0.6434565, 0.7654827, 7200, 255, 1, 26124), -- 占位符 (Area: -Unknown- - Difficulty: 17)
(@OGUID+290, 251533, 1520, 8026, 8026, 245760, '0', 0, 1903.908, 1261.17, 368.3508, 1.765096, 0, 0, 0.7723598, 0.6351852, 7200, 255, 1, 26124), -- 占位符 (Area: -Unknown- - Difficulty: 17)
(@OGUID+291, 260550, 1520, 8026, 8026, 245760, '0', 0, 1864.35, 1407.664, 589.7158, 1.906457, -0.05629492, 0.0787735, 0.8097715, 0.5787017, 7200, 255, 0, 26124), -- Doodad_7DU_Nightmare_RootWall008 (Area: -Unknown- - Difficulty: 17)
(@OGUID+292, 260551, 1520, 8026, 8026, 245760, '0', 0, 1854.764, 1405.274, 589.7156, 1.906457, -0.05629492, 0.0787735, 0.8097715, 0.5787017, 7200, 255, 0, 26124), -- Doodad_7DU_Nightmare_RootWall009 (Area: -Unknown- - Difficulty: 17)
(@OGUID+293, 260552, 1520, 8026, 8026, 245760, '0', 0, 1845.235, 1401.094, 592.269, 1.93579, -0.05622149, 0.1728992, 0.8006535, 0.5708756, 7200, 255, 0, 26124), -- Doodad_7DU_Nightmare_RootWall010 (Area: -Unknown- - Difficulty: 17)
(@OGUID+294, 248928, 1520, 8026, 8026, 245760, '0', 0, 1876.323, 1325.014, 597.8997, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 灰色藤蔓 (Area: -Unknown- - Difficulty: 17)
(@OGUID+295, 248929, 1520, 8026, 8026, 245760, '0', 0, 1876.323, 1325.014, 597.8997, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 巨龙之藤 (Area: -Unknown- - Difficulty: 17)
(@OGUID+296, 248926, 1520, 8026, 8026, 245760, '0', 0, 1876.323, 1325.014, 597.8997, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 安戈洛藤蔓 (Area: -Unknown- - Difficulty: 17)
(@OGUID+297, 248927, 1520, 8026, 8026, 245760, '0', 0, 1876.323, 1325.014, 597.8997, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 雷霆崖藤蔓 (Area: -Unknown- - Difficulty: 17)
(@OGUID+298, 248925, 1520, 8026, 8026, 245760, '0', 0, 1876.323, 1325.014, 597.8997, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 入口藤蔓 (Area: -Unknown- - Difficulty: 17)
(@OGUID+299, 254272, 1520, 8026, 8026, 245760, '0', 0, 1988.717, 1339.299, 582.8891, 3.141593, 0, 0, -1, 0, 7200, 255, 1, 26124), -- 灰熊丘陵 (Area: -Unknown- - Difficulty: 17)
(@OGUID+300, 254273, 1520, 8026, 8026, 245760, '0', 0, 1933.413, 1273.809, 643.7105, 2.268925, 0, 0, 0.9063072, 0.4226195, 7200, 255, 1, 26124), -- 翡翠梦境之路 (Area: -Unknown- - Difficulty: 17)
(@OGUID+301, 254270, 1520, 8026, 8026, 245760, '0', 0, 1793.171, 1331.155, 613.6365, 0, 0, 0, 0, 1, 7200, 255, 1, 26124), -- 安戈洛环形山 (Area: -Unknown- - Difficulty: 17)
(@OGUID+302, 254271, 1520, 8026, 8026, 245760, '0', 0, 1831.417, 1252.326, 615.4836, 0.9930774, 0, 0, 0.4763851, 0.8792367, 7200, 255, 1, 26124), -- 雷霆崖 (Area: -Unknown- - Difficulty: 17)
-- (@OGUID+303, 233282, 1520, 8026, 8026, 245760, '0', 0, 1863.959, 1341.727, 369.5058, 5.505689, 0, 0, -0.3790302, 0.9253843, 7200, 255, 1, 26124), -- 餐桌 (Area: -Unknown- - Difficulty: 17) - !!! might be temporary spawn !!!
(@OGUID+304, 251995, 1520, 8026, 8298, 245760, '0', 0, 11326.44, 11030.37, 20.63319, 1.640607, 0, 0, 0.7313528, 0.6819993, 7200, 255, 1, 26124), -- 传送门 (Area: -Unknown- - Difficulty: 17)
(@OGUID+305, 255000, 1520, 8026, 8298, 245760, '0', 0, 11349.17, 11181.61, -103.5485, 3.874631, 0, 0, -0.9335804, 0.358368, 7200, 255, 0, 26124), -- 扭曲根须 (Area: -Unknown- - Difficulty: 17)
(@OGUID+306, 254249, 1520, 8026, 8034, 245760, '0', 0, -13095.58, 12190.12, -256.8696, 0.3005705, 0, 0, 0.1497202, 0.9887284, 7200, 255, 1, 26124), -- 腐化的能量水晶 (Area: -Unknown- - Difficulty: 17)
(@OGUID+307, 254248, 1520, 8026, 8034, 245760, '0', 0, -12955.82, 12155.2, -275.9906, 0.3005705, 0, 0, 0.1497202, 0.9887284, 7200, 255, 1, 26124), -- 腐化的能量水晶 (Area: -Unknown- - Difficulty: 17)
(@OGUID+308, 254249, 1520, 8026, 8034, 245760, '0', 0, -13208.54, 12148.01, -245.5059, 0.3005705, 0, 0, 0.1497202, 0.9887284, 7200, 255, 1, 26124), -- 腐化的能量水晶 (Area: -Unknown- - Difficulty: 17)
(@OGUID+309, 251997, 1520, 8026, 8034, 245760, '0', 0, -13149.69, 12074.34, -249.8499, 1.108283, 0, 0, 0.5262136, 0.8503524, 7200, 255, 1, 26124), -- 传送门 (Area: -Unknown- - Difficulty: 17)
(@OGUID+310, 254248, 1520, 8026, 8034, 245760, '0', 0, -13162.13, 12213.94, -256.3466, 0.3005705, 0, 0, 0.1497202, 0.9887284, 7200, 255, 1, 26124), -- 腐化的能量水晶 (Area: -Unknown- - Difficulty: 17)
(@OGUID+311, 251555, 1520, 8026, 8034, 245760, '0', 0, -12818.58, 12328.89, -250.6537, 0.6806767, 0, 0, 0.333806, 0.9426418, 7200, 255, 1, 26124), -- 伊格诺斯之眼力场 (Area: -Unknown- - Difficulty: 17)
(@OGUID+312, 254247, 1520, 8026, 8034, 245760, '0', 0, -13103.73, 12083.69, -253.7906, 2.012882, 0, 0, 0.8449335, 0.5348714, 7200, 255, 1, 26124), -- 腐化的能量水晶 (Area: -Unknown- - Difficulty: 17)
(@OGUID+313, 248850, 1520, 8026, 8034, 245760, '0', 0, -12894.22, 12284.15, -259.679, 3.481937, 0, 0, -0.9855556, 0.169352, 7200, 255, 0, 26124), -- 根须墙 (Area: -Unknown- - Difficulty: 17)
(@OGUID+314, 248848, 1520, 8026, 8034, 245760, '0', 0, -12891.59, 12277.45, -259.6259, 0.6195911, 0, 0, 0.3048639, 0.9523959, 7200, 255, 0, 26124), -- 占位符 (Area: -Unknown- - Difficulty: 17)
(@OGUID+315, 248849, 1520, 8026, 8034, 245760, '0', 0, -12898.63, 12291.74, -258.5766, 3.769912, 0, 0, -0.9510565, 0.3090171, 7200, 255, 0, 26124), -- 根须墙 (Area: -Unknown- - Difficulty: 17)
(@OGUID+316, 254248, 1520, 8026, 8034, 245760, '0', 0, -12806.83, 12088.4, -272.3642, 0.3005705, 0, 0, 0.1497202, 0.9887284, 7200, 255, 1, 26124), -- 腐化的能量水晶 (Area: -Unknown- - Difficulty: 17)
(@OGUID+317, 254247, 1520, 8026, 8034, 245760, '0', 0, -12854.53, 11979.72, -266.8038, 0.3005705, 0, 0, 0.1497202, 0.9887284, 7200, 255, 1, 26124), -- 腐化的能量水晶 (Area: -Unknown- - Difficulty: 17)
(@OGUID+318, 254248, 1520, 8026, 8034, 245760, '0', 0, -13015.93, 12396.95, -270.5087, 0.3005705, 0, 0, 0.1497202, 0.9887284, 7200, 255, 1, 26124); -- 腐化的能量水晶 (Area: -Unknown- - Difficulty: 17)
-- (@OGUID+319, 181621, 1520, 8026, 8034, 245760, '0', 0, -12858.3, 12288.83, -254.4704, 0.683241, 0, 0, 0.3350143, 0.9422131, 7200, 255, 1, 26124); -- -Unknown- (Area: -Unknown- - Difficulty: 17) - !!! might be temporary spawn !!!
DELETE FROM `gameobject_addon` WHERE `guid` BETWEEN @OGUID+0 AND @OGUID+318;
INSERT INTO `gameobject_addon` (`guid`, `parent_rotation0`, `parent_rotation1`, `parent_rotation2`, `parent_rotation3`) VALUES
(@OGUID+0, 0, 0, 0.6427878, 0.7660443), -- -Unknown-
(@OGUID+50, 0, 0, 0.8681992, -0.4962159), -- -Unknown-
(@OGUID+67, 0, 0, 0.2206993, 0.9753419), -- -Unknown-
(@OGUID+68, 0, 0, 0.2206993, 0.9753419), -- -Unknown-
(@OGUID+69, 0, 0, 0.2206993, 0.9753419), -- -Unknown-
(@OGUID+70, 0, 0, 0.2206993, 0.9753419), -- -Unknown-
(@OGUID+71, 0, 0, 1, -0.00000004371139), -- 灰熊丘陵
(@OGUID+72, 0, 0, 1, -0.00000004371139), -- 翡翠梦境之路
(@OGUID+74, 0, 0, 1, -0.00000004371139), -- 安戈洛环形山
(@OGUID+75, 0, 0, 1, -0.00000004371139), -- 雷霆崖
(@OGUID+76, 0, 0, 1, -0.00000004371139), -- 占位符
(@OGUID+77, 0, 0, 1, -0.00000004371139), -- 占位符
(@OGUID+78, 0, 0, 1, -0.00000004371139), -- 占位符
(@OGUID+79, 0, 0, 1, -0.00000004371139), -- 占位符
(@OGUID+80, 0, 0, 1, -0.00000004371139), -- 安戈洛藤蔓
(@OGUID+81, 0, 0, 1, -0.00000004371139), -- 雷霆崖藤蔓
(@OGUID+82, 0, 0, 1, -0.00000004371139), -- 入口藤蔓
(@OGUID+83, 0, 0, 1, -0.00000004371139), -- Doodad_7DU_Nightmare_RootWall008
(@OGUID+84, 0, 0, 1, -0.00000004371139), -- Doodad_7DU_Nightmare_RootWall009
(@OGUID+85, 0, 0, 1, -0.00000004371139), -- Doodad_7DU_Nightmare_RootWall010
(@OGUID+86, 0, 0, 1, -0.00000004371139), -- 灰色藤蔓
(@OGUID+87, 0, 0, 1, -0.00000004371139), -- 巨龙之藤
(@OGUID+88, 0, 0, 1, -0.00000004371139), -- 梦魇之虹
(@OGUID+95, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+96, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+97, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+98, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+99, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+100, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+101, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+102, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+103, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+104, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+105, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+106, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+107, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+108, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+109, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+110, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+111, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+112, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+113, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+114, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+115, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+116, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+117, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+118, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+119, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+120, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+122, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+123, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+126, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+127, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+128, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+130, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+134, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+135, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+136, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+137, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+138, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+139, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+141, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+142, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+143, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+144, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+145, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+146, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+147, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+148, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+149, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+150, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+151, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+152, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+153, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+154, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+155, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+156, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+157, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+158, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+159, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+160, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+161, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+162, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+163, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+164, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+165, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+166, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+167, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+168, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+169, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+170, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+171, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+172, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+173, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+174, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+175, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+176, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+177, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+178, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+179, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+180, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+181, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+182, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+183, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+184, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+186, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+190, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+191, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+192, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+193, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+194, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+195, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+196, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+199, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+200, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+201, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+202, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+203, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+205, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+206, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+207, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+208, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+209, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+210, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+211, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+212, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+213, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+214, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+217, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+219, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+221, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+224, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+227, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+229, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+230, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+236, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+237, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+238, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+239, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+240, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+241, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+243, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+244, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+245, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+246, 0, 0, -0.333807, 0.9426414), -- -Unknown-
(@OGUID+247, 0, 0, 0.9238795, -0.3826835), -- 0
(@OGUID+248, 0, 0, 0.9238795, -0.3826835), -- 0
(@OGUID+249, 0, 0, 0.9238795, -0.3826835), -- 0
(@OGUID+250, 0, 0, 0.9238795, -0.3826835), -- 0
(@OGUID+251, 0, 0, 0.9238795, -0.3826835), -- 0
(@OGUID+252, 0, 0, -0.8660253, 0.5000001), -- -Unknown-
(@OGUID+253, 0, 0, 0.9238795, -0.3826835), -- 0
(@OGUID+254, 0, 0, 0.9238795, -0.3826835), -- 0
(@OGUID+255, 0, 0, 0.9238795, -0.3826835), -- 0
(@OGUID+256, 0, 0, 0.9238795, -0.3826835), -- 0
(@OGUID+286, 0, 0, 1, -0.00000004371139), -- 占位符
(@OGUID+287, 0, 0, 1, -0.00000004371139), -- 占位符
(@OGUID+289, 0, 0, 1, -0.00000004371139), -- 占位符
(@OGUID+290, 0, 0, 1, -0.00000004371139), -- 占位符
(@OGUID+291, 0, 0, 1, -0.00000004371139), -- Doodad_7DU_Nightmare_RootWall008
(@OGUID+292, 0, 0, 1, -0.00000004371139), -- Doodad_7DU_Nightmare_RootWall009
(@OGUID+293, 0, 0, 1, -0.00000004371139), -- Doodad_7DU_Nightmare_RootWall010
(@OGUID+294, 0, 0, 1, -0.00000004371139), -- 灰色藤蔓
(@OGUID+295, 0, 0, 1, -0.00000004371139), -- 巨龙之藤
(@OGUID+296, 0, 0, 1, -0.00000004371139), -- 安戈洛藤蔓
(@OGUID+297, 0, 0, 1, -0.00000004371139), -- 雷霆崖藤蔓
(@OGUID+298, 0, 0, 1, -0.00000004371139), -- 入口藤蔓
(@OGUID+299, 0, 0, 1, -0.00000004371139), -- 灰熊丘陵
(@OGUID+300, 0, 0, 1, -0.00000004371139), -- 翡翠梦境之路
(@OGUID+301, 0, 0, 1, -0.00000004371139), -- 安戈洛环形山
(@OGUID+302, 0, 0, 1, -0.00000004371139), -- 雷霆崖
(@OGUID+303, 0, 0, 1, -0.00000004371139); -- 梦魇之虹
*/

DELETE FROM `creature_template_addon` WHERE `entry` IN (105383 /*105383 (腐蚀触须)*/, 105591 /*105591 (梦魇恐魔)*/, 105322 /*105322 (死光触须)*/, 105393 /*105393*/, 111860 /*111860 (显赫的伯兰) - -Unknown-*/, 105906 /*105906 (伊格诺斯之眼) - -Unknown-*/, 113920 /*113920 (伊格诺斯之鞭)*/, 105304 /*105304 (支配触须)*/, 112143 /*112143 (血瓣花鞭笞者)*/, 112168 /*112168 (被污染的血瓣花)*/, 112118 /*112118 (被污染的血瓣花)*/, 113041 /*113041 (感染的双帆龙)*/, 113040 /*113040 (狂怒的翼手龙)*/, 107459 /*107459 (剧毒小蜘蛛) - -Unknown-*/, 106087 /*106087 (艾乐瑞瑟·雷弗拉尔) - -Unknown-*/, 111980 /*111980 (暗夜蛛母)*/, 109849 /*109849 (Nightmare Spawn Stalker)*/, 113626 /*113626 (剧毒小蜘蛛) - -Unknown-, -Unknown-*/, 111439 /*111439 (扭曲之影) - -Unknown-, -Unknown-*/, 107767 /*107767 (扭曲之影) - -Unknown-*/, 112078 /*112078 (蠕动的卵囊) - -Unknown-*/, 108540 /*108540 (脉动的卵囊)*/, 111975 /*111975 (影羽)*/, 112039 /*112039 (尖叫小蜘蛛) - -Unknown-*/, 106510 /*106510 (Flight Loc Stalker)*/, 111933 /*111933 (剧毒小蜘蛛) - -Unknown-*/, 113609 /*113609 (艾乐瑞瑟·雷弗拉尔) - -Unknown-*/, 113093 /*113093 (感染的瞪羚) - -Unknown-*/, 113108 /*113108 (梦魇兔) - -Unknown-*/, 113103 /*113103 (腐化的猛鹫) - -Unknown-*/, 113106 /*113106 (生病的山狮) - -Unknown-*/, 113091 /*113091 (感染的平原陆行鸟) - -Unknown-*/, 113604 /*113604 (艾乐瑞瑟·雷弗拉尔)*/, 111567 /*111567 (梦魇幼龙)*/, 102930 /*102930 (Breath Stalker)*/, 113203 /*113203 (幼龙之怒) - -Unknown-*/, 102672 /*102672 (尼珊德拉) - -Unknown-*/, 111004 /*111004 (腐朽软泥怪) - -Unknown-, -Unknown-*/, 111355 /*111355 (污心拷问者)*/, 111333 /*111333 (污心欺诈者)*/, 111354 /*111354 (污心腐蚀者) - -Unknown-*/, 111528 /*111528 (死根古树) - -Unknown-*/, 111412 /*111412 (Satyr Channel Cosmetic Stalker)*/, 111535 /*111535 (Fog Beast Spawner Stalker) - -Unknown-*/, 102998 /*102998 (腐化的害虫) - -Unknown-*/, 113113 /*113113 (梦魇精华)*/, 106895 /*106895 (被折磨的幽魂) - -Unknown-*/, 106427 /*106427 (梦魇树苗) - -Unknown-*/, 106898 /*106898 (腐化的翡翠龙蛋) - -Unknown-*/, 112320 /*112320 (纠缠梦魇) - -Unknown-*/, 104636 /*104636 (塞纳留斯)*/, 113050 /*113050 (腐化的丝翅蛾) - -Unknown-*/, 112261 /*112261 (恐魂腐蚀者) - -Unknown-*/, 112260 /*112260 (恐魂污染者) - -Unknown-*/, 112263 /*112263 (Druid Channel Cosmetic Stalker)*/, 113048 /*113048 (腐化的鹿) - -Unknown-*/, 113049 /*113049 (腐化的金蟾) - -Unknown-*/, 113533 /*113533 (艾林裂隙)*/, 109249 /*109249 (强势梦魇)*/, 111208 /*111208 (虚空残渣)*/, 102682 /*102682 (莱索恩) - -Unknown-*/, 103378 /*103378 (病态裂隙)*/, 102681 /*102681 (泰拉尔) - -Unknown-, -Unknown-, -Unknown-*/, 102679 /*102679 (伊森德雷) - -Unknown-, -Unknown-*/, 113089 /*113089 (被亵渎的守护者) - -Unknown-*/, 113090 /*113090 (腐化的守门者) - -Unknown-*/, 103396 /*103396 (暗影裂隙)*/, 103395 /*103395 (梦魇裂隙)*/, 113092 /*113092 (集群恐魔) - -Unknown-*/, 111852 /*111852 (罗索斯) - -Unknown-, -Unknown-*/, 106482 /*106482 (玛法里奥·怒风)*/, 113575 /*113575 (彩虹)*/, 113520 /*113520 (古代灵魂) - -Unknown-*/, 100497 /*100497 (乌索克) - -Unknown-*/, 112303 /*112303 (可怕的雄鹰) - -Unknown-*/, 112307 /*112307 (梦魇触须) - -Unknown-*/, 111856 /*111856 (守卫者高罗克)*/, 111858 /*111858 (守卫者鲁森)*/, 112290 /*112290 (可怕的雄鹰) - -Unknown-*/, 112162 /*112162 (灰熊诱捕者) - -Unknown-*/, 112153 /*112153 (可怕的萨满) - -Unknown-*/, 113088 /*113088 (腐化的触须) - -Unknown-*/);
INSERT INTO `creature_template_addon` (`entry`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(105383, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 105383 (腐蚀触须)
(105591, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 105591 (梦魇恐魔)
(105322, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 105322 (死光触须)
(105393, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 105393
(111860, 0, 0, 0, 1, 0, 0, 0, 0, '222879'), -- 111860 (显赫的伯兰) - -Unknown-
(105906, 0, 0, 50331648, 1, 0, 0, 0, 0, '209915'), -- 105906 (伊格诺斯之眼) - -Unknown-
(113920, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 113920 (伊格诺斯之鞭)
(105304, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 105304 (支配触须)
(112143, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 112143 (血瓣花鞭笞者)
(112168, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 112168 (被污染的血瓣花)
(112118, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 112118 (被污染的血瓣花)
(113041, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 113041 (感染的双帆龙)
(113040, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 113040 (狂怒的翼手龙)
(107459, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 107459 (剧毒小蜘蛛) - -Unknown-
(106087, 0, 0, 0, 1, 0, 0, 0, 0, '226017'), -- 106087 (艾乐瑞瑟·雷弗拉尔) - -Unknown-
(111980, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 111980 (暗夜蛛母)
(109849, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 109849 (Nightmare Spawn Stalker)
(113626, 0, 0, 0, 1, 0, 0, 0, 0, '46598 210229'), -- 113626 (剧毒小蜘蛛) - -Unknown-, -Unknown-
(111439, 0, 0, 50331648, 1, 0, 0, 0, 0, '221869 210792'), -- 111439 (扭曲之影) - -Unknown-, -Unknown-
(107767, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 107767 (扭曲之影) - -Unknown-
(112078, 0, 0, 0, 1, 0, 0, 0, 0, '215581'), -- 112078 (蠕动的卵囊) - -Unknown-
(108540, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 108540 (脉动的卵囊)
(111975, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 111975 (影羽)
(112039, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 112039 (尖叫小蜘蛛) - -Unknown-
(106510, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 106510 (Flight Loc Stalker)
(111933, 0, 0, 0, 1, 0, 0, 0, 0, '210229'), -- 111933 (剧毒小蜘蛛) - -Unknown-
(113609, 0, 0, 50331648, 1, 0, 0, 0, 0, '221869'), -- 113609 (艾乐瑞瑟·雷弗拉尔) - -Unknown-
(113093, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 113093 (感染的瞪羚) - -Unknown-
(113108, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 113108 (梦魇兔) - -Unknown-
(113103, 0, 0, 50331648, 1, 0, 0, 0, 0, '225048'), -- 113103 (腐化的猛鹫) - -Unknown-
(113106, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 113106 (生病的山狮) - -Unknown-
(113091, 0, 0, 0, 1, 0, 0, 0, 0, '225048'), -- 113091 (感染的平原陆行鸟) - -Unknown-
(113604, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 113604 (艾乐瑞瑟·雷弗拉尔)
(111567, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 111567 (梦魇幼龙)
(102930, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 102930 (Breath Stalker)
(113203, 0, 0, 50331648, 1, 0, 0, 0, 0, '225324'), -- 113203 (幼龙之怒) - -Unknown-
(102672, 0, 0, 0, 1, 0, 0, 0, 0, '220189'), -- 102672 (尼珊德拉) - -Unknown-
(111004, 0, 0, 0, 1, 0, 0, 0, 0, '220189'), -- 111004 (腐朽软泥怪) - -220978 -, -Unknown-
(111355, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 111355 (污心拷问者)
(111333, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 111333 (污心欺诈者)
(111354, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 111354 (污心腐蚀者) - -Unknown-
(111528, 0, 0, 0, 1, 0, 0, 0, 0, '8279'), -- 111528 (死根古树) - -Unknown-
(111412, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 111412 (Satyr Channel Cosmetic Stalker)
(111535, 0, 0, 0, 1, 0, 0, 0, 0, '222115'), -- 111535 (Fog Beast Spawner Stalker) - -Unknown-
(102998, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 102998 (腐化的害虫) - -Unknown-
(113113, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 113113 (梦魇精华)
(106895, 0, 0, 0, 1, 0, 0, 0, 0, '212178'), -- 106895 (被折磨的幽魂) - -Unknown-
(106427, 0, 0, 0, 1, 0, 0, 0, 0, '210861'), -- 106427 (梦魇树苗) - -Unknown-
(106898, 0, 0, 0, 1, 0, 0, 0, 0, '212604'), -- 106898 (腐化的翡翠龙蛋) - -Unknown-
(112320, 0, 0, 0, 1, 0, 0, 0, 0, '208288'), -- 112320 (纠缠梦魇) - -Unknown-
(104636, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 104636 (塞纳留斯)
(113050, 0, 0, 50331648, 1, 0, 0, 0, 0, '224942'), -- 113050 (腐化的丝翅蛾) - -Unknown-
(112261, 0, 0, 0, 1, 0, 0, 0, 0, '195110'), -- 112261 (恐魂腐蚀者) - -Unknown-
(112260, 0, 0, 0, 1, 0, 0, 0, 0, '195110'), -- 112260 (恐魂污染者) - -Unknown-
(112263, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 112263 (Druid Channel Cosmetic Stalker)
(113048, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 113048 (腐化的鹿) - -Unknown-
(113049, 0, 0, 0, 1, 0, 0, 0, 0, '224942'), -- 113049 (腐化的金蟾) - -Unknown-
(113533, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 113533 (艾林裂隙)
(109249, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 109249 (强势梦魇)
(111208, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 111208 (虚空残渣)
(102682, 0, 0, 0, 1, 0, 0, 0, 0, '205283'), -- 102682 (莱索恩) - -Unknown-
(103378, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 103378 (病态裂隙)
(102681, 0, 0, 0, 1, 0, 0, 0, 0, '205283 203909 204719'), -- 102681 (泰拉尔) - -Unknown-, -Unknown-, -Unknown-
(102679, 0, 0, 0, 1, 0, 0, 0, 0, '205283 224200'), -- 102679 (伊森德雷) - -Unknown-, -Unknown-
(113089, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 113089 (被亵渎的守护者) - -Unknown-
(113090, 0, 0, 0, 1, 0, 0, 0, 0, '196285'), -- 113090 (腐化的守门者) - -Unknown-
(103396, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 103396 (暗影裂隙)
(103395, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 103395 (梦魇裂隙)
(113092, 0, 0, 0, 1, 0, 0, 0, 0, '204729'), -- 113092 (集群恐魔) - -Unknown-
(111852, 0, 0, 0, 1, 0, 0, 0, 0, '223181 223180'), -- 111852 (罗索斯) - -Unknown-, -Unknown-
(106482, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 106482 (玛法里奥·怒风)
(113575, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 113575 (彩虹)
(113520, 0, 0, 50331648, 1, 0, 0, 0, 0, '225758'), -- 113520 (古代灵魂) - -Unknown-
(100497, 0, 0, 0, 1, 0, 0, 0, 0, '205270'), -- 100497 (乌索克) - -Unknown-
(112303, 0, 0, 0, 1, 0, 0, 0, 0, '212515'), -- 112303 (可怕的雄鹰) - -Unknown-
(112307, 0, 0, 0, 1, 0, 0, 0, 0, '123978'), -- 112307 (梦魇触须) - -Unknown-
(111856, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 111856 (守卫者高罗克)
(111858, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 111858 (守卫者鲁森)
(112290, 0, 0, 1, 1, 0, 0, 0, 0, '212515'), -- 112290 (可怕的雄鹰) - -Unknown-
(112162, 0, 0, 1, 1, 0, 0, 0, 0, '212515'), -- 112162 (灰熊诱捕者) - -Unknown-
(112153, 0, 0, 1, 1, 0, 0, 0, 0, '212515'), -- 112153 (可怕的萨满) - -Unknown-
(113088, 0, 0, 0, 1, 0, 0, 0, 0, '123978'); -- 113088 (腐化的触须) - -Unknown-

UPDATE `creature_template_addon` SET `mount`=0, `auras`='18950' WHERE `entry`=91629; -- 91629 (伊利达雷执行者)
UPDATE `creature_template_addon` SET `auras`='133464' WHERE `entry`=106356; -- 106356 (苍穹咒术师)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=115012; -- 115012 (邪脉阴谋者)
UPDATE `creature_template_addon` SET `bytes1`=50331648, `auras`='231831' WHERE `entry`=114888; -- 114888 (夏多雷平民)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=122130; -- 122130
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=121541; -- 121541
UPDATE `creature_template_addon` SET `auras`='233077' WHERE `entry`=72587; -- 72587
UPDATE `creature_template_addon` SET `bytes1`=8 WHERE `entry`=96198; -- 96198
UPDATE `creature_template_addon` SET `auras`='60913 61354' WHERE `entry`=107326; -- 107326
UPDATE `creature_template_addon` SET `auras`='60913' WHERE `entry`=96479; -- 96479
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=104091; -- 104091
UPDATE `creature_template_addon` SET `auras`='224942 96733' WHERE `entry`=883; -- 883 (鹿)
UPDATE `creature_template_addon` SET `auras`='17327 224942 96733' WHERE `entry`=11957; -- 11957 (巨豹之灵)
UPDATE `creature_template_addon` SET `auras`='17327 224942 96733' WHERE `entry`=11956; -- 11956 (巨熊之灵)
UPDATE `creature_template_addon` SET `auras`='224942 96733' WHERE `entry`=721; -- 721 (兔子)
UPDATE `creature_template_addon` SET `auras`='224942 96733' WHERE `entry`=49735; -- 49735 (金蟾)
UPDATE `creature_template_addon` SET `auras`='224942 96733' WHERE `entry`=49844; -- 49844 (丝翅蛾)
UPDATE `creature_template_addon` SET `bytes2`=1, `auras`='224942 96733' WHERE `entry`=11822; -- 11822 (月光林地守望者)
UPDATE `creature_template_addon` SET `auras`='46598' WHERE `entry`=121464; -- 121464
UPDATE `creature_template_addon` SET `auras`='204063 115790 204064' WHERE `entry`=106385; -- 106385 (伊瑟拉)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=114590; -- 114590
UPDATE `creature_template_addon` SET `auras`='237554 240226' WHERE `entry`=126030; -- 126030
UPDATE `creature_template_addon` SET `bytes1`=3 WHERE `entry`=126043; -- 126043
UPDATE `creature_template_addon` SET `bytes1`=1, `bytes2`=1, `auras`='244972' WHERE `entry`=121516; -- 121516
UPDATE `creature_template_addon` SET `bytes1`=50331648, `auras`='' WHERE `entry`=114271; -- 114271
UPDATE `creature_template_addon` SET `bytes2`=0 WHERE `entry`=125523; -- 125523
UPDATE `creature_template_addon` SET `auras`='193264' WHERE `entry`=54638; -- 54638
UPDATE `creature_template_addon` SET `auras`='61424' WHERE `entry`=32641; -- 32641
UPDATE `creature_template_addon` SET `auras`='61424' WHERE `entry`=32642; -- 32642
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=98060; -- 98060
UPDATE `creature_template_addon` SET `bytes1`=50331648 WHERE `entry`=118786; -- 118786
UPDATE `creature_template_addon` SET `auras`='206449' WHERE `entry`=98027; -- 98027

DELETE FROM `creature_template_scaling` WHERE `Entry` IN (111567, 111208, 112178, 112143);
INSERT INTO `creature_template_scaling` (`Entry`, `LevelScalingDeltaMin`,`LevelScalingDeltaMax`, `VerifiedBuild`) VALUES
(111567, 0, 0, 26124),
(111208, 0, 0, 26124),
(112178, 0, 0, 26124),
(112143, 0, 0, 26124);

UPDATE `creature_template_scaling` SET `VerifiedBuild`=26124 WHERE `Entry`=91079;


UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65234;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69880;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69881;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69115;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=47511;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69879;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=73008;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69882;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=43560;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69316;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72624;
UPDATE `creature_model_info` SET `BoundingRadius`=4.428069, `VerifiedBuild`=26124 WHERE `DisplayID`=41485;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=71937;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70606;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65258;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=67790;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72878;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=18406;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=42838;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=1105;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=2031;
UPDATE `creature_model_info` SET `BoundingRadius`=0.9608659, `VerifiedBuild`=26124 WHERE `DisplayID`=1284;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70237;
UPDATE `creature_model_info` SET `BoundingRadius`=4.227596, `VerifiedBuild`=26124 WHERE `DisplayID`=69158;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=68077;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=45564;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=43156;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=45887;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=71690;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=45886;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66106;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66740;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65064;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69709;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=134;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=67552;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=62250;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=28190;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72966;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=71858;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=62529;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=62531;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=63048;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72868;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=67421;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69622;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69623;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=21072;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69720;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=63194;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69614;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69601;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69624;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69615;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=62534;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69617;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=36957;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70402;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=48804;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70014;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70880;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=32221;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=71988;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=73592;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70017;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72001;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=71989;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=71685;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70012;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=21999;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=40089;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70018;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70015;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=35802;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72002;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66503;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70016;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=73604;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=73535;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=16480;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70011;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=51301;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=64328;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72654;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=73143;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=73139;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=73140;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72095;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=26395;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70638;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=28143;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=28161;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65252;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69151;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=27667;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=59537;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69554;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69595;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72845;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70947;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=11910;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=11909;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=67297;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=36953;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=64539;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=67296;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=347;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=6297;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=11774;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=11776;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=11775;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=71745;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=67749;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=37729;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=21243;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=21244;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69630;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69631;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69588;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69628;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=73296;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=73295;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69604;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=73297;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65121;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65526;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69592;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=38252;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66177;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65938;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=12064;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=67745;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=67748;
UPDATE `creature_model_info` SET `CombatReach`=1.648352, `VerifiedBuild`=26124 WHERE `DisplayID`=71539;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69643;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72644;
UPDATE `creature_model_info` SET `BoundingRadius`=8.455193, `VerifiedBuild`=26124 WHERE `DisplayID`=69096;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70004;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=71922;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65636;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72236;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70155;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=68972;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=27710;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=71621;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=23767;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=71808;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65568;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65583;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65558;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65572;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70023;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65601;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=74249;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72032;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=51407;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72033;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65525;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=69673;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65584;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=23395;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=70523;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65614;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=68977;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=66676;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72021;
UPDATE `creature_model_info` SET `BoundingRadius`=2.131796, `VerifiedBuild`=26124 WHERE `DisplayID`=72647;
UPDATE `creature_model_info` SET `BoundingRadius`=1.406985, `VerifiedBuild`=26124 WHERE `DisplayID`=62198;
UPDATE `creature_model_info` SET `BoundingRadius`=4.476369, `VerifiedBuild`=26124 WHERE `DisplayID`=72012;
UPDATE `creature_model_info` SET `BoundingRadius`=1.705437, `VerifiedBuild`=26124 WHERE `DisplayID`=23773;
UPDATE `creature_model_info` SET `BoundingRadius`=1.279078, `VerifiedBuild`=26124 WHERE `DisplayID`=63266;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=72640;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65553;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=65564;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=73585;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=74886;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=74887;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=10090;
UPDATE `creature_model_info` SET `VerifiedBuild`=26124 WHERE `DisplayID`=75729;


UPDATE `npc_vendor` SET `slot`=29, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=39505 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=28, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=20815 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=27, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=6532 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=26, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=6530 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=25, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=4400 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=24, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=4399 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=23, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=4289 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=22, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=3371 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=21, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=4340 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=20, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=4342 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=19, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=4341 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=18, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=2325 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=17, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=2604 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=16, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=3857 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=15, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=3466 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=14, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=2880 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=13, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=2678 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=12, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=38426 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=11, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=14341 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=10, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=8343 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=9, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=4291 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=8, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=2321 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=7, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=2320 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=6, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=5956 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=5, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=6217 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=4, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=6256 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=3, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=85663 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=2, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=7005 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=1, `VerifiedBuild`=26124 WHERE (`entry`=91079 AND `item`=2901 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=14, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=39354 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=13, `maxcount`=2, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=4364 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=12, `maxcount`=2, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=4357 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=11, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=10647 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=10, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=3466 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=9, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=2880 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=8, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=39684 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=7, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=40533 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=6, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=4400 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=5, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=4399 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=4, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=90146 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=3, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=2901 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=2, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=5956 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=1, `VerifiedBuild`=26124 WHERE (`entry`=35642 AND `item`=64670 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-

DELETE FROM `creature_equip_template` WHERE (`CreatureID`=111355 AND `ID`=1) OR (`CreatureID`=111333 AND `ID`=1) OR (`CreatureID`=111354 AND `ID`=1) OR (`CreatureID`=112261 AND `ID`=1) OR (`CreatureID`=112260 AND `ID`=1) OR (`CreatureID`=113090 AND `ID`=1) OR (`CreatureID`=111856 AND `ID`=1) OR (`CreatureID`=111858 AND `ID`=1) OR (`CreatureID`=112162 AND `ID`=1) OR (`CreatureID`=112153 AND `ID`=1);
INSERT INTO `creature_equip_template` (`CreatureID`, `ID`, `ItemID1`, `AppearanceModID1`, `ItemVisual1`, `ItemID2`, `AppearanceModID2`, `ItemVisual2`, `ItemID3`, `AppearanceModID3`, `ItemVisual3`) VALUES
(111355, 1, 51392, 0, 0, 0, 0, 0, 0, 0, 0), -- 污心拷问者
(111333, 1, 137012, 0, 0, 0, 0, 0, 0, 0, 0), -- 污心欺诈者
(111354, 1, 51432, 0, 0, 0, 0, 0, 0, 0, 0), -- 污心腐蚀者
(112261, 1, 52529, 0, 0, 0, 0, 0, 0, 0, 0), -- 恐魂腐蚀者
(112260, 1, 39743, 0, 0, 0, 0, 0, 0, 0, 0), -- 恐魂污染者
(113090, 1, 137012, 0, 0, 0, 0, 0, 0, 0, 0), -- 腐化的守门者
(111856, 1, 111070, 0, 0, 0, 0, 0, 0, 0, 0), -- 守卫者高罗克
(111858, 1, 39422, 0, 0, 0, 0, 0, 0, 0, 0), -- 守卫者鲁森
(112162, 1, 118801, 0, 0, 0, 0, 0, 0, 0, 0), -- 灰熊诱捕者
(112153, 1, 59288, 0, 0, 0, 0, 0, 0, 0, 0); -- 可怕的萨满

UPDATE `creature_equip_template` SET `ItemID1`=0 WHERE (`CreatureID`=121516 AND `ID`=1); -- -Unknown-

DELETE FROM `gossip_menu` WHERE (`MenuId`=19582 AND `TextId`=28979) OR (`MenuId`=19590 AND `TextId`=29003) OR (`MenuId`=19591 AND `TextId`=30512) OR (`MenuId`=20396 AND `TextId`=30502);
INSERT INTO `gossip_menu` (`MenuId`, `TextId`) VALUES
(19582, 28979), -- 106463 (乌索克)
(19590, 29003), -- 106540 (埃洛瑟尔)
(19591, 30512), -- 106543 (绍恩·月爪)
(20396, 30502); -- 106482 (玛法里奥·怒风)


UPDATE `gossip_menu_option` SET `OptionText`='让我看看你的货物。' WHERE (`MenuId`=10667 AND `OptionIndex`=1);





UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=4196352 WHERE `entry`=105383; -- 腐蚀触须
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=33587456, `unit_flags2`=6291456 WHERE `entry`=105591; -- 梦魇恐魔
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=105322; -- 死光触须
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2656256 WHERE `entry`=105393; -- -Unknown-
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=111860; -- 显赫的伯兰
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=4196352 WHERE `entry`=105906; -- 伊格诺斯之眼
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=2.8, `speed_run`=1.428571, `BaseAttackTime`=3000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=113920; -- 伊格诺斯之鞭
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=6293504 WHERE `entry`=105304; -- 支配触须
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33536, `unit_flags2`=2048 WHERE `entry`=112143; -- 血瓣花鞭笞者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=2048 WHERE `entry`=112168; -- 被污染的血瓣花
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=112118; -- 被污染的血瓣花
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=113041; -- 感染的双帆龙
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=113040; -- 狂怒的翼手龙
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000 WHERE `entry`=107459; -- 剧毒小蜘蛛
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=256, `unit_flags2`=1073741824, `unit_flags3`=1 WHERE `entry`=106087; -- 艾乐瑞瑟·雷弗拉尔
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2 WHERE `entry`=111980; -- 暗夜蛛母
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554688, `unit_flags2`=67110912 WHERE `entry`=109849; -- Nightmare Spawn Stalker
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000 WHERE `entry`=113626; -- 剧毒小蜘蛛
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `speed_walk`=1.2, `speed_run`=0.4285714, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33587200, `VehicleId`=4798 WHERE `entry`=111439; -- 扭曲之影
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2048, `unit_flags3`=1, `VehicleId`=4799 WHERE `entry`=107767; -- 扭曲之影
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=634, `speed_run`=1, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33554432 WHERE `entry`=112078; -- 蠕动的卵囊
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=634, `speed_run`=1, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33554432 WHERE `entry`=108540; -- 脉动的卵囊
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2 WHERE `entry`=111975; -- 影羽
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000 WHERE `entry`=112039; -- 尖叫小蜘蛛
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554688, `unit_flags2`=67110912 WHERE `entry`=106510; -- Flight Loc Stalker
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000 WHERE `entry`=111933; -- 剧毒小蜘蛛
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33587200, `unit_flags2`=1073741824, `unit_flags3`=1 WHERE `entry`=113609; -- 艾乐瑞瑟·雷弗拉尔
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=188, `speed_run`=0.8571429, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=113093; -- 感染的瞪羚
UPDATE `creature_template` SET `faction`=188, `speed_run`=0.8571429, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=512, `unit_flags2`=2048 WHERE `entry`=113108; -- 梦魇兔
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=15, `speed_run`=0.8571429, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=113103; -- 腐化的猛鹫
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2156, `speed_run`=0.8571429, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=113106; -- 生病的山狮
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=189, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=113091; -- 感染的平原陆行鸟
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=768, `unit_flags2`=4194304, `unit_flags3`=1 WHERE `entry`=113604; -- 艾乐瑞瑟·雷弗拉尔
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33600, `unit_flags2`=2048, `HoverHeight`=4.5,`InhabitType`=4  WHERE `entry`=111567; -- 梦魇幼龙
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554688, `unit_flags2`=100665344 WHERE `entry`=102930; -- Breath Stalker
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_run`=0.5714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33587200, `unit_flags3`=1,`InhabitType`=4 WHERE `entry`=113203; -- 幼龙之怒
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=16, `speed_walk`=4.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=256, `unit_flags3`=1, `HoverHeight`=18.75 WHERE `entry`=102672; -- 尼珊德拉
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=111004; -- 腐朽软泥怪
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=8, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=111355; -- 污心拷问者
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=8, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=111333; -- 污心欺诈者
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=111354; -- 污心腐蚀者
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=4196352 WHERE `entry`=111528; -- 死根古树
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2048 WHERE `entry`=111412; -- Satyr Channel Cosmetic Stalker
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `speed_walk`=0.4, `speed_run`=0.1428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=2048 WHERE `entry`=111535; -- Fog Beast Spawner Stalker
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554688, `unit_flags2`=2048 WHERE `entry`=102998; -- 腐化的害虫
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=113113; -- 梦魇精华
UPDATE `creature_template` SET `unit_flags`=570458368 WHERE `entry`=114888; -- 夏多雷平民
UPDATE `creature_template` SET `maxlevel`=103 WHERE `entry`=105904; -- -Unknown-
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110 WHERE `entry`=96813; -- -Unknown-
UPDATE `creature_template` SET `minlevel`=108, `maxlevel`=108 WHERE `entry`=96636; -- -Unknown-
UPDATE `creature_template` SET `minlevel`=106, `maxlevel`=106 WHERE `entry`=96635; -- -Unknown-
UPDATE `creature_template` SET `minlevel`=102, `maxlevel`=102 WHERE `entry`=96592; -- -Unknown-
UPDATE `creature_template` SET `minlevel`=104, `maxlevel`=104 WHERE `entry`=96639; -- -Unknown-

UPDATE `creature_template` SET `minlevel`=101, `maxlevel`=101 WHERE `entry`=96643; -- -Unknown-

UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110 WHERE `entry`=104091; -- -Unknown-
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_walk`=0.4, `speed_run`=0.1428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=256, `unit_flags2`=2048 WHERE `entry`=106895; -- 被折磨的幽魂
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_walk`=0.4, `speed_run`=0.1428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=256, `unit_flags2`=4196352 WHERE `entry`=106427; -- 梦魇树苗
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=256, `unit_flags2`=2048 WHERE `entry`=106898; -- 腐化的翡翠龙蛋
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=112320; -- 纠缠梦魇
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `speed_run`=2.142857, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=1073741824, `unit_flags3`=2 WHERE `entry`=104636; -- 塞纳留斯
UPDATE `creature_template` SET `unit_flags`=537133312, `unit_flags2`=2049, `unit_flags3`=8192 WHERE `entry`=883; -- 鹿
UPDATE `creature_template` SET `unit_flags`=537133312, `unit_flags2`=2049, `unit_flags3`=8192 WHERE `entry`=11957; -- 巨豹之灵
UPDATE `creature_template` SET `npcflag`=2, `unit_flags`=537133312, `unit_flags2`=2049, `unit_flags3`=8192 WHERE `entry`=11956; -- 巨熊之灵
UPDATE `creature_template` SET `faction`=188, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=113050; -- 腐化的丝翅蛾
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=8, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=112261; -- 恐魂腐蚀者
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=8, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=112260; -- 恐魂污染者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `speed_run`=0.2857143, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2048 WHERE `entry`=112263; -- Druid Channel Cosmetic Stalker
UPDATE `creature_template` SET `unit_flags`=537133312, `unit_flags2`=2049, `unit_flags3`=8192 WHERE `entry`=721; -- 兔子
UPDATE `creature_template` SET `faction`=14, `speed_run`=0.8571429, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=113048; -- 腐化的鹿
UPDATE `creature_template` SET `unit_flags`=537133312, `unit_flags2`=2049, `unit_flags3`=8192 WHERE `entry`=49735; -- 金蟾
UPDATE `creature_template` SET `faction`=188, `speed_run`=0.8571429, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=113049; -- 腐化的金蟾
UPDATE `creature_template` SET `unit_flags`=537133312, `unit_flags2`=2049, `unit_flags3`=8192 WHERE `entry`=49844; -- 丝翅蛾
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_walk`=1.2, `speed_run`=0.4285714, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=4196352 WHERE `entry`=113533; -- 艾林裂隙
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `unit_flags`=537166080, `unit_flags2`=2049, `unit_flags3`=8192 WHERE `entry`=11822; -- 月光林地守望者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `speed_walk`=1.2, `speed_run`=0.4285714, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=109249; -- 强势梦魇
UPDATE `creature_template` SET `minlevel`=98, `maxlevel`=110, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33344, `unit_flags2`=33556480 WHERE `entry`=111208; -- 虚空残渣
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=1075838976, `HoverHeight`=14.5 WHERE `entry`=102682; -- 莱索恩
UPDATE `creature_template` SET `gossip_menu_id`=21059 WHERE `entry`=121589; -- -Unknown-
UPDATE `creature_template` SET `VehicleId`=5393 WHERE `entry`=126057; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=19590 WHERE `entry`=106540; -- 埃洛瑟尔
UPDATE `creature_template` SET `gossip_menu_id`=19591 WHERE `entry`=106543; -- 绍恩·月爪
UPDATE `creature_template` SET `gossip_menu_id`=19582 WHERE `entry`=106463; -- 乌索克
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33587968, `unit_flags2`=4196352, `unit_flags3`=1 WHERE `entry`=103378; -- 病态裂隙
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=1077936128, `HoverHeight`=14.5 WHERE `entry`=102681; -- 泰拉尔
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=1077936128, `HoverHeight`=16 WHERE `entry`=102679; -- 伊森德雷
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=113089; -- 被亵渎的守护者
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_walk`=5.2, `speed_run`=1.857143, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=113090; -- 腐化的守门者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33587968, `unit_flags2`=4196352, `unit_flags3`=1 WHERE `entry`=103396; -- 暗影裂隙
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33587968, `unit_flags2`=4196352, `unit_flags3`=1 WHERE `entry`=103395; -- 梦魇裂隙
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=113092; -- 集群恐魔
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=6293504, `HoverHeight`=9 WHERE `entry`=111852; -- 罗索斯

UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `npcflag`=3, `speed_run`=2.142857, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=1073741824, `unit_flags3`=2 WHERE `entry`=106482; -- 玛法里奥·怒风
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `speed_walk`=1.2, `speed_run`=0.4285714, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2048 WHERE `entry`=113575; -- 彩虹

UPDATE `creature_template` SET `gossip_menu_id`=21454 WHERE `entry`=126390; -- -Unknown-
UPDATE `creature_template` SET `unit_flags`=32768, `unit_flags2`=33556480, `unit_flags3`=0 WHERE `entry`=121394; -- -Unknown-

UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=768, `unit_flags2`=1140852736 WHERE `entry`=113520; -- 古代灵魂
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=16, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=4194304 WHERE `entry`=100497; -- 乌索克
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=4196352, `HoverHeight`=2.5 WHERE `entry`=112303; -- 可怕的雄鹰
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33587200, `unit_flags2`=4196352 WHERE `entry`=112307; -- 梦魇触须
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=2048, `VehicleId`=4852 WHERE `entry`=111856; -- 守卫者高罗克
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=2048, `VehicleId`=4852 WHERE `entry`=111858; -- 守卫者鲁森
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2099200, `HoverHeight`=2.5 WHERE `entry`=112290; -- 可怕的雄鹰
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=112162; -- 灰熊诱捕者
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=112153; -- 可怕的萨满
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=113088; -- 腐化的触须
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110 WHERE `entry`=101195; -- -Unknown-
/*
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=126389; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=113783; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=92489; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=125525; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=123395; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=128244; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=128241; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=127476; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=123413; -- -Unknown-

UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=121263; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=107457; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=124312; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=112323; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=97989; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=108393; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=111737; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=110810; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=106442; -- -Unknown-

UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=103832; -- -Unknown-
UPDATE `creature_template` SET `gossip_menu_id`=0 WHERE `entry`=98000; -- -Unknown-
*/
SET NAMES 'utf8';
SET @GROUP_ID=0;
SET @ID=0;
INSERT IGNORE INTO `creature_text` (`CreatureID`, `groupid`, `id`, `text`, `type`, `language`, `probability`, `emote`, `duration`, `sound`, `BroadcastTextId`, `comment`) VALUES
(100497, @GROUP_ID+0, @ID+0, '你们应该逃跑的！现在，我要拿你们的骨头去喂风暴乌鸦！', 14, 0, 100, 0, 0, 58379, 106101, '乌索克 to Player'),
(100497, @GROUP_ID+1, @ID+0, '|TInterface\\Icons\\spell_druid_bearhug:20|t%s的|cFFFF0000|Hspell:198006|h[专注凝视]|h|r瞄准了|cFFFF0000$n|r！', 41, 0, 100, 0, 0, 58385, 106100, '乌索克 to Player'),
(100497, @GROUP_ID+2, @ID+0, '我要像拍扁树苗一样拍扁你们！', 12, 0, 100, 0, 0, 58385, 108500, '乌索克 to Player'),
(100497, @GROUP_ID+3, @ID+0, '|TInterface\\Icons\\ability_deathwing_assualtaspects:20|t%s陷入了|cFFFF0000|Hspell:198388|h[血性狂乱]|h|r！', 41, 0, 100, 0, 0, 58387, 106113, '乌索克'),
(100497, @GROUP_ID+4, @ID+0, '梦魇滋长，吞噬万物！', 14, 0, 100, 0, 0, 58387, 106107, '乌索克'),
(100497, @GROUP_ID+5, @ID+0, '梦魇的大幕已经升起……我终于从漫长的沉睡中……归来了。', 14, 0, 100, 0, 0, 58383, 106102, '乌索克 to Player'),
(102672, @GROUP_ID+0, @ID+0, '你们要找梦境？它也在找你们。', 14, 0, 100, 0, 0, 58662, 105003, '尼珊德拉'),
(102672, @GROUP_ID+1, @ID+0, '你的清醒是种病！', 14, 0, 100, 0, 0, 58671, 109017, '尼珊德拉 to Player'),
(102672, @GROUP_ID+2, @ID+0, '|TInterface\\Icons\\spell_nature_insect_swarm2:20|t尼珊德拉深呼吸，准备施放|cFFFF0404|Hspell:202977|h[感染吐息]|h|r！', 41, 0, 100, 0, 0, 58667, 106119, '尼珊德拉 to Breath Stalker'),
(102672, @GROUP_ID+3, @ID+0, '深呼吸，拥抱你的命运吧。', 14, 0, 100, 0, 0, 58667, 109011, '尼珊德拉 to Breath Stalker'),
(102672, @GROUP_ID+4, @ID+0, '让内心的黑暗吞噬你们！', 14, 0, 100, 0, 0, 58670, 109016, '尼珊德拉 to Player'),
(102672, @GROUP_ID+5, @ID+0, '我梦到了梦境。现在我醒了……', 14, 0, 100, 0, 0, 58665, 105002, '尼珊德拉 to 泽地歌唱者'),
(102679, @GROUP_ID+0, @ID+0, '生命的希冀已被斩断。梦游者一定会复仇的。', 14, 0, 100, 0, 0, 58510, 106175, '伊森德雷 to Player'),
(102679, @GROUP_ID+1, @ID+0, '来吧，梦游者们……复仇！', 14, 0, 100, 0, 0, 58500, 106176, '伊森德雷 to Player'),
(102679, @GROUP_ID+2, @ID+0, '漫长的梦境……终于降临了。', 14, 0, 100, 0, 0, 58499, 108558, '伊森德雷 to Player'),
(102681, @GROUP_ID+0, @ID+0, '和平稍纵即逝！让梦魇统治世界吧！', 14, 0, 100, 0, 0, 58509, 106181, '泰拉尔 to Player'),
(102682, @GROUP_ID+0, @ID+0, '我能感觉你内心的阴影。邪恶的侵蚀永无止境！', 14, 0, 100, 0, 0, 58508, 106179, '莱索恩'),
(103769, @GROUP_ID+0, @ID+0, '梦魇已经腐蚀了巨龙、神祇和传奇。你也将干脆利落地倒下！', 14, 0, 100, 0, 0, 58726, 109326, '萨维斯'),
(103769, @GROUP_ID+1, @ID+0, '我要让你远离现实世界！', 14, 0, 100, 0, 0, 58747, 109349, '萨维斯 to Player'),
(103769, @GROUP_ID+2, @ID+0, '我要一一踏平你们！', 14, 0, 100, 0, 0, 58750, 109352, '萨维斯'),
(103769, @GROUP_ID+3, @ID+0, '我的任务……还没……完成……', 14, 0, 100, 0, 0, 58746, 109346, '萨维斯 to Player'),
(104636, @GROUP_ID+0, @ID+0, '污染必须被净化！', 14, 0, 100, 0, 0, 58873, 109533, '塞纳留斯 to Player'),
(104636, @GROUP_ID+1, @ID+0, '|TInterface\\Icons\\sha_spell_shadow_shadesofdarkness_nightmare:20|t%s开始施放|cFFFF0000|Hspell:212726|h[梦魇大军]|h|r！', 41, 0, 100, 0, 0, 58863, 111382, '塞纳留斯 to 塞纳留斯'),
(104636, @GROUP_ID+2, @ID+0, '攻击腐化者！', 14, 0, 100, 0, 0, 58863, 109522, '塞纳留斯 to 塞纳留斯'),
(104636, @GROUP_ID+3, @ID+0, '圣藤，缠住腐蚀者！', 14, 0, 100, 0, 0, 58869, 109528, '塞纳留斯'),
(104636, @GROUP_ID+4, @ID+0, '父亲！我……让你失望了……', 14, 0, 100, 0, 0, 58876, 109536, '塞纳留斯 to Player'),
(105393, @GROUP_ID+0, @ID+0, '来吧，小家伙们。品尝恐惧的滋味！', 15, 0, 100, 0, 0, 58911, 109119, '伊格诺斯 to Player'),
(105393, @GROUP_ID+1, @ID+0, '五把钥匙开启了我们的道路。五把火炬照亮了我们的前途。', 15, 0, 100, 0, 0, 58932, 109279, '伊格诺斯 to Player'),
(105393, @GROUP_ID+2, @ID+0, '终于，我们可以饱食一番了。', 15, 0, 100, 0, 0, 58912, 109121, '伊格诺斯 to Player'),
(105393, @GROUP_ID+3, @ID+0, '对我们的每一次攻击，都将被千倍奉还！', 15, 0, 100, 0, 0, 58921, 109141, '伊格诺斯 to Player'),
(105393, @GROUP_ID+4, @ID+0, '你们还要抵抗吗？还要拒绝这份恩赐吗？', 15, 0, 100, 0, 0, 58923, 109143, '伊格诺斯 to Player'),
(105393, @GROUP_ID+5, @ID+0, '恩佐斯……我将回归……尼奥罗萨……', 15, 0, 100, 0, 0, 58924, 109144, '伊格诺斯 to Player'),
(105906, @GROUP_ID+0, @ID+0, '伊格诺斯之眼正在制造梦魇恐魔！', 41, 0, 100, 0, 0, 0, 111379, '伊格诺斯之眼 to 梦魇恐魔'),
(106087, @GROUP_ID+0, @ID+0, '仁慈？休想！我只要奔涌的鲜血和破碎的尸体！', 14, 0, 100, 0, 0, 58625, 108989, '艾乐瑞瑟·雷弗拉尔'),
(106087, @GROUP_ID+1, @ID+0, '|TInterface\\Icons\\ability_hunter_pet_spider.blp:20|t %s宣布|cFFF00000|Hspell:212364|h[喂食时间]|h|r到了。', 41, 0, 100, 0, 0, 58618, 111635, '艾乐瑞瑟·雷弗拉尔'),
(106087, @GROUP_ID+2, @ID+0, '多么可口的小点心！', 14, 0, 100, 0, 0, 58618, 108981, '艾乐瑞瑟·雷弗拉尔'),
(106482, @GROUP_ID+0, @ID+0, '结束了！塞纳留斯被击败了，可我的导师还活着。现在我要集中力量净化他。', 12, 0, 100, 0, 0, 58899, 109563, '玛法里奥·怒风 to Player'),
(106482, @GROUP_ID+1, @ID+0, '萨维斯就在前面的裂隙里，那是梦魇的真正核心。如果有可能，我很想与你们并肩作战，可我……不能进去。', 12, 0, 100, 0, 0, 58900, 109564, '玛法里奥·怒风 to Player'),
(106482, @GROUP_ID+2, @ID+0, '我与梦境的联系赋予了我强大的力量……可这也让我无法抵抗裂隙中的黑暗。我曾窥视过它，知道这是真的。只要踏进那里，我就会迷失……像塞纳留斯一样。', 12, 0, 100, 0, 0, 69640, 109565, '玛法里奥·怒风 to Player'),
(106482, @GROUP_ID+3, @ID+0, '去吧，消灭梦魇之王。只有这样，梦境才能恢复……艾泽拉斯才能得救。', 12, 0, 100, 0, 0, 69639, 109566, '玛法里奥·怒风 to Player'),
(106482, @GROUP_ID+4, @ID+0, '梦魇之虹上有塞纳留斯的气息。它是通往月光林地的传送门，但被黑暗魔法封锁了。我们得斩断束缚它的能量触须。', 14, 0, 100, 0, 0, 61373, 112987, '玛法里奥·怒风 to Player'),
(106482, @GROUP_ID+5, @ID+0, '这里每条道路都散发着邪气。选一条路吧，我会一直陪着你们的。', 14, 0, 100, 0, 0, 61374, 112988, '玛法里奥·怒风 to Player'),
(115784, @GROUP_ID+0, @ID+0, '啾！', 12, 0, 100, 0, 0, 0, 124300, '雪羽雏龙 to 雪羽雏龙');

INSERT IGNORE INTO `npc_spellclick_spells` (`npc_entry`, `spell_id`, `cast_flags`, `user_type`) VALUES
(114296, 227368, 1, 0),
(107448, 213178, 2, 0),
(111208, 221393, 0, 0), -- Conversation - End of Nightmare Raid Shadow Priest
(107772, 234590, 0, 0), -- Send Event
(121014, 241271, 2, 0); -- 正在传送
-- (110903, 220397, UNKNOWN, UNKNOWN);




UPDATE `creature_template` SET `name`='恐钳', `VerifiedBuild`=26124 WHERE `entry`=41420; -- 恐钳
UPDATE `creature_template` SET `name`='腐蚀触须', `VerifiedBuild`=26124 WHERE `entry`=105383; -- 腐蚀触须
UPDATE `creature_template` SET `name`='梦魇恐魔', `VerifiedBuild`=26124 WHERE `entry`=105591; -- 梦魇恐魔
UPDATE `creature_template` SET `name`='死光触须', `VerifiedBuild`=26124 WHERE `entry`=105322; -- 死光触须
UPDATE `creature_template` SET `name`='梦魇脓液', `VerifiedBuild`=26124 WHERE `entry`=105721; -- 梦魇脓液
UPDATE `creature_template` SET `name`='显赫的伯兰', `VerifiedBuild`=26124 WHERE `entry`=111860; -- 显赫的伯兰
UPDATE `creature_template` SET `name`='伊格诺斯之眼', `VerifiedBuild`=26124 WHERE `entry`=105906; -- 伊格诺斯之眼
UPDATE `creature_template` SET `name`='支配触须', `VerifiedBuild`=26124 WHERE `entry`=105304; -- 支配触须
UPDATE `creature_template` SET `name`='伊格诺斯之鞭', `type_flags`=72, `VerifiedBuild`=26124 WHERE `entry`=113920; -- 伊格诺斯之鞭
UPDATE `creature_template` SET `name`='被污染的血瓣花', `VerifiedBuild`=26124 WHERE `entry`=112168; -- 被污染的血瓣花
UPDATE `creature_template` SET `name`='血瓣花鞭笞者', `VerifiedBuild`=26124 WHERE `entry`=112143; -- 血瓣花鞭笞者
UPDATE `creature_template` SET `name`='狂怒的翼手龙', `VerifiedBuild`=26124 WHERE `entry`=113040; -- 狂怒的翼手龙
UPDATE `creature_template` SET `name`='被污染的血瓣花', `VerifiedBuild`=26124 WHERE `entry`=112118; -- 被污染的血瓣花
UPDATE `creature_template` SET `name`='感染的双帆龙', `VerifiedBuild`=26124 WHERE `entry`=113041; -- 感染的双帆龙
UPDATE `creature_template` SET `name`='邪恶的潜伏追猎者', `VerifiedBuild`=26124 WHERE `entry`=107969; -- 邪恶的潜伏追猎者
UPDATE `creature_template` SET `name`='剧毒小蜘蛛', `VerifiedBuild`=26124 WHERE `entry`=107459; -- 剧毒小蜘蛛
UPDATE `creature_template` SET `name`='蛛网', `VerifiedBuild`=26124 WHERE `entry`=109519; -- 蛛网
UPDATE `creature_template` SET `name`='敏捷的小蜘蛛', `VerifiedBuild`=26124 WHERE `entry`=108542; -- 敏捷的小蜘蛛
UPDATE `creature_template` SET `name`='艾乐瑞瑟·雷弗拉尔', `HealthModifier`=342, `VerifiedBuild`=26124 WHERE `entry`=106087; -- 艾乐瑞瑟·雷弗拉尔
UPDATE `creature_template` SET `name`='暗夜蛛母', `VerifiedBuild`=26124 WHERE `entry`=111980; -- 暗夜蛛母
UPDATE `creature_template` SET `VerifiedBuild`=26124 WHERE `entry`=109849; -- Nightmare Spawn Stalker
UPDATE `creature_template` SET `name`='网', `VerifiedBuild`=26124 WHERE `entry`=113625; -- 网
UPDATE `creature_template` SET `name`='剧毒小蜘蛛', `VerifiedBuild`=26124 WHERE `entry`=113626; -- 剧毒小蜘蛛
UPDATE `creature_template` SET `name`='扭曲之影', `VerifiedBuild`=26124 WHERE `entry`=111439; -- 扭曲之影
UPDATE `creature_template` SET `name`='扭曲之影', `VerifiedBuild`=26124 WHERE `entry`=107767; -- 扭曲之影
UPDATE `creature_template` SET `name`='蠕动的卵囊', `VerifiedBuild`=26124 WHERE `entry`=112078; -- 蠕动的卵囊
UPDATE `creature_template` SET `name`='脉动的卵囊', `VerifiedBuild`=26124 WHERE `entry`=108540; -- 脉动的卵囊
UPDATE `creature_template` SET `name`='影羽', `VerifiedBuild`=26124 WHERE `entry`=111975; -- 影羽
UPDATE `creature_template` SET `name`='尖叫小蜘蛛', `VerifiedBuild`=26124 WHERE `entry`=112039; -- 尖叫小蜘蛛
UPDATE `creature_template` SET `VerifiedBuild`=26124 WHERE `entry`=106510; -- Flight Loc Stalker
UPDATE `creature_template` SET `name`='剧毒小蜘蛛', `VerifiedBuild`=26124 WHERE `entry`=111933; -- 剧毒小蜘蛛
UPDATE `creature_template` SET `name`='艾乐瑞瑟·雷弗拉尔', `VerifiedBuild`=26124 WHERE `entry`=113609; -- 艾乐瑞瑟·雷弗拉尔
UPDATE `creature_template` SET `name`='艾乐瑞瑟·雷弗拉尔', `VerifiedBuild`=26124 WHERE `entry`=113604; -- 艾乐瑞瑟·雷弗拉尔
UPDATE `creature_template` SET `name`='梦魇兔', `type`=8, `VerifiedBuild`=26124 WHERE `entry`=113108; -- 梦魇兔
UPDATE `creature_template` SET `name`='生病的山狮', `VerifiedBuild`=26124 WHERE `entry`=113106; -- 生病的山狮
UPDATE `creature_template` SET `name`='腐化的猛鹫', `VerifiedBuild`=26124 WHERE `entry`=113103; -- 腐化的猛鹫
UPDATE `creature_template` SET `name`='感染的瞪羚', `VerifiedBuild`=26124 WHERE `entry`=113093; -- 感染的瞪羚
UPDATE `creature_template` SET `name`='感染的平原陆行鸟', `VerifiedBuild`=26124 WHERE `entry`=113091; -- 感染的平原陆行鸟
UPDATE `creature_template` SET `name`='彩虹', `VerifiedBuild`=26124 WHERE `entry`=113575; -- 彩虹
UPDATE `creature_template` SET `name`='地狱火爪牙' WHERE `entry`=89; -- 地狱火爪牙
UPDATE `creature_template` SET `name`='梦魇幼龙', `VerifiedBuild`=26124 WHERE `entry`=111567; -- 梦魇幼龙
UPDATE `creature_template` SET `name`='潜伏雾魔', `VerifiedBuild`=26124 WHERE `entry`=111331; -- 潜伏雾魔
UPDATE `creature_template` SET `VerifiedBuild`=26124 WHERE `entry`=102930; -- Breath Stalker
UPDATE `creature_template` SET `name`='腐化的害虫', `VerifiedBuild`=26124 WHERE `entry`=111005; -- 腐化的害虫
UPDATE `creature_template` SET `name`='艾瑞达法师杀手', `VerifiedBuild`=26124 WHERE `entry`=114245; -- 艾瑞达法师杀手
UPDATE `creature_template` SET `name`='野兽', `VerifiedBuild`=26124 WHERE `entry`=113347; -- 野兽
UPDATE `creature_template` SET `name`='伊利丹·怒风', `subname`='月之守卫队长', `VerifiedBuild`=26124 WHERE `entry`=113042; -- 伊利丹·怒风
UPDATE `creature_template` SET `name`='古代灵魂', `VerifiedBuild`=26124 WHERE `entry`=113520; -- 古代灵魂
UPDATE `creature_template` SET `name`='玛法里奥·怒风', `VerifiedBuild`=26124 WHERE `entry`=106482; -- 玛法里奥·怒风
UPDATE `creature_template` SET `name`='幼龙之怒', `VerifiedBuild`=26124 WHERE `entry`=113203; -- 幼龙之怒
UPDATE `creature_template` SET `name`='尼珊德拉', `subname`='莎拉达希尔守护者', `VerifiedBuild`=26124 WHERE `entry`=102672; -- 尼珊德拉
UPDATE `creature_template` SET `name`='腐朽软泥怪', `VerifiedBuild`=26124 WHERE `entry`=111004; -- 腐朽软泥怪
UPDATE `creature_template` SET `name`='死根古树', `VerifiedBuild`=26124 WHERE `entry`=111528; -- 死根古树
UPDATE `creature_template` SET `VerifiedBuild`=26124 WHERE `entry`=111412; -- Satyr Channel Cosmetic Stalker
UPDATE `creature_template` SET `VerifiedBuild`=26124 WHERE `entry`=111535; -- Fog Beast Spawner Stalker
UPDATE `creature_template` SET `name`='污心拷问者', `VerifiedBuild`=26124 WHERE `entry`=111355; -- 污心拷问者
UPDATE `creature_template` SET `name`='污心欺诈者', `VerifiedBuild`=26124 WHERE `entry`=111333; -- 污心欺诈者
UPDATE `creature_template` SET `name`='污心腐蚀者', `VerifiedBuild`=26124 WHERE `entry`=111354; -- 污心腐蚀者
UPDATE `creature_template` SET `name`='梦魇精华', `VerifiedBuild`=26124 WHERE `entry`=113113; -- 梦魇精华
UPDATE `creature_template` SET `name`='腐化的害虫', `VerifiedBuild`=26124 WHERE `entry`=102998; -- 腐化的害虫
UPDATE `creature_template` SET `name`='咒缚船长', `subname`='集魂者', `VerifiedBuild`=26124 WHERE `entry`=105710; -- 咒缚船长
UPDATE `creature_template` SET `name`='冥口唤雾者', `VerifiedBuild`=26124 WHERE `entry`=105502; -- 冥口唤雾者
UPDATE `creature_template` SET `name`='浮骸' WHERE `entry`=99929; -- 浮骸
UPDATE `creature_template` SET `name`='薇德克丝夫人' WHERE `entry`=117956; -- 薇德克丝夫人
UPDATE `creature_template` SET `name`='邪火祈愿者', `femaleName`='邪火祈愿者', `subname`='绿火教派' WHERE `entry`=117949; -- 邪火祈愿者
UPDATE `creature_template` SET `modelid1`=46831, `name`='茂茂', `type_flags`=1, `HealthModifier`=1.5, `VerifiedBuild`=26124 WHERE `entry`=50864; -- 茂茂
UPDATE `creature_template` SET `name`='梦魇古树', `HealthModifier`=26.624, `VerifiedBuild`=26124 WHERE `entry`=105468; -- 梦魇古树
UPDATE `creature_template` SET `name`='腐化小精灵', `VerifiedBuild`=26124 WHERE `entry`=106304; -- 腐化小精灵
UPDATE `creature_template` SET `name`='翡翠幼龙', `VerifiedBuild`=26124 WHERE `entry`=106809; -- 翡翠幼龙
UPDATE `creature_template` SET `name`='腐化的翡翠龙蛋', `VerifiedBuild`=26124 WHERE `entry`=106898; -- 腐化的翡翠龙蛋
UPDATE `creature_template` SET `name`='梦魇树苗', `VerifiedBuild`=26124 WHERE `entry`=106427; -- 梦魇树苗
UPDATE `creature_template` SET `name`='被折磨的幽魂', `VerifiedBuild`=26124 WHERE `entry`=106895; -- 被折磨的幽魂
UPDATE `creature_template` SET `name`='纠缠梦魇', `VerifiedBuild`=26124 WHERE `entry`=112320; -- 纠缠梦魇
UPDATE `creature_template` SET `name`='塞纳留斯', `HealthModifier`=262.08, `VerifiedBuild`=26124 WHERE `entry`=104636; -- 塞纳留斯
UPDATE `creature_template` SET `name`='艾林裂隙', `VerifiedBuild`=26124 WHERE `entry`=113533; -- 艾林裂隙
UPDATE `creature_template` SET `VerifiedBuild`=26124 WHERE `entry`=112263; -- Druid Channel Cosmetic Stalker
UPDATE `creature_template` SET `name`='恐魂腐蚀者', `femaleName`='恐魂腐蚀者', `VerifiedBuild`=26124 WHERE `entry`=112261; -- 恐魂腐蚀者
UPDATE `creature_template` SET `name`='恐魂污染者', `femaleName`='恐魂污染者', `VerifiedBuild`=26124 WHERE `entry`=112260; -- 恐魂污染者
UPDATE `creature_template` SET `name`='巨豹之灵', `VerifiedBuild`=26124 WHERE `entry`=11957; -- 巨豹之灵
UPDATE `creature_template` SET `name`='巨熊之灵', `VerifiedBuild`=26124 WHERE `entry`=11956; -- 巨熊之灵
UPDATE `creature_template` SET `name`='腐化的金蟾', `VerifiedBuild`=26124 WHERE `entry`=113049; -- 腐化的金蟾
UPDATE `creature_template` SET `name`='腐化的鹿', `VerifiedBuild`=26124 WHERE `entry`=113048; -- 腐化的鹿
UPDATE `creature_template` SET `name`='强势梦魇', `VerifiedBuild`=26124 WHERE `entry`=109249; -- 强势梦魇
UPDATE `creature_template` SET `name`='腐化的丝翅蛾', `VerifiedBuild`=26124 WHERE `entry`=113050; -- 腐化的丝翅蛾
UPDATE `creature_template` SET `name`='梦魇花蕾', `VerifiedBuild`=26124 WHERE `entry`=102804; -- 梦魇花蕾
UPDATE `creature_template` SET `name`='被亵渎的德鲁伊之魂', `femaleName`='被亵渎的德鲁伊之魂', `VerifiedBuild`=26124 WHERE `entry`=103080; -- 被亵渎的德鲁伊之魂
UPDATE `creature_template` SET `name`='莱索恩', `subname`='伊森德雷的梦魇', `VerifiedBuild`=26124 WHERE `entry`=102682; -- 莱索恩
UPDATE `creature_template` SET `name`='渗漏之雾', `VerifiedBuild`=26124 WHERE `entry`=113214; -- 渗漏之雾
UPDATE `creature_template` SET `name`='泰拉尔', `subname`='伊森德雷的梦魇', `VerifiedBuild`=26124 WHERE `entry`=102681; -- 泰拉尔
UPDATE `creature_template` SET `name`='伊森德雷', `VerifiedBuild`=26124 WHERE `entry`=102679; -- 伊森德雷
UPDATE `creature_template` SET `name`='暗影裂隙', `VerifiedBuild`=26124 WHERE `entry`=103396; -- 暗影裂隙
UPDATE `creature_template` SET `name`='梦魇裂隙', `VerifiedBuild`=26124 WHERE `entry`=103395; -- 梦魇裂隙
UPDATE `creature_template` SET `name`='罗索斯', `subname`='噩梦守护者', `VerifiedBuild`=26124 WHERE `entry`=111852; -- 罗索斯
UPDATE `creature_template` SET `name`='病态裂隙', `VerifiedBuild`=26124 WHERE `entry`=103378; -- 病态裂隙
UPDATE `creature_template` SET `name`='集群恐魔', `VerifiedBuild`=26124 WHERE `entry`=113092; -- 集群恐魔
UPDATE `creature_template` SET `name`='腐化的守门者', `VerifiedBuild`=26124 WHERE `entry`=113090; -- 腐化的守门者
UPDATE `creature_template` SET `name`='被亵渎的守护者', `VerifiedBuild`=26124 WHERE `entry`=113089; -- 被亵渎的守护者
UPDATE `creature_template` SET `name`='玛法里奥·怒风', `VerifiedBuild`=26124 WHERE `entry`=106482; -- 玛法里奥·怒风
UPDATE `creature_template` SET `name`='彩虹', `VerifiedBuild`=26124 WHERE `entry`=113575; -- 彩虹
UPDATE `creature_template` SET `name`='幽灵豹', `VerifiedBuild`=26124 WHERE `entry`=3619; -- 幽灵豹
UPDATE `creature_template` SET `modelid1`=17093, `name`='罗纳克', `type_flags`=65537, `HealthModifier`=1.5, `VerifiedBuild`=26124 WHERE `entry`=50346; -- 罗纳克
UPDATE `creature_template` SET `name`='恐怖幽灵', `VerifiedBuild`=26124 WHERE `entry`=112178; -- 恐怖幽灵
UPDATE `creature_template` SET `name`='野兽', `VerifiedBuild`=26124 WHERE `entry`=113347; -- 野兽
UPDATE `creature_template` SET `name`='堕落图腾', `VerifiedBuild`=26124 WHERE `entry`=112474; -- 堕落图腾
UPDATE `creature_template` SET `KillCredit1`=120365, `name`='恐刃歼灭者', `VignetteID`=1852, `VerifiedBuild`=26124 WHERE `entry`=117095; -- 恐刃歼灭者
UPDATE `creature_template` SET `name`='青铜始祖龙宝宝', `type`=12, `movementId`=121, `VerifiedBuild`=26124 WHERE `entry`=124858; -- 青铜始祖龙宝宝
UPDATE `creature_template` SET `name`='暴龙王克鲁什', `VerifiedBuild`=26124 WHERE `entry`=32485; -- 暴龙王克鲁什
UPDATE `creature_template` SET `name`='古代灵魂', `VerifiedBuild`=26124 WHERE `entry`=113520; -- 古代灵魂
UPDATE `creature_template` SET `name`='可怕的雄鹰', `VerifiedBuild`=26124 WHERE `entry`=112303; -- 可怕的雄鹰
UPDATE `creature_template` SET `name`='梦魇触须', `VerifiedBuild`=26124 WHERE `entry`=112307; -- 梦魇触须
UPDATE `creature_template` SET `name`='乌索克', `subname`='被诅咒的巨熊之神', `HealthModifier`=371.621, `VerifiedBuild`=26124 WHERE `entry`=100497; -- 乌索克
UPDATE `creature_template` SET `name`='守卫者鲁森', `VerifiedBuild`=26124 WHERE `entry`=111858; -- 守卫者鲁森
UPDATE `creature_template` SET `name`='守卫者高罗克', `VerifiedBuild`=26124 WHERE `entry`=111856; -- 守卫者高罗克
UPDATE `creature_template` SET `name`='可怕的雄鹰', `VerifiedBuild`=26124 WHERE `entry`=112290; -- 可怕的雄鹰
UPDATE `creature_template` SET `name`='腐化的触须', `VerifiedBuild`=26124 WHERE `entry`=113088; -- 腐化的触须
UPDATE `creature_template` SET `name`='灰熊诱捕者', `VerifiedBuild`=26124 WHERE `entry`=112162; -- 灰熊诱捕者
UPDATE `creature_template` SET `name`='可怕的萨满', `VerifiedBuild`=26124 WHERE `entry`=112153; -- 可怕的萨满
UPDATE `creature_template` SET `name`='虚空残渣', `VerifiedBuild`=26124 WHERE `entry`=111208; -- 虚空残渣
UPDATE `creature_template` SET `name`='泰拉尔' WHERE `entry`=106478; -- 泰拉尔
UPDATE `creature_template` SET `name`='莱索恩' WHERE `entry`=106477; -- 莱索恩
UPDATE `creature_template` SET `name`='艾莫莉丝' WHERE `entry`=106475; -- 艾莫莉丝
UPDATE `creature_template` SET `name`='伊森德雷' WHERE `entry`=106474; -- 伊森德雷
UPDATE `creature_template` SET `name`='林地精龙' WHERE `entry`=106544; -- 林地精龙
UPDATE `creature_template` SET `name`='绍恩·月爪', `subname`='谷地大德鲁伊' WHERE `entry`=106543; -- 绍恩·月爪
UPDATE `creature_template` SET `name`='埃洛瑟尔', `subname`='传承大德鲁伊' WHERE `entry`=106540; -- 埃洛瑟尔
UPDATE `creature_template` SET `name`='艾乐瑞瑟·雷弗拉尔', `subname`='谷地大德鲁伊' WHERE `entry`=106539; -- 艾乐瑞瑟·雷弗拉尔
UPDATE `creature_template` SET `name`='林地精龙' WHERE `entry`=106531; -- 林地精龙
UPDATE `creature_template` SET `name`='乌索克' WHERE `entry`=106463; -- 乌索克
UPDATE `creature_template` SET `name`='塞纳留斯' WHERE `entry`=106088; -- 塞纳留斯
UPDATE `creature_template` SET `name`='青翠古树' WHERE `entry`=106008; -- 青翠古树
UPDATE `creature_template` SET `name`='翡翠树妖' WHERE `entry`=105996; -- 翡翠树妖
UPDATE `creature_template` SET `name`='伊瑟拉' WHERE `entry`=106385; -- 伊瑟拉
UPDATE `creature_template` SET `name`='梦缚德鲁伊' WHERE `entry`=106381; -- 梦缚德鲁伊
UPDATE `creature_template` SET `name`='梦缚德鲁伊', `femaleName`='梦缚德鲁伊' WHERE `entry`=106380; -- 梦缚德鲁伊
UPDATE `creature_template` SET `name`='梦缚德鲁伊' WHERE `entry`=106379; -- 梦缚德鲁伊
UPDATE `creature_template` SET `name`='梦缚德鲁伊', `femaleName`='梦缚德鲁伊' WHERE `entry`=106015; -- 梦缚德鲁伊
UPDATE `creature_template` SET `name`='梦境之灵' WHERE `entry`=106010; -- 梦境之灵
UPDATE `creature_template` SET `name`='梦境龙宝宝' WHERE `entry`=97206; -- 梦境龙宝宝
UPDATE `creature_template` SET `name`='梦魇触须' WHERE `entry`=104592; -- 梦魇触须
UPDATE `creature_template` SET `name`='梦魇之刃' WHERE `entry`=104422; -- 梦魇之刃
UPDATE `creature_template` SET `name`='潜伏恐魔' WHERE `entry`=103694; -- 潜伏恐魔
UPDATE `creature_template` SET `name`='沉眠版' WHERE `entry`=104096; -- 沉眠版
UPDATE `creature_template` SET `name`='伊瑟拉之梦', `subname`='觉醒者' WHERE `entry`=105245; -- 伊瑟拉之梦
UPDATE `creature_template` SET `name`='疯狂生物' WHERE `entry`=110732; -- 疯狂生物
UPDATE `creature_template` SET `name`='暗影碾压者' WHERE `entry`=111405; -- 暗影碾压者
UPDATE `creature_template` SET `name`='梦魇融合怪' WHERE `entry`=111398; -- 梦魇融合怪
UPDATE `creature_template` SET `name`='野兽', `VerifiedBuild`=26124 WHERE `entry`=113347; -- 野兽
UPDATE `creature_template` SET `name`='鲜血魔狼' WHERE `entry`=97930; -- 鲜血魔狼
UPDATE `creature_template` SET `name`='黑暗吞噬者' WHERE `entry`=111413; -- 黑暗吞噬者
UPDATE `creature_template` SET `name`='红玉守护者', `rank`=1, `family`=128, `type_flags`=65645, `type_flags2`=129, `VerifiedBuild`=26124 WHERE `entry`=59915; -- 红玉守护者
UPDATE `creature_template` SET `name`='暗影生物' WHERE `entry`=111370; -- 暗影生物
UPDATE `creature_template` SET `name`='恐惧憎恶' WHERE `entry`=105343; -- 恐惧憎恶
UPDATE `creature_template` SET `name`='飞掠之影' WHERE `entry`=111350; -- 飞掠之影
UPDATE `creature_template` SET `name`='竞技场边界' WHERE `entry`=104548; -- 竞技场边界
UPDATE `creature_template` SET `name`='艾林裂隙' WHERE `entry`=109847; -- 艾林裂隙


UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=41420 AND `Idx`=0); -- 恐钳
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=102672 AND `Idx`=1); -- 尼珊德拉
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=102672 AND `Idx`=0); -- 尼珊德拉
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91308 AND `Idx`=1); -- 逐日圣马
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=91308 AND `Idx`=0); -- 逐日圣马
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=106920 AND `Idx`=1); -- 覆羽徘徊者
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=106920 AND `Idx`=0); -- 覆羽徘徊者
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=92450 AND `Idx`=0); -- 艾瑞达裂隙制造者
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=92447 AND `Idx`=0); -- 混沌之子
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=106516 AND `Idx`=0); -- 苍穹占星家
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=106356 AND `Idx`=0); -- 苍穹咒术师
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=106514 AND `Idx`=0); -- 苍穹学徒
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=92445 AND `Idx`=0); -- 恶魔卫士入侵者
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=111414 AND `Idx`=0); -- 盐鳞石斑鱼
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=114904 AND `Idx`=0); -- 灵魂引擎狱卒
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=113127 AND `Idx`=0); -- 崖翼天爪鹰
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=113122 AND `Idx`=0); -- 苏拉玛崖箭猪
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=111397 AND `Idx`=2); -- 痛苦的裂天龙
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=111397 AND `Idx`=1); -- 痛苦的裂天龙
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=111397 AND `Idx`=0); -- 痛苦的裂天龙
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=118499 AND `Idx`=0); -- 邪爪巢母
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=104636 AND `Idx`=3); -- 塞纳留斯
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=104636 AND `Idx`=2); -- 塞纳留斯
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=104636 AND `Idx`=1); -- 塞纳留斯
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=104636 AND `Idx`=0); -- 塞纳留斯
UPDATE `creature_questitem` SET `VerifiedBuild`=26124 WHERE (`CreatureEntry`=132062 AND `Idx`=0); -- 锈水劳工


UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251555; -- 伊格诺斯之眼力场
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248850; -- 根须墙
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248849; -- 根须墙
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248848; -- 占位符
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251997; -- 传送门
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254248; -- 腐化的能量水晶
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254249; -- 腐化的能量水晶
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254247; -- 腐化的能量水晶
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=255000; -- 扭曲根须
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251995; -- 传送门
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251980; -- 梦魇之虹
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254273; -- 翡翠梦境之路
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254271; -- 雷霆崖
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254272; -- 灰熊丘陵
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254270; -- 安戈洛环形山
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248927; -- 雷霆崖藤蔓
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248925; -- 入口藤蔓
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248928; -- 灰色藤蔓
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248929; -- 巨龙之藤
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248926; -- 安戈洛藤蔓
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=260550; -- Doodad_7DU_Nightmare_RootWall008
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=260552; -- Doodad_7DU_Nightmare_RootWall010
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=260551; -- Doodad_7DU_Nightmare_RootWall009
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251534; -- 占位符
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251533; -- 占位符
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251536; -- 占位符
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251535; -- 占位符
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254168; -- 梦魇战利品
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=252003; -- 传送门
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=252006; -- 传送门
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=260552; -- Doodad_7DU_Nightmare_RootWall010
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=260551; -- Doodad_7DU_Nightmare_RootWall009
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=260550; -- Doodad_7DU_Nightmare_RootWall008
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251536; -- 占位符
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251535; -- 占位符
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251534; -- 占位符
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251533; -- 占位符
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254273; -- 翡翠梦境之路
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254272; -- 灰熊丘陵
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254271; -- 雷霆崖
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=254270; -- 安戈洛环形山
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248929; -- 巨龙之藤
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248928; -- 灰色藤蔓
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248927; -- 雷霆崖藤蔓
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248926; -- 安戈洛藤蔓
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=248925; -- 入口藤蔓
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=251980; -- 梦魇之虹
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=252043; -- 门
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=252042; -- 门
UPDATE `gameobject_template` SET `VerifiedBuild`=26124 WHERE `entry`=252004; -- 传送门


UPDATE `gameobject_questitem` SET `VerifiedBuild`=26124 WHERE (`GameObjectEntry`=265474 AND `Idx`=0); -- 邪能箱
UPDATE `gameobject_questitem` SET `VerifiedBuild`=26124 WHERE (`GameObjectEntry`=254168 AND `Idx`=0); -- 梦魇战利品

DELETE FROM `npc_text` WHERE `ID`=28979;
INSERT INTO `npc_text` (`ID`, `Probability0`, `Probability1`, `Probability2`, `Probability3`, `Probability4`, `Probability5`, `Probability6`, `Probability7`, `BroadcastTextId0`, `BroadcastTextId1`, `BroadcastTextId2`, `BroadcastTextId3`, `BroadcastTextId4`, `BroadcastTextId5`, `BroadcastTextId6`, `BroadcastTextId7`, `VerifiedBuild`) VALUES
(28979, 1, 0, 0, 0, 0, 0, 0, 0, 109584, 0, 0, 0, 0, 0, 0, 0, 26124); -- 28979

UPDATE `npc_text` SET `VerifiedBuild`=26124 WHERE `ID`=29003; -- 29003
UPDATE `npc_text` SET `VerifiedBuild`=26124 WHERE `ID`=30512; -- 30512
UPDATE `npc_text` SET `VerifiedBuild`=26124 WHERE `ID`=29001; -- 29001
UPDATE `npc_text` SET `VerifiedBuild`=26124 WHERE `ID`=30502; -- 30502
UPDATE `npc_text` SET `VerifiedBuild`=26124 WHERE `ID`=14783; -- 14783
UPDATE `npc_text` SET `VerifiedBuild`=26124 WHERE `ID`=32670; -- 32670
UPDATE `npc_text` SET `VerifiedBuild`=26124 WHERE `ID`=32453; -- 32453
UPDATE `npc_text` SET `VerifiedBuild`=26124 WHERE `ID`=32448; -- 32448
UPDATE `npc_text` SET `VerifiedBuild`=26124 WHERE `ID`=32623; -- 32623

