# File name: 7.3.5_25996_二月-21-1319 - WoWDump.awps.pkt
# Detected build: V7_3_5_25996
# Parsing date: 02/28/2018 20:21:46
# 
DELETE FROM `areatrigger_template` WHERE `Id` IN (15564, 15192, 15543, 15542, 15489, 15809, 16915, 16623, 16524, 16226, 16717, 16716, 16882, 15490, 16384, 15667, 15613, 15711, 3983, 15632, 15422, 15416, 15701, 15708, 15717, 15822, 16113, 15813, 15846, 16404, 15829, 15792, 15828, 15827, 15608, 16360, 15849, 10595, 10007, 13324, 14825, 14917, 15084, 14893, 15283, 14763, 15380, 14865, 15240);
INSERT INTO `areatrigger_template` (`Id`, `Type`, `Flags`, `Data0`, `Data1`, `Data2`, `Data3`, `Data4`, `Data5`, `VerifiedBuild`) VALUES
(15564, 0, 0, 5, 5, 0, 0, 0, 0, 25996),
(15192, 0, 0, 5, 5, 0, 0, 0, 0, 25996),
(15543, 0, 0, 4, 4, 0, 0, 0, 0, 25996),
(15542, 3, 0, 0, 0, 0, 0, 0, 0, 25996),
(15489, 0, 4, 6, 6, 0, 0, 0, 0, 25996),
(15809, 0, 0, 4, 4, 0, 0, 0, 0, 25996),
(16915, 4, 4, 1, 1, 7, 7, 3, 3, 25996),
(16623, 0, 4, 5, 5, 0, 0, 0, 0, 25996),
(16524, 4, 4, 5, 5, 6, 6, 2, 2, 25996),
(16226, 3, 0, 0, 0, 0, 0, 0, 0, 25996),
(16717, 4, 0, 2, 2, 6, 6, 0.3, 0.3, 25996),
(16716, 4, 0, 2, 2, 6, 6, 0.3, 0.3, 25996),
(16882, 3, 0, 0, 0, 0, 0, 0, 0, 25996),
(15490, 4, 2, 1, 1, 6, 6, 0.3, 0.3, 25996),
(16384, 0, 4, 12, 12, 0, 0, 0, 0, 25996),
(15667, 0, 4, 4, 4, 0, 0, 0, 0, 25996),
(15613, 0, 4, 5, 5, 0, 0, 0, 0, 25996),
(15711, 4, 4, 2, 2, 3, 3, 0.3, 0.3, 25996),
(3983, 0, 0, 8, 8, 0, 0, 0, 0, 25996),
(15632, 4, 4, 7, 7, 4, 4, 0.3, 0.3, 25996),
(15422, 0, 0, 5, 5, 0, 0, 0, 0, 25996),
(15416, 0, 0, 100, 100, 0, 0, 0, 0, 25996),
(15701, 0, 4, 4, 4, 0, 0, 0, 0, 25996),
(15708, 0, 1026, 3, 3, 0, 0, 0, 0, 25996),
(15717, 3, 4, 0, 0, 0, 0, 0, 0, 25996),
(15822, 1, 4, 25, 25, 7.5, 25, 25, 7.5, 25996),
(16113, 1, 0, 9, 3, 5, 9, 3, 5, 25996),
(15813, 0, 4, 4, 4, 0, 0, 0, 0, 25996),
(15846, 1, 4, 0.5, 6, 2.5, 0.5, 6, 2.5, 25996),
(16404, 1, 0, 15, 2.5, 5, 15, 2.5, 5, 25996),
(15829, 0, 4, 4, 4, 0, 0, 0, 0, 25996),
(15792, 0, 4, 3, 3, 0, 0, 0, 0, 25996),
(15828, 0, 4, 3, 3, 0, 0, 0, 0, 25996),
(15827, 0, 4, 3, 3, 0, 0, 0, 0, 25996),
(15608, 0, 4, 1, 1, 0, 0, 0, 0, 25996),
(16360, 4, 4, 2, 2, 6, 6, 0.3, 0.3, 25996),
(15849, 1, 4, 2.5, 2.5, 0.5, 2.5, 2.5, 0.5, 25996),
(10595, 3, 2, 0, 0, 0, 0, 0, 0, 25996),
(10007, 3, 0, 5.000732, 5.000732, 0, 0, 0, 0, 25996),
(13324, 0, 16, 3, 3, 0, 0, 0, 0, 25996),
(14825, 0, 4, 6, 6, 0, 0, 0, 0, 25996),
(14917, 0, 0, 7, 7, 0, 0, 0, 0, 25996),
(15084, 0, 6, 30, 30, 0, 0, 0, 0, 25996),
(14893, 0, 6, 3, 3, 0, 0, 0, 0, 25996),
(15283, 0, 4, 4, 4, 0, 0, 0, 0, 25996),
(14763, 0, 0, 4, 4, 0, 0, 0, 0, 25996),
(15380, 0, 4, 4, 4, 0, 0, 0, 0, 25996),
(14865, 0, 0, 4, 4, 0, 0, 0, 0, 25996),
(15240, 0, 4, 10, 10, 0, 0, 0, 0, 25996);

UPDATE `areatrigger_template` SET `Flags`=1031 WHERE `Id`=10003;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=3678;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=9170;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=3282;
UPDATE `areatrigger_template` SET `Flags`=0 WHERE `Id`=9482;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=11692;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=12983;
UPDATE `areatrigger_template` SET `Flags`=0 WHERE `Id`=9397;
UPDATE `areatrigger_template` SET `Flags`=5 WHERE `Id`=10003;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=11492;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=10718;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=16555;
UPDATE `areatrigger_template` SET `Type`=1, `Data0`=2.5, `Data1`=2.5, `Data2`=3, `Data3`=2.5, `Data4`=2.5, `Data5`=3 WHERE `Id`=6197;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=11023;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=6094;
UPDATE `areatrigger_template` SET `Type`=1, `Data0`=22, `Data1`=8, `Data2`=2.5, `Data3`=22, `Data4`=8, `Data5`=2.5 WHERE `Id`=0;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=10583;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=11376;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=10314;
UPDATE `areatrigger_template` SET `VerifiedBuild`=25996 WHERE `Id`=6095;



DELETE FROM `spell_areatrigger` WHERE  (`AreaTriggerId`=15564) OR (`AreaTriggerId`=15192) OR (`AreaTriggerId`=15543) OR (`AreaTriggerId`=15542) OR (`AreaTriggerId`=15489) OR (`AreaTriggerId`=15809)  OR (`AreaTriggerId`=16915) OR (`AreaTriggerId`=16623) OR (`AreaTriggerId`=16524) OR (`AreaTriggerId`=16226) OR (`AreaTriggerId`=16716) OR (`AreaTriggerId`=16717) OR (`AreaTriggerId`=16882) OR (`AreaTriggerId`=15490) OR (`AreaTriggerId`=16384)  OR (`AreaTriggerId`=15667) OR (`AreaTriggerId`=15613) OR (`AreaTriggerId`=15711)  OR (`AreaTriggerId`=16555) OR (`AreaTriggerId`=3983)  OR (`AreaTriggerId`=15632) OR (`AreaTriggerId`=15422)  OR (`AreaTriggerId`=15416) OR (`AreaTriggerId`=15701) OR (`AreaTriggerId`=15708) OR (`AreaTriggerId`=15717) OR (`AreaTriggerId`=15822)  OR (`AreaTriggerId`=16113) OR (`AreaTriggerId`=15846) OR (`AreaTriggerId`=15813) OR (`AreaTriggerId`=15829) OR (`AreaTriggerId`=15792) OR (`AreaTriggerId`=15828) OR (`AreaTriggerId`=15827) OR (`AreaTriggerId`=15608) OR (`AreaTriggerId`=16360) OR (`AreaTriggerId`=15849) OR (`AreaTriggerId`=10595) OR (`AreaTriggerId`=11376)  OR (`AreaTriggerId`=10007) OR (`AreaTriggerId`=13324) OR (`AreaTriggerId`=14825) OR (`AreaTriggerId`=14917) OR (`AreaTriggerId`=15084) OR (`AreaTriggerId`=14893) OR (`AreaTriggerId`=15283) OR (`AreaTriggerId`=14763) OR (`AreaTriggerId`=15380) OR (`AreaTriggerId`=14865) OR (`AreaTriggerId`=15240);
INSERT IGNORE INTO `spell_areatrigger` (`SpellMiscId`, `AreaTriggerId`, `MoveCurveId`, `ScaleCurveId`, `MorphCurveId`, `FacingCurveId`, `DecalPropertiesId`, `TimeToTarget`, `TimeToTargetScale`, `VerifiedBuild`) VALUES
(10735, 15564, 0, 0, 0, 0, 0, 0, 15000, 25996), -- SpellId : 245250 不稳定的裂隙
(10323, 15192, 0, 0, 0, 0, 0, 0, 30000, 25996), -- SpellId : 241512 部署复原矩阵
(10711, 15543, 0, 0, 0, 0, 26, 0, 10000, 25996), -- SpellId : 245083 暗影觉醒
(10710, 15542, 0, 0, 0, 0, 0, 4286, 10000, 25996), -- SpellId : 245069 暗影觉醒
(10655, 15489, 0, 0, 0, 0, 0, 0, 0, 25996), -- SpellId : 244707 减速沙尘
(11000, 15809, 3252, 0, 0, 0, 0, 0, 12000, 25996), -- SpellId : 247899 烈焰花环
(11938, 16915, 0, 0, 0, 0, 0, 0, 0, 25996), -- SpellId : 256389 重组模块
(11934, 16623, 0, 0, 0, 0, 0, 0, 0, 25996), -- SpellId : 256338 生命缚誓者的恩赐
(11831, 16524, 0, 0, 0, 0, 0, 0, 60000, 25996), -- SpellId : 255199 阿格拉玛的化身
(11468, 16226, 0, 0, 0, 0, 0, 0, 10000, 25996), -- SpellId : 252136 湮灭刀锋
(12005, 16716, 0, 0, 0, 0, 0, 0, 10000, 25996), -- SpellId : 257306 海洋之赐
(12006, 16717, 0, 0, 0, 0, 0, 0, 10000, 25996), -- SpellId : 257313 天空之赐
(11032, 16882, 0, 0, 0, 0, 201, 0, 0, 25996), -- SpellId : 248166 死亡之锥
(10653, 15490, 3131, 3132, 0, 0, 0, 7000, 7000, 25996), -- SpellId : 244718 烈焰之迹
(11695, 16384, 0, 0, 0, 0, 0, 0, 0, 25996), -- SpellId : 244894 腐蚀盾牌
(10837, 15667, 0, 0, 0, 0, 0, 0, 0, 25996), -- SpellId : 246198 燃烧之风
(10782, 15613, 0, 0, 0, 0, 0, 0, 0, 25996), -- SpellId : 245630 飞旋的军刀
(10889, 15711, 0, 0, 0, 0, 0, 0, 0, 25996), -- SpellId : 246763 高戈奈斯之怒
(11869, 16555, 0, 0, 0, 0, 0, 2500, 2500, 25996), -- SpellId : 251947 烈焰之波
(11870, 16555, 0, 0, 0, 0, 0, 2500, 2500, 25996), -- SpellId : 251947 烈焰之波
(11871, 16555, 0, 0, 0, 0, 0, 2500, 2500, 25996), -- SpellId : 251947 烈焰之波
(11872, 16555, 0, 0, 0, 0, 0, 2500, 2500, 25996), -- SpellId : 251947 烈焰之波
(718, 3983, 0, 0, 0, 0, 0, 0, 8000, 25996), -- SpellId : 116844 平心之环
(10807, 15632, 0, 0, 0, 0, 63, 0, 0, 25996), -- SpellId : 245910 诺甘农的幽灵军团
(10577, 15422, 0, 0, 0, 0, 0, 0, 5000, 25996), -- SpellId : 244003 黑暗裂隙
(10571, 15416, 0, 0, 0, 0, 0, 0, 280000, 25996), -- SpellId : 243967 烈焰折磨
(10875, 15701, 0, 0, 0, 0, 0, 0, 6000, 25996), -- SpellId : 246667 歼灭
(10886, 15708, 0, 3200, 0, 0, 0, 0, 600000, 25996), -- SpellId : 246746 恶魔炸弹
(10895, 15717, 0, 0, 0, 0, 0, 0, 6000, 25996), -- SpellId : 255618 毁灭者
(11015, 15822, 0, 0, 0, 0, 0, 0, 0, 25996), -- SpellId : 248048 净化协议
(11356, 16113, 0, 0, 0, 0, 0, 0, 2000, 25996), -- SpellId : 251035 召唤虚空追猎者
(11006, 15846, 0, 0, 0, 0, 0, 0, 120000, 25996), -- SpellId : 247955 炸弹引线
(11004, 15813, 0, 0, 0, 0, 0, 0, 120000, 25996), -- SpellId : 247944 霰弹爆破
(11021, 15829, 0, 0, 0, 0, 0, 0, 0, 25996), -- SpellId : 247939 霰弹爆破
(10981, 15792, 0, 0, 0, 0, 0, 0, 120000, 25996), -- SpellId : 247637 静滞陷阱
(10989, 15828, 0, 0, 0, 0, 0, 0, 120000, 25996), -- SpellId : 247668 脉冲手雷
(11020, 15827, 0, 0, 0, 0, 0, 0, 60000, 25996), -- SpellId : 247397 脉冲手雷
(10780, 15608, 0, 0, 0, 0, 0, 0, 600000, 25996), -- SpellId : 245628 时空裂痕
(11665, 16360, 0, 0, 0, 0, 0, 0, 0, 25996), -- SpellId : 253754 生命宝珠
(11034, 15849, 0, 0, 0, 0, 0, 0, 0, 25996), -- SpellId : 248222 跳板
(5903, 10595, 0, 0, 0, 0, 0, 0, 12500, 25996), -- SpellId : 203090 力场新星
(6870, 11376, 0, 0, 0, 0, 0, 0, 10000, 25996), -- SpellId : 211204 奥术切割者
(5285, 10007, 0, 0, 0, 0, 0, 0, 120000, 25996), -- SpellId : 196806 虚空链接
(9322, 13324, 0, 0, 0, 0, 0, 8000, 8000, 25996), -- SpellId : 232453 鱼人冲锋
(9934, 14825, 0, 0, 0, 0, 0, 0, 600000, 25996), -- SpellId : 239350 阿格拉玛之盾
(10035, 14917, 0, 0, 0, 0, 62, 0, 30000, 25996), -- SpellId : 239278 恶毒之网
(10213, 15084, 0, 2846, 0, 0, 39, 0, 30000, 25996), -- SpellId : 239161 永默之书
(10010, 14893, 0, 2831, 0, 0, 13, 0, 30000, 25996), -- SpellId : 239146 投掷冰霜宝典
(10426, 15283, 0, 0, 0, 0, 0, 0, 33000, 25996), -- SpellId : 238674 锁定
(9866, 14763, 0, 0, 0, 0, 22, 0, 20000, 25996), -- SpellId : 237320 剧毒花粉
(10527, 15380, 0, 0, 0, 0, 0, 0, 33000, 25996), -- SpellId : 243613 锁定
(9975, 14865, 0, 0, 0, 0, 63, 0, 45000, 25996), -- SpellId : 238655 暗影波
(10378, 15240, 0, 0, 0, 0, 0, 0, 10000, 25996); -- SpellId : 241598 暗影墙



DELETE FROM `gameobject_template_addon` WHERE `entry` IN (268666 /*控制台*/, 273012 /*心跳*/, 273008 /*心跳*/, 273009 /*心跳*/, 273010 /*心跳*/, 273011 /*心跳*/, 273006 /*心跳*/, 273007 /*心跳*/, 268667 /*安全门*/, 268659 /*安全门*/, 268480 /*泰坦控制面板*/, 270860 /*能量导管*/, 270859 /*能量导管*/, 270857 /*传送台*/, 270858 /*能量导管*/, 270713 /*邮箱*/, 272379 /*安多哈尔之战*/, 272243 /*联盟军旗*/, 272230 /*风车*/, 272242 /*部落战旗*/, 272231 /*树*/, 272248 /*圆盘*/, 278492 /*冒险者的指令板*/, 278217 /*艾洛达尔水晶*/, 277355 /*万神殿的宝藏*/, 277477 /*277477*/, 272718 /*Doodad_7DU_ArgusRaid_GasEmitter003*/, 272721 /*Doodad_7DU_ArgusRaid_GasEmitter006*/, 272722 /*Doodad_7DU_ArgusRaid_GasEmitter007*/, 278828 /*278828*/, 278831 /*278831*/, 272717 /*Doodad_7DU_ArgusRaid_GasEmitter002*/, 272719 /*Doodad_7DU_ArgusRaid_GasEmitter004*/, 272720 /*Doodad_7DU_ArgusRaid_GasEmitter005*/, 272723 /*Doodad_7DU_ArgusRaid_GasEmitter008*/, 272716 /*Doodad_7DU_ArgusRaid_GasEmitter001*/, 278829 /*278829*/, 278830 /*278830*/, 273686 /*门*/, 272868 /*神殿大门*/, 277476 /*277476*/, 277180 /*门*/, 277179 /*门*/, 272485 /*神殿大门*/, 272486 /*神殿大门*/, 276474 /*导管*/, 276475 /*导管*/, 273911 /*防爆门*/, 277531 /*277531*/, 276292 /*Doodad_7DU_ArgusRaid_EngineerGate004*/, 276293 /*Doodad_7DU_ArgusRaid_EngineerGate005*/, 276294 /*Doodad_7DU_ArgusRaid_EngineerGate006*/, 276288 /*Doodad_7DU_ArgusRaid_EngineerGate001*/, 276289 /*Doodad_7DU_ArgusRaid_EngineerGate002*/, 276290 /*Doodad_7DU_ArgusRaid_EngineerGate003*/, 276476 /*导管*/, 276477 /*导管*/, 276503 /*生命的恩赐*/, 272683 /*帕拉克希斯号*/, 273688 /*门*/, 273687 /*门*/, 277381 /*传送门*/, 277521 /*277521*/, 277132 /*传送门*/, 277474 /*传送门*/, 277133 /*传送门*/, 277475 /*传送门*/, 268708 /*Doodad_7DU_TombofSargeras_Mephistroth_RoomVFX_Fel001*/, 269173 /*阿格拉玛之盾*/, 269939 /*军团储物箱*/, 269121 /*邪能屏障*/, 269122 /*邪能屏障*/, 269224 /*Doodad_7DU_TombofSargeras_GardenDoor004*/, 269222 /*Doodad_7DU_TombofSargeras_GardenDoor002*/, 268372 /*Doodad_7DU_TombofSargeras_CircularBookCase001*/, 268375 /*Doodad_7DU_TombofSargeras_CircularBookCase004*/, 268712 /*门*/, 268710 /*门*/, 268711 /*门*/, 268680 /*门*/, 268373 /*Doodad_7DU_TombofSargeras_CircularBookCase002*/, 268374 /*Doodad_7DU_TombofSargeras_CircularBookCase003*/, 268713 /*门*/, 268709 /*门*/, 269042 /*门*/, 269221 /*Doodad_7DU_TombofSargeras_GardenDoor001*/, 269223 /*Doodad_7DU_TombofSargeras_GardenDoor003*/, 268714 /*门*/);
INSERT INTO `gameobject_template_addon` (`entry`, `faction`, `flags`) VALUES
(268666, 0, 16), -- 控制台
(273012, 0, 32), -- 心跳
(273008, 0, 32), -- 心跳
(273009, 0, 32), -- 心跳
(273010, 0, 32), -- 心跳
(273011, 0, 32), -- 心跳
(273006, 0, 32), -- 心跳
(273007, 0, 32), -- 心跳
(268667, 0, 32), -- 安全门
(268659, 0, 32), -- 安全门
(268480, 0, 16), -- 泰坦控制面板
(270860, 0, 262144), -- 能量导管
(270859, 0, 262144), -- 能量导管
(270857, 0, 262144), -- 传送台
(270858, 0, 262144), -- 能量导管
(270713, 1735, 0), -- 邮箱
(272379, 0, 32), -- 安多哈尔之战
(272243, 114, 0), -- 联盟军旗
(272230, 114, 0), -- 风车
(272242, 114, 0), -- 部落战旗
(272231, 114, 0), -- 树
(272248, 114, 32), -- 圆盘
(278492, 35, 262144), -- 冒险者的指令板
(278217, 0, 262176), -- 艾洛达尔水晶
(277355, 94, 2113568), -- 万神殿的宝藏
(277477, 0, 16), -- 277477
(272718, 1375, 16), -- Doodad_7DU_ArgusRaid_GasEmitter003
(272721, 1375, 16), -- Doodad_7DU_ArgusRaid_GasEmitter006
(272722, 1375, 16), -- Doodad_7DU_ArgusRaid_GasEmitter007
(278828, 1375, 16), -- 278828
(278831, 1375, 16), -- 278831
(272717, 1375, 16), -- Doodad_7DU_ArgusRaid_GasEmitter002
(272719, 1375, 16), -- Doodad_7DU_ArgusRaid_GasEmitter004
(272720, 1375, 16), -- Doodad_7DU_ArgusRaid_GasEmitter005
(272723, 1375, 16), -- Doodad_7DU_ArgusRaid_GasEmitter008
(272716, 1375, 16), -- Doodad_7DU_ArgusRaid_GasEmitter001
(278829, 1375, 16), -- 278829
(278830, 1375, 16), -- 278830
(273686, 0, 48), -- 门
(272868, 0, 32), -- 神殿大门
(277476, 1375, 50), -- 277476
(277180, 114, 32), -- 门
(277179, 114, 32), -- 门
(272485, 1375, 48), -- 神殿大门
(272486, 1375, 50), -- 神殿大门
(276474, 114, 0), -- 导管
(276475, 114, 0), -- 导管
(273911, 0, 48), -- 防爆门
(277531, 0, 48), -- 277531
(276292, 0, 48), -- Doodad_7DU_ArgusRaid_EngineerGate004
(276293, 0, 48), -- Doodad_7DU_ArgusRaid_EngineerGate005
(276294, 0, 48), -- Doodad_7DU_ArgusRaid_EngineerGate006
(276288, 0, 48), -- Doodad_7DU_ArgusRaid_EngineerGate001
(276289, 0, 48), -- Doodad_7DU_ArgusRaid_EngineerGate002
(276290, 0, 48), -- Doodad_7DU_ArgusRaid_EngineerGate003
(276476, 114, 32), -- 导管
(276477, 114, 32), -- 导管
(276503, 94, 16416), -- 生命的恩赐
(272683, 0, 1048608), -- 帕拉克希斯号
(273688, 1375, 32), -- 门
(273687, 1375, 32), -- 门
(277381, 0, 32), -- 传送门
(277521, 0, 48), -- 277521
(277132, 0, 32), -- 传送门
(277474, 0, 32), -- 传送门
(277133, 0, 32), -- 传送门
(277475, 0, 32), -- 传送门
(268708, 1375, 16), -- Doodad_7DU_TombofSargeras_Mephistroth_RoomVFX_Fel001
(269173, 0, 16), -- 阿格拉玛之盾
(269939, 0, 278560), -- 军团储物箱
(269121, 0, 48), -- 邪能屏障
(269122, 0, 48), -- 邪能屏障
(269224, 1375, 48), -- Doodad_7DU_TombofSargeras_GardenDoor004
(269222, 1375, 48), -- Doodad_7DU_TombofSargeras_GardenDoor002
(268372, 0, 48), -- Doodad_7DU_TombofSargeras_CircularBookCase001
(268375, 0, 48), -- Doodad_7DU_TombofSargeras_CircularBookCase004
(268712, 0, 32), -- 门
(268710, 0, 48), -- 门
(268711, 0, 32), -- 门
(268680, 0, 48), -- 门
(268373, 0, 48), -- Doodad_7DU_TombofSargeras_CircularBookCase002
(268374, 0, 48), -- Doodad_7DU_TombofSargeras_CircularBookCase003
(268713, 0, 32), -- 门
(268709, 0, 48), -- 门
(269042, 0, 32), -- 门
(269221, 1375, 48), -- Doodad_7DU_TombofSargeras_GardenDoor001
(269223, 1375, 48), -- Doodad_7DU_TombofSargeras_GardenDoor003
(268714, 0, 32); -- 门

UPDATE `gameobject_template_addon` SET `flags`=4 WHERE `entry`=244579; -- 缚法隔离层
UPDATE `gameobject_template_addon` SET `faction`=94 WHERE `entry`=244598; -- 下水道箱子
UPDATE `gameobject_template_addon` SET `flags`=4 WHERE `entry`=244578; -- 炼金烈焰
UPDATE `gameobject_template_addon` SET `flags`=278528 WHERE `entry`=191133; -- 泰坦神铁矿脉
UPDATE `gameobject_template_addon` SET `flags`=32 WHERE `entry`=201759; -- 灵魂洪炉闸门
UPDATE `gameobject_template_addon` SET `flags`=278528 WHERE `entry`=190169; -- 卷丹
UPDATE `gameobject_template_addon` SET `flags`=278528 WHERE `entry`=191019; -- 蛇信草
UPDATE `gameobject_template_addon` SET `flags`=278528 WHERE `entry`=189980; -- 萨隆邪铁矿脉
UPDATE `gameobject_template_addon` SET `flags`=278528 WHERE `entry`=191303; -- 火棘花
UPDATE `gameobject_template_addon` SET `faction`=35, `flags`=8192 WHERE `entry`=214516; -- Instance Portal (Party + Heroic)
UPDATE `gameobject_template_addon` SET `flags`=278528 WHERE `entry`=190173; -- 冰冷的草药
UPDATE `gameobject_template_addon` SET `flags`=2097156 WHERE `entry`=188489; -- 红玉丁香
UPDATE `gameobject_template_addon` SET `flags`=278528 WHERE `entry`=189973; -- 金苜蓿
UPDATE `gameobject_template_addon` SET `faction`=35, `flags`=8192 WHERE `entry`=214441; -- Instance Portal (Raid 4 Difficulties)
UPDATE `gameobject_template_addon` SET `faction`=35, `flags`=8192 WHERE `entry`=214536; -- Instance Portal (Raid 10/25 No Heroic)
UPDATE `gameobject_template_addon` SET `flags`=262144 WHERE `entry`=273245; -- 维迪卡尔矩阵核心
UPDATE `gameobject_template_addon` SET `flags`=48 WHERE `entry`=250635; -- 门
UPDATE `gameobject_template_addon` SET `flags`=50 WHERE `entry`=252164; -- 墓穴栅栏
UPDATE `gameobject_template_addon` SET `flags`=48 WHERE `entry`=250636; -- 门
UPDATE `gameobject_template_addon` SET `flags`=48 WHERE `entry`=250277; -- 门
UPDATE `gameobject_template_addon` SET `flags`=48 WHERE `entry`=250634; -- 门
UPDATE `gameobject_template_addon` SET `flags`=50 WHERE `entry`=250275; -- 门
UPDATE `gameobject_template_addon` SET `flags`=50 WHERE `entry`=250274; -- 门
UPDATE `gameobject_template_addon` SET `flags`=48 WHERE `entry`=250278; -- 门
UPDATE `gameobject_template_addon` SET `flags`=48 WHERE `entry`=250434; -- 门
UPDATE `gameobject_template_addon` SET `flags`=4 WHERE `entry`=250576; -- 强能法力宝石


SET NAMES 'latin1';
DELETE FROM `scene_template` WHERE (`SceneId`=1757 AND `ScriptPackageID`=1935) OR (`SceneId`=1750 AND `ScriptPackageID`=1932) OR (`SceneId`=1800 AND `ScriptPackageID`=1957) OR (`SceneId`=1773 AND `ScriptPackageID`=1880) OR (`SceneId`=1803 AND `ScriptPackageID`=1904) OR (`SceneId`=1789 AND `ScriptPackageID`=1956) OR (`SceneId`=1802 AND `ScriptPackageID`=1903) OR (`SceneId`=1817 AND `ScriptPackageID`=1964) OR (`SceneId`=1706 AND `ScriptPackageID`=1889);
INSERT INTO `scene_template` (`SceneId`, `Flags`, `ScriptPackageID`) VALUES
(1757, 16, 1935),
(1750, 4, 1932),
(1800, 16, 1957),
(1773, 27, 1880),
(1803, 16, 1904),
(1789, 16, 1956),
(1802, 16, 1903),
(1817, 20, 1964),
(1706, 20, 1889);

SET NAMES 'utf8';
DELETE FROM `quest_offer_reward` WHERE `ID` IN (47330 /*-Unknown-*/, 47559 /*-Unknown-*/, 47810 /*-Unknown-*/, 47643 /*-Unknown-*/, 47550 /*-Unknown-*/, 47545 /*-Unknown-*/, 47543 /*-Unknown-*/, 49077 /*-Unknown-*/, 50432 /*-Unknown-*/, 49015 /*-Unknown-*/, 48280 /*-Unknown-*/, 48277 /*-Unknown-*/, 46251 /*-Unknown-*/, 47137 /*-Unknown-*/);
INSERT INTO `quest_offer_reward` (`ID`, `Emote1`, `Emote2`, `Emote3`, `Emote4`, `EmoteDelay1`, `EmoteDelay2`, `EmoteDelay3`, `EmoteDelay4`, `RewardText`, `VerifiedBuild`) VALUES
(47330, 603, 1, 0, 0, 0, 0, 0, 0, '这个警告真不是个好兆头，$n。艾泽拉斯的命运似乎与军团的老家——阿古斯密切相关。$b$b我们必须弄清黑暗泰坦的计划！我相信代言人与世界之魂的联系对此至关重要。$b$b保持警惕，$ct。我们必须相信麦格尼……和艾泽拉斯的指引。', 25996), -- -Unknown-
(47559, 0, 0, 0, 0, 0, 0, 0, 0, '把那个时光碎片交给我，$n，如果你不介意的话。', 25996), -- -Unknown-
(47810, 1, 0, 0, 0, 0, 0, 0, 0, '在你的帮助下，古树又能安宁地沉睡了。谢谢你，$r。', 25996), -- -Unknown-
(47643, 5, 0, 0, 0, 0, 0, 0, 0, '根据古树给我们提供的线索，肯定就是这个地方。一定是了！$b$b我们上吧，$n！', 25996), -- -Unknown-
(47550, 0, 0, 0, 0, 0, 0, 0, 0, '十五分钟并不算宽裕。我们必须快速行动起来。', 25996), -- -Unknown-
(47545, 0, 0, 0, 0, 0, 0, 0, 0, '我想，我们的线索实在是够用了。\n\n哇哦，这个想杀我的人考虑很周全嘛！', 25996), -- -Unknown-
(47543, 0, 0, 0, 0, 0, 0, 0, 0, '情况不妙，是吧？也许下次会好点。', 25996), -- -Unknown-
(49077, 0, 0, 0, 0, 0, 0, 0, 0, '<将伊利丹的水晶带到永恒之井后，你感觉到一阵满足，就仿佛完成了一个轮回。$b$b无论他是英雄还是叛徒……也许两者兼有……又或者全都不是……可伊利丹有他的使命。$b$b你也一样。>', 25996), -- -Unknown-
(50432, 1, 1, 0, 0, 0, 0, 0, 0, '太棒了！真是奇迹！我终于明白了，就像泰坦在跟我说话一般！他们告诉了我怎样使用这些精华来打造世上最精美的护甲，但结果有点……难以预料。$b$b<维迪尔骄傲地微笑着。>$b$b哈，你还在等什么？快去给我找点觉醒精华！', 25996), -- -Unknown-
(49015, 1, 0, 0, 0, 0, 0, 0, 0, '结束了。终于，燃烧的远征画上了句号。$b$b谢谢你的帮助，$n。如果让阿古斯为萨格拉斯的黑暗万神殿提供能量，那萨格拉斯就真的无人能敌了。$b$b我代表德莱尼，代表艾瑞达，代表无数个被燃烧军团毁灭的世界……$b$b感谢你。', 25996), -- -Unknown-
(48280, 1, 0, 0, 0, 0, 0, 0, 0, '我们的答案就在军团位于安托鲁斯内部的传送门网络中。', 25996), -- -Unknown-
(48277, 1, 0, 0, 0, 0, 0, 0, 0, '你来的正是时候。', 25996), -- -Unknown-
(46251, 1, 1, 0, 0, 0, 0, 0, 0, '有人已经向我指出，我有时候开的玩笑太过火。$b$b这次……<清了清喉咙>的玩笑可能也有点过火了。$b$b其实我的实验只需要一个虚空碎片就足够了。不过我相信剩余的碎片对你还是很有用的。$b$b这个话题就到此为止吧。', 25996), -- -Unknown-
(47137, 1, 1, 0, 0, 0, 0, 0, 0, '我们的事业又新增了一名强大的盟友！$b$b你再次增强了我们对抗军团的力量，$n。', 25996); -- -Unknown-

UPDATE `quest_offer_reward` SET `Emote1`=1, `RewardText`='很高兴看到这片土地上还有人对古老的种族表示出善意。我祝福你，$n，收下这件礼物吧……', `VerifiedBuild`=25996 WHERE `ID`=13018; -- -Unknown-


DELETE FROM `quest_details` WHERE `ID` IN (47772 /*-Unknown-*/, 47559 /*-Unknown-*/, 47810 /*-Unknown-*/, 47904 /*-Unknown-*/, 47643 /*-Unknown-*/, 47550 /*-Unknown-*/, 47545 /*-Unknown-*/, 47543 /*-Unknown-*/, 49077 /*-Unknown-*/, 48280 /*-Unknown-*/, 48277 /*-Unknown-*/, 47139 /*-Unknown-*/, 46251 /*-Unknown-*/);
INSERT INTO `quest_details` (`ID`, `Emote1`, `Emote2`, `Emote3`, `Emote4`, `EmoteDelay1`, `EmoteDelay2`, `EmoteDelay3`, `EmoteDelay4`, `VerifiedBuild`) VALUES
(47772, 0, 0, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(47559, 0, 0, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(47810, 1, 6, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(47904, 0, 0, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(47643, 0, 0, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(47550, 0, 0, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(47545, 0, 0, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(47543, 0, 0, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(49077, 396, 396, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(48280, 1, 1, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(48277, 1, 1, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(47139, 0, 0, 0, 0, 0, 0, 0, 0, 25996), -- -Unknown-
(46251, 0, 0, 0, 0, 0, 0, 0, 0, 25996); -- -Unknown-


DELETE FROM `quest_request_items` WHERE `ID` IN (48021 /*-Unknown-*/, 47772 /*-Unknown-*/, 46251 /*-Unknown-*/);
INSERT INTO `quest_request_items` (`ID`, `EmoteOnComplete`, `EmoteOnIncomplete`, `EmoteOnCompleteDelay`, `EmoteOnIncompleteDelay`, `CompletionText`, `VerifiedBuild`) VALUES
(48021, 0, 0, 0, 0, '穿越时空的运气如何？', 25996), -- -Unknown-
(47772, 0, 0, 0, 0, '怎么样？只要端掉部落大炮，我就可以逃走了。', 25996), -- -Unknown-
(46251, 0, 0, 0, 0, '你拿到碎片了？我希望你没有数错。如果你数错了，出了什么事我可不负责。', 25996); -- -Unknown-


DELETE FROM `creature_template_addon` WHERE `entry` IN (116323 /*116323 (下水道贱民)*/, 119892 /*119892 (麦格尼·铜须) - -Unknown-*/, 120971 /*120971 (生命侍女)*/, 120486 /*120486 (痛苦聚合体) - -Unknown-*/, 120487 /*120487 (梦魇恐魔) - -Unknown-*/, 120472 /*120472 (令人不安的残影) - -Unknown-*/, 120470 /*120470 (凝结的梦魇) - -Unknown-*/, 119895 /*119895 (防御构装体) - -Unknown-, -Unknown-*/, 122929 /*122929 (虚空触须) - -Unknown-*/, 120111 /*120111 (Trigger Bunny)*/, 120479 /*120479 (蠕行恐魔) - -Unknown-*/, 120484 /*120484 (鬼魅幻影) - -Unknown-*/, 121008 /*121008 (不安的绝望) - -Unknown-*/, 120489 /*120489 (痛苦幻象) - -Unknown-*/, 120488 /*120488 (防御节点) - -Unknown-*/, 121244 /*121244 (Azeroth's Warning Nightmare Bunny) - -Unknown-*/, 120974 /*120974 (监控构造体)*/, 28069 /*28069 (索拉查卫士)*/, 28641 /*28641 (凋零的身体)*/, 29066 /*29066 (泰坦哨兵)*/, 32492 /*32492 (霜巢雌龙)*/, 29124 /*29124 (源血元素) - -Unknown-, -Unknown-*/, 29123 /*29123 (天灾巨怪)*/, 28108 /*28108 (骨镰劫掠者)*/, 28096 /*28096 (硬皮冲锋者)*/, 28101 /*28101 (损毁的天灾怪)*/, 28217 /*28217 (受伤的雨声神谕者) - -Unknown-*/, 28574 /*28574 (玛尔文·摇链)*/, 28568 /*28568 (塔玛拉·摇链)*/, 28746 /*28746 (飞行员维克)*/, 24653 /*24653 (飞行器)*/, 28315 /*28315 (萨满祭司维克伊克)*/, 30362 /*30362 (长者杉德雷) - -Unknown-*/, 28463 /*28463 (River's Heart Bunny)*/, 28010 /*28010 (搁浅的蛇颈龙) - -Unknown-*/, 29036 /*29036 (弗蕾亚的仆从) - -Unknown-, -Unknown-, -Unknown-*/, 28002 /*28002 (蛮藤谷鳄鱼)*/, 62815 /*62815 (黄蟾蜍)*/, 28011 /*28011 (帝王眼镜蛇)*/, 28098 /*28098 (硬皮抢夺者)*/, 28466 /*28466 (Fruit Tosser)*/, 28086 /*28086 (蓝玉虫巢巨蜂)*/, 28085 /*28085 (蓝玉虫巢雄蜂)*/, 28129 /*28129 (食草长颈鹿)*/, 25793 /*25793 (回收机器人55-D型)*/, 25781 /*25781 (油坑) - -Unknown-, -Unknown-*/, 25743 /*25743 (雄性长毛猛犸象)*/, 26598 /*26598 (米丝蒂·飞晨)*/, 24613 /*24613 (猛犸幼崽)*/, 25780 /*25780 (阿布尼·扭矩)*/, 24614 /*24614 (长毛猛犸象)*/, 26804 /*26804 (Fizzcrank Bomber Invisible Bunny)*/, 26602 /*26602 (卡拉·芒星)*/, 26597 /*26597 (“母鹅”托比·铁栓)*/, 25747 /*25747 (金吉·温纳特)*/, 26596 /*26596 (查莉·诺斯托)*/, 25767 /*25767 (菲兹兰克飞行员)*/, 25702 /*25702 (墨尔杜·旋轮)*/, 25434 /*25434 (犸格莫斯碾压者)*/, 25590 /*25590 (菲兹兰克·铁阀)*/, 25428 /*25428 (犸格莫斯萨满祭司)*/, 26619 /*26619 (菲兹兰克伞兵)*/, 26601 /*26601 (菲兹兰克飞行员)*/, 25429 /*25429 (犸格莫斯劫掠者)*/, 62697 /*62697 (油腻软泥怪)*/, 25752 /*25752 (清除机器人004-A8型) - -Unknown-*/, 25670 /*25670 (ELM General Purpose Bunny (scale x3))*/, 24957 /*24957 (诅咒教派药剂师)*/, 25660 /*25660 (生疮的食尸鬼)*/, 26126 /*26126 (白骨战士)*/, 25758 /*25758 (防御坦克66D型)*/, 25814 /*25814 (菲兹兰克机械侏儒)*/, 25753 /*25753 (警戒机器人57-K型)*/, 32544 /*32544 (蒸汽云雾)*/, 25677 /*25677 (北风蛙)*/, 25739 /*25739 (蒸汽喷泉口)*/, 26725 /*26725 (驯风者奥里尔) - -Unknown-*/, 62695 /*62695 (北风土拨鼠)*/, 26041 /*26041 (Lightning Target)*/, 31685 /*31685 (北风土拨鼠)*/, 25680 /*25680 (沼泽驯鹿)*/, 25454 /*25454 (苔原爬虫)*/, 25700 /*25700 (鳄鱼人猎手)*/, 25701 /*25701 (掘泥鳄鱼人)*/, 25699 /*25699 (污泥鳄鱼人)*/, 26094 /*26094 (Naxxanar Caster)*/, 25452 /*25452 (天灾猛犸)*/, 26174 /*26174 (食腐秃鹰)*/, 26162 /*26162 (Transborea Generator 001)*/, 25715 /*25715 (冰冷元素)*/, 26156 /*26156 (沃图克)*/, 26413 /*26413 (阿努巴尔恐怖编织者)*/, 26402 /*26402 (阿努巴尔伏击者) - -Unknown-*/, 26281 /*26281 (眠月魔犬)*/, 26455 /*26455 (眠月神殿上层精灵)*/, 26837 /*26837 (萨蕾德亚娜)*/, 27056 /*27056 (哨兵琪珊·清泉)*/, 27054 /*27054 (莫度鲁)*/, 27119 /*27119 (雪足)*/, 27052 /*27052 (诺哈因)*/, 26459 /*26459 (指挥官塞雅·蓝钢)*/, 26881 /*26881 (帕蕾娜·银云)*/, 26973 /*26973 (典狱官朱蒂·月歌)*/, 26673 /*26673 (大法师茉德拉的影像)*/, 27055 /*27055 (哨兵蓝塔娜·琥珀)*/, 30358 /*30358 (长者墨尔希) - -Unknown-*/, 26276 /*26276 (魔枢守护者)*/, 62693 /*62693 (极地野兔)*/, 26448 /*26448 (群星之墓哨兵)*/, 26482 /*26482 (极地灰熊)*/, 27749 /*27749 (部落援兵)*/, 27763 /*27763 (瓦加斯塔兹)*/, 29328 /*29328 (极地野兔)*/, 26838 /*26838 (恐怖之爪)*/, 27725 /*27725 (红玉守护者)*/, 27533 /*27533 (冰冷恶鬼)*/, 27369 /*27369 (Necromantic Rune Bunny)*/, 27680 /*27680 (达莉亚)*/, 27539 /*27539 (冰冷通灵师)*/, 33704 /*33704 (冰冷憎恶)*/, 27572 /*27572 (Ruby Controller Bunny)*/, 27542 /*27542 (红玉警戒者)*/, 27531 /*27531 (进攻的冰冷憎恶)*/, 27589 /*27589 (Ruby Strafe Bunny)*/, 27686 /*27686 (进攻的冰冷恶鬼)*/, 27564 /*27564 (联盟援兵)*/, 27006 /*27006 (裂骨者) - -Unknown-*/, 26889 /*26889 (The End of the Line Area Trigger Kill Credit Bunny)*/, 26836 /*26836 (吉加托尔)*/, 27698 /*27698 (Defending Wyrmrest Temple Kill Credit Bunny)*/, 24879 /*24879 (北极云雾)*/, 26816 /*26816 (魔法焦点巫师)*/, 32572 /*32572 (龙骨荒野法师猎手)*/, 27279 /*27279 (雪原萨满祭司)*/, 27278 /*27278 (雪原狂战士)*/, 26480 /*26480 (猛犸人幼体)*/, 26295 /*26295 (猛犸人族长)*/, 27294 /*27294 (苔原食腐豺狼)*/, 26443 /*26443 (塔里奥斯塔兹)*/, 26705 /*26705 (雪原徒工)*/, 26481 /*26481 (猛犸人突击者)*/, 26271 /*26271 (衰弱的雄性猛犸象)*/, 26272 /*26272 (瘦弱的猛犸象)*/, 62852 /*62852 (龙骨幼鸟)*/, 26273 /*26273 (衰弱的猛犸象幼崽)*/, 124100 /*124100 (药剂师蒂林丝) - -Unknown-*/, 124103 /*124103 (塔乐莎·韧皮)*/, 124104 /*124104 (妖术师贾昆达)*/, 124101 /*124101 (萝比·电压)*/, 124102 /*124102 (格罗索格)*/, 124074 /*124074 (亡灵卫兵战地队长)*/, 124379 /*124379 (阿德林·韧皮)*/, 123662 /*123662 (龙眠神殿)*/, 124072 /*124072 (联盟战地指挥官)*/, 124096 /*124096 (布里格斯)*/, 124154 /*124154 (克罗米)*/, 124052 /*124052 (部落攻城火炮) - -Unknown-, -Unknown-*/, 124053 /*124053 (联盟攻城火炮) - -Unknown-, -Unknown-*/, 124073 /*124073 (亡灵卫兵) - -Unknown-, -Unknown-*/, 124071 /*124071 (联盟防御者) - -Unknown-*/, 122875 /*122875 (萨拉斯·维索恩) - -Unknown-*/, 123458 /*123458 (梦境折磨者)*/, 122545 /*122545 (奥德拉长老)*/, 122547 /*122547 (巴克隆)*/, 122546 /*122546 (布鲁彼得)*/, 122544 /*122544 (护园者尼瑟拉)*/, 122548 /*122548 (翡翠天爪枭)*/, 122549 /*122549 (翡翠鞭笞者)*/, 122522 /*122522 (破冰者)*/, 122552 /*122552 (魔网元素)*/, 122551 /*122551 (魔网浮龙)*/, 122550 /*122550 (克雷苟斯)*/, 122524 /*122524 (食血者)*/, 27804 /*27804 (古拉克·石拳)*/, 26483 /*26483 (龙骨秃鹫)*/, 122513 /*122513 (伊萨里奥斯勋爵) - -Unknown-*/, 122514 /*122514 (卡雷苟斯) - -Unknown-*/, 122510 /*122510 (克罗米) - -Unknown-*/, 122511 /*122511 (阿莱克丝塔萨，生命的缚誓者) - -Unknown-*/, 125249 /*125249 (返回现在) - -Unknown-*/, 30078 /*30078 ([DND]Wyrmrest Temple Beam Target)*/, 23155 /*23155 (Invisible Stalker (Scale x3)) - -Unknown-*/, 26983 /*26983 (奥拉斯塔萨)*/, 26851 /*26851 (奈瑟斯塔兹)*/, 27950 /*27950 (德米斯塔兹)*/, 27948 /*27948 (莉塞拉)*/, 27803 /*27803 (劳莉耶尔·图布雷)*/, 27575 /*27575 (阿弗拉沙斯塔兹)*/, 27608 /*27608 (碧蓝巨龙)*/, 27682 /*27682 (碧蓝幼龙)*/, 34381 /*34381 ([DND]Northrend Children's Week Trigger)*/, 32533 /*32533 (希尔丝塔萨)*/, 38017 /*38017 (卡雷苟斯)*/, 27765 /*27765 (纳莉丝)*/, 27785 /*27785 (伊萨里奥斯勋爵)*/, 27856 /*27856 (克罗米)*/, 26917 /*26917 (阿莱克丝塔萨，生命的缚誓者)*/, 27990 /*27990 (克拉苏斯)*/, 26949 /*26949 (托拉斯塔萨)*/, 26925 /*26925 (龙眠神殿幼龙)*/, 26933 /*26933 (龙眠神殿守护者)*/, 113865 /*113865 (梦魇之门)*/, 71304 /*71304 (爱莉丝·月梦)*/, 129211 /*129211 (泰兰德·语风)*/, 129210 /*129210 (玛法里奥·怒风)*/, 129209 /*129209 (伊利丹·怒风)*/, 118003 /*118003 (洛拉希尔哨兵) - -Unknown-, -Unknown-*/, 83588 /*83588 (阳光幼苗)*/, 70082 /*70082 (皮埃尔) - -Unknown-*/, 126070 /*126070 (光铸技师) - -Unknown-*/, 128949 /*128949 (先知维伦)*/, 129896 /*129896 (光铸百夫长) - -Unknown-*/, 129829 /*129829 (高阶女祭司伊莎娜)*/, 129793 /*129793 (侦察地图)*/, 129897 /*129897 (光铸牧师) - -Unknown-*/, 129871 /*129871 (救赎者阿拉托尔)*/, 129872 /*129872 (温蕾萨·风行者)*/, 129429 /*129429 (艾洛达尔水晶)*/, 129722 /*129722 (泰坦能量微粒)*/, 127809 /*127809 (起源重组模块) - -Unknown-*/, 129635 /*129635 (饥饿灵魂) - -Unknown-, -Unknown-*/, 129386 /*129386 (生命缚誓者的恩赐) - -Unknown-*/, 127192 /*127192 (星圣管理官) - -Unknown-*/, 126268 /*126268 (高戈奈斯) - -Unknown-*/, 126266 /*126266 (诺甘农)*/, 126267 /*126267 (艾欧娜尔)*/, 127458 /*127458 (萨奇尔)*/, 127473 /*127473 (萨拉塔斯)*/, 128466 /*128466 (艾露尼斯)*/, 124828 /*124828 (寂灭者阿古斯) - -Unknown-, -Unknown-*/, 125885 /*125885 (阿曼苏尔) - -Unknown-*/, 125886 /*125886 (卡兹格罗斯) - -Unknown-, -Unknown-*/, 125893 /*125893 (阿格拉玛)*/, 128169 /*128169 (麦格尼·铜须) - -Unknown-*/, 122581 /*122581 (烈焰之迹)*/, 121975 /*121975 (阿格拉玛) - -Unknown-, -Unknown-*/, 127470 /*127470 (萨拉塔斯)*/, 127455 /*127455 (萨奇尔)*/, 128464 /*128464 (艾露尼斯)*/, 123680 /*123680 (黑暗守护者艾迪斯) - -Unknown-*/, 124166 /*124166 (卡兹格罗斯的痛苦) - -Unknown-*/, 125837 /*125837 (阿曼苏尔的痛苦)*/, 124164 /*124164 (高戈奈斯的痛苦)*/, 123503 /*123503 (诺甘农的痛苦) - -Unknown-*/, 122643 /*122643 (瓦里玛萨斯之影) - -Unknown-*/, 122590 /*122590 (瓦里玛萨斯之影) - -Unknown-*/, 122809 /*122809 (诺甘农之魂)*/, 122781 /*122781 (卡兹格罗斯之魂)*/, 122814 /*122814 (高戈奈斯之魂)*/, 128311 /*128311 (破坏魔女巫会)*/, 127472 /*127472 (萨拉塔斯)*/, 126084 /*126084 (阿曼苏尔之魂)*/, 127457 /*127457 (萨奇尔)*/, 124913 /*124913 (麦格尼·铜须)*/, 128095 /*128095 (鞭笞姐妹)*/, 128060 /*128060 (狂乱的女祭司)*/, 122467 /*122467 (奥萨拉，黑夜之母) - -Unknown-*/, 122468 /*122468 (诺拉，烈焰之母) - -Unknown-*/, 122366 /*122366 (瓦里玛萨斯) - -Unknown-*/, 122469 /*122469 (蒂玛，幽影之母) - -Unknown-*/, 127471 /*127471 (萨拉塔斯)*/, 128465 /*128465 (艾露尼斯)*/, 127456 /*127456 (萨奇尔)*/, 128304 /*128304 (光铸道标)*/, 123533 /*123533 (塔尼斯) - -Unknown-, -Unknown-*/, 123532 /*123532 (黑暗卫士) - -Unknown-, -Unknown-*/, 123929 /*123929 (加洛西破坏者) - -Unknown-*/, 123906 /*123906 (加洛西歼灭者) - -Unknown-*/, 123921 /*123921 (加洛西屠戮者) - -Unknown-*/, 125462 /*125462 (Apocalypse Blast Stalker)*/, 124879 /*124879 (焚化追猎者) - -Unknown-*/, 122634 /*122634 (地狱塔楼)*/, 122578 /*122578 (金加洛斯) - -Unknown-*/, 127230 /*127230 (加洛西歼灭者)*/, 127235 /*127235 (加洛西破坏者)*/, 127231 /*127231 (加洛西屠戮者)*/, 124889 /*124889 (火炮轰击) - -Unknown-*/, 124704 /*124704 (轰炸) - -Unknown-*/, 127469 /*127469 (萨拉塔斯)*/, 127454 /*127454 (萨奇尔)*/, 128463 /*128463 (艾露尼斯)*/, 128303 /*128303 (光铸道标)*/, 125692 /*125692 (猎魂者伊墨纳尔) - -Unknown-*/, 124158 /*124158 (猎魂者伊墨纳尔)*/, 128154 /*128154 (加洛西灭世者)*/, 124550 /*124550 (烈火)*/, 126678 /*126678 (维迪卡尔火炮)*/, 125717 /*125717 (码头卫兵)*/, 124686 /*124686 (陷阱！)*/, 129876 /*129876 (大技师罗姆尔)*/, 125691 /*125691 (大法师卡德加)*/, 125720 /*125720 (光铸道标)*/, 125682 /*125682 (先知维伦)*/, 125683 /*125683 (伊利丹·怒风)*/, 125689 /*125689 (奥蕾莉亚·风行者)*/, 126426 /*126426 (维迪卡尔) - -Unknown-*/, 127963 /*127963 (光铸战争机甲)*/, 127856 /*127856 (光铸战争机甲)*/, 122213 /*122213 (领主埃尔加) - -Unknown-*/, 122212 /*122212 (达西迪奥夫人) - -Unknown-*/, 122211 /*122211 (乌坎纳) - -Unknown-*/, 122438 /*122438 (邪破传送门)*/, 128088 /*128088 (生命宝珠) - -Unknown-*/, 125364 /*125364 (帕拉克希斯号)*/, 123452 /*123452 (邪能领主) - -Unknown-*/, 123191 /*123191 (恶魔犬) - -Unknown-*/, 123760 /*123760 (注邪毁灭者) - -Unknown-*/, 123451 /*123451 (恶魔卫士) - -Unknown-*/, 124298 /*124298 (军团战舰) - -Unknown-*/, 124288 /*124288 (军团战舰) - -Unknown-*/, 130000 /*130000 (侵入点)*/, 124445 /*124445 (帕拉克希斯号) - -Unknown-*/, 124962 /*124962 (跳板) - -Unknown-*/, 124963 /*124963 (Jump Dest) - -Unknown-*/, 127681 /*127681 (生命的缚誓者构造体) - -Unknown-*/, 127754 /*127754 (艾欧娜尔原祖荆兽)*/, 122500 /*122500 (艾欧娜尔的精华) - -Unknown-*/, 127763 /*127763 (艾欧娜尔幼龙)*/, 126982 /*126982 (艾欧娜尔之女)*/, 126989 /*126989 (艾欧娜尔飞鸟)*/, 126980 /*126980 (追猎者)*/, 127717 /*127717 (艾欧娜尔泰坦宝珠)*/, 127694 /*127694 (Eonar Beam Stalker)*/, 126937 /*126937 (追猎者) - -Unknown-*/, 127213 /*127213 (艾欧娜尔黄蜂)*/, 122587 /*122587 (传送门：拉恩科纳)*/, 122647 /*122647 (拉恩科纳酸液) - -Unknown-*/, 122555 /*122555 (传送通路：拉恩科纳) - -Unknown-, -Unknown-*/, 122588 /*122588 (传送门：纳斯雷萨)*/, 122586 /*122586 (传送门：克索诺斯)*/, 122104 /*122104 (传送门守护者哈萨贝尔) - -Unknown-*/, 122953 /*122953 (纳斯雷萨之影) - -Unknown-*/, 122533 /*122533 (传送通路：克索诺斯)*/, 122628 /*122628 (克索诺斯之焰) - -Unknown-*/, 128293 /*128293 (传送门) - -Unknown-, -Unknown-, -Unknown-, -Unknown-*/, 122494 /*122494 (传送通路：克索诺斯) - -Unknown-, -Unknown-*/, 122558 /*122558 (传送通路：纳斯雷萨) - -Unknown-, -Unknown-*/, 122559 /*122559 (传送通路：纳斯雷萨) - -Unknown-, -Unknown-*/, 122543 /*122543 (传送通路：拉恩科纳) - -Unknown-, -Unknown-*/, 125549 /*125549 (饥饿的猎犬)*/, 128352 /*128352 (艾欧娜尔的影像) - -Unknown-*/, 125584 /*125584 (麦格尼·铜须)*/, 125570 /*125570 (裂隙世界助手) - -Unknown-*/, 129050 /*129050 (安托兰恶魔卫士) - -Unknown-*/, 125535 /*125535 (裂隙世界助手) - -Unknown-*/, 125569 /*125569 (裂隙世界助手) - -Unknown-*/, 125547 /*125547 (魔触掠行蛛)*/, 125545 /*125545 (炽燃小鬼)*/, 126333 /*126333 (导邪祭师) - -Unknown-*/, 111060 /*111060 (奥术师纳兰) - -Unknown-*/, 118925 /*118925 (被邪能吞噬的受害者) - -Unknown-*/, 119629 /*119629 (赫尔努拉斯)*/, 119146 /*119146 (阿格拉玛之盾) - -Unknown-*/, 121234 /*121234 (艾格文的影像) - -Unknown-*/, 120241 /*120241 (萨奇尔)*/, 116944 /*116944 (孟菲斯托斯) - -Unknown-*/, 121982 /*121982 (伊利丹·怒风) - -Unknown-*/, 118642 /*118642 (恐翼蝠)*/, 120207 /*120207 (恐惧魔王蝙蝠追猎者)*/, 120405 /*120405 (恐翼蝠)*/, 119157 /*119157 (恶魔卫士) - -Unknown-*/, 118801 /*118801 (小鬼) - -Unknown-*/, 118804 /*118804 (多玛塔克斯) - -Unknown-*/, 118797 /*118797 (大法师卡德加) - -Unknown-*/, 122085 /*122085 (脉动的卵囊)*/, 120016 /*120016 (死疽小蜘蛛) - -Unknown-*/, 120373 /*120373 (邪脉植物学家) - -Unknown-*/, 118712 /*118712 (邪足执行者)*/, 118713 /*118713 (邪足晶球法师)*/, 118705 /*118705 (纳尔莎)*/, 118706 /*118706 (死疽小蜘蛛) - -Unknown-*/, 117194 /*117194 (轻蔑的萨什比特)*/, 118884 /*118884 (阿格拉玛之盾) - -Unknown-*/, 121102 /*121102 (Aegis RP Finale Stalker)*/, 121713 /*121713 (邪能传送门守卫)*/, 118834 /*118834 (邪能传送门守卫) - -Unknown-*/, 118723 /*118723 (加泽拉克斯)*/, 120257 /*120257 (涌动邪能)*/, 120371 /*120371 (鬼火小鬼)*/, 120246 /*120246 (萨奇尔)*/, 122238 /*122238 (神奇图书馆)*/, 119897 /*119897 (神奇图书馆)*/, 122236 /*122236 (神奇图书馆)*/, 122237 /*122237 (神奇图书馆)*/, 121231 /*121231 (恐翼蝠)*/, 120366 /*120366 (鬼焰女妖) - -Unknown-*/, 119190 /*119190 (窒息藤蔓)*/, 119930 /*119930 (恐翼蝠)*/, 119977 /*119977 (绞藤鞭笞者) - -Unknown-*/, 119169 /*119169 (狂暴的鞭笞者) - -Unknown-*/, 121695 /*121695 (初生的花朵)*/, 120374 /*120374 (恶魔卫士毁灭者) - -Unknown-*/, 117193 /*117193 (阿格洛诺克斯) - -Unknown-, -Unknown-*/, 121318 /*121318 (狂暴的鞭笞者)*/, 118700 /*118700 (邪疫猎犬)*/, 120556 /*120556 (恐翼蝠)*/, 118716 /*118716 (喷怨鞭笞者) - -Unknown-*/, 119923 /*119923 (鬼火慰魂者)*/, 118714 /*118714 (鬼焰女妖) - -Unknown-*/, 120778 /*120778 (愤怒卫士入侵者)*/, 118704 /*118704 (杜尔扎克)*/, 121711 /*121711 (喷怨鞭笞者)*/, 118703 /*118703 (邪脉植物学家)*/, 119978 /*119978 (狂暴的鞭笞者) - -Unknown-*/, 119952 /*119952 (恶魔卫士毁灭者) - -Unknown-*/, 120779 /*120779 (鬼火邪能使者)*/, 118724 /*118724 (鬼火邪能使者)*/, 120770 /*120770 (恶魔卫士毁灭者)*/, 120550 /*120550 (愤怒卫士入侵者) - -Unknown-*/, 118690 /*118690 (愤怒卫士入侵者)*/, 119147 /*119147 (玛维·影歌)*/, 120312 /*120312 (玛维·影歌) - -Unknown-*/, 118717 /*118717 (鬼火小鬼) - -Unknown-*/, 118719 /*118719 (虫语清道夫) - -Unknown-*/, 120792 /*120792 (伊利丹·怒风)*/);
INSERT INTO `creature_template_addon` (`entry`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(116323, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 116323 (下水道贱民)
(119892, 0, 0, 0, 1, 0, 0, 0, 0, '240441'), -- 119892 (麦格尼·铜须) - -Unknown-
(120971, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 120971 (生命侍女)
(120486, 0, 0, 0, 1, 0, 0, 0, 0, '240374'), -- 120486 (痛苦聚合体) - -Unknown-
(120487, 0, 0, 0, 1, 0, 0, 0, 0, '240374'), -- 120487 (梦魇恐魔) - -Unknown-
(120472, 0, 0, 0, 1, 0, 0, 0, 0, '240374'), -- 120472 (令人不安的残影) - -Unknown-
(120470, 0, 0, 0, 1, 0, 0, 0, 0, '240374'), -- 120470 (凝结的梦魇) - -Unknown-
(119895, 0, 0, 0, 1, 0, 0, 0, 0, '241358 247196'), -- 119895 (防御构装体) - -Unknown-, -Unknown-
(122929, 0, 0, 0, 1, 0, 0, 0, 0, '245004'), -- 122929 (虚空触须) - -Unknown-
(120111, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 120111 (Trigger Bunny)
(120479, 0, 0, 50331648, 1, 0, 0, 0, 0, '240374'), -- 120479 (蠕行恐魔) - -Unknown-
(120484, 0, 0, 0, 1, 0, 0, 0, 0, '240374'), -- 120484 (鬼魅幻影) - -Unknown-
(121008, 0, 0, 0, 1, 0, 0, 0, 0, '240374'), -- 121008 (不安的绝望) - -Unknown-
(120489, 0, 0, 0, 1, 0, 0, 0, 0, '240374'), -- 120489 (痛苦幻象) - -Unknown-
(120488, 0, 0, 50331648, 1, 0, 0, 0, 0, '155893'), -- 120488 (防御节点) - -Unknown-
(121244, 0, 0, 50331648, 1, 0, 0, 0, 0, '240392'), -- 121244 (Azeroth's Warning Nightmare Bunny) - -Unknown-
(120974, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 120974 (监控构造体)
(28069, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28069 (索拉查卫士)
(28641, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28641 (凋零的身体)
(29066, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 29066 (泰坦哨兵)
(32492, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 32492 (霜巢雌龙)
(29124, 0, 0, 0, 1, 0, 0, 0, 0, '53213 54189'), -- 29124 (源血元素) - -Unknown-, -Unknown-
(29123, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 29123 (天灾巨怪)
(28108, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28108 (骨镰劫掠者)
(28096, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28096 (硬皮冲锋者)
(28101, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28101 (损毁的天灾怪)
(28217, 0, 0, 0, 1, 0, 0, 0, 0, '51329'), -- 28217 (受伤的雨声神谕者) - -Unknown-
(28574, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28574 (玛尔文·摇链)
(28568, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 28568 (塔玛拉·摇链)
(28746, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28746 (飞行员维克)
(24653, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 24653 (飞行器)
(28315, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28315 (萨满祭司维克伊克)
(30362, 0, 0, 0, 1, 0, 0, 0, 0, '25824'), -- 30362 (长者杉德雷) - -Unknown-
(28463, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28463 (River's Heart Bunny)
(28010, 0, 0, 0, 1, 0, 0, 0, 0, '54913'), -- 28010 (搁浅的蛇颈龙) - -Unknown-
(29036, 0, 0, 0, 1, 0, 0, 0, 0, '52948 61750 61751'), -- 29036 (弗蕾亚的仆从) - -Unknown-, -Unknown-, -Unknown-
(28002, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28002 (蛮藤谷鳄鱼)
(62815, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 62815 (黄蟾蜍)
(28011, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28011 (帝王眼镜蛇)
(28098, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28098 (硬皮抢夺者)
(28466, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28466 (Fruit Tosser)
(28086, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28086 (蓝玉虫巢巨蜂)
(28085, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28085 (蓝玉虫巢雄蜂)
(28129, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 28129 (食草长颈鹿)
(25793, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25793 (回收机器人55-D型)
(25781, 0, 0, 0, 1, 0, 0, 0, 0, '35357 46011'), -- 25781 (油坑) - -Unknown-, -Unknown-
(25743, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25743 (雄性长毛猛犸象)
(26598, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26598 (米丝蒂·飞晨)
(24613, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 24613 (猛犸幼崽)
(25780, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 25780 (阿布尼·扭矩)
(24614, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 24614 (长毛猛犸象)
(26804, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26804 (Fizzcrank Bomber Invisible Bunny)
(26602, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26602 (卡拉·芒星)
(26597, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26597 (“母鹅”托比·铁栓)
(25747, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 25747 (金吉·温纳特)
(26596, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26596 (查莉·诺斯托)
(25767, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 25767 (菲兹兰克飞行员)
(25702, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 25702 (墨尔杜·旋轮)
(25434, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25434 (犸格莫斯碾压者)
(25590, 0, 0, 0, 258, 0, 0, 0, 0, ''), -- 25590 (菲兹兰克·铁阀)
(25428, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25428 (犸格莫斯萨满祭司)
(26619, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26619 (菲兹兰克伞兵)
(26601, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26601 (菲兹兰克飞行员)
(25429, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25429 (犸格莫斯劫掠者)
(62697, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 62697 (油腻软泥怪)
(25752, 0, 0, 0, 1, 0, 0, 0, 0, '49957'), -- 25752 (清除机器人004-A8型) - -Unknown-
(25670, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25670 (ELM General Purpose Bunny (scale x3))
(24957, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 24957 (诅咒教派药剂师)
(25660, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25660 (生疮的食尸鬼)
(26126, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26126 (白骨战士)
(25758, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25758 (防御坦克66D型)
(25814, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25814 (菲兹兰克机械侏儒)
(25753, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25753 (警戒机器人57-K型)
(32544, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 32544 (蒸汽云雾)
(25677, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25677 (北风蛙)
(25739, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25739 (蒸汽喷泉口)
(26725, 0, 0, 0, 257, 0, 0, 0, 0, '45528'), -- 26725 (驯风者奥里尔) - -Unknown-
(62695, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 62695 (北风土拨鼠)
(26041, 0, 0, 1, 1, 0, 0, 0, 0, ''), -- 26041 (Lightning Target)
(31685, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 31685 (北风土拨鼠)
(25680, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25680 (沼泽驯鹿)
(25454, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25454 (苔原爬虫)
(25700, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25700 (鳄鱼人猎手)
(25701, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25701 (掘泥鳄鱼人)
(25699, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25699 (污泥鳄鱼人)
(26094, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26094 (Naxxanar Caster)
(25452, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25452 (天灾猛犸)
(26174, 0, 0, 1, 1, 0, 0, 0, 0, ''), -- 26174 (食腐秃鹰)
(26162, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26162 (Transborea Generator 001)
(25715, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 25715 (冰冷元素)
(26156, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26156 (沃图克)
(26413, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26413 (阿努巴尔恐怖编织者)
(26402, 0, 0, 0, 1, 0, 0, 0, 0, '46976'), -- 26402 (阿努巴尔伏击者) - -Unknown-
(26281, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26281 (眠月魔犬)
(26455, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26455 (眠月神殿上层精灵)
(26837, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26837 (萨蕾德亚娜)
(27056, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 27056 (哨兵琪珊·清泉)
(27054, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 27054 (莫度鲁)
(27119, 0, 0, 3, 257, 0, 0, 0, 0, ''), -- 27119 (雪足)
(27052, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 27052 (诺哈因)
(26459, 0, 0, 0, 256, 0, 0, 0, 0, ''), -- 26459 (指挥官塞雅·蓝钢)
(26881, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26881 (帕蕾娜·银云)
(26973, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26973 (典狱官朱蒂·月歌)
(26673, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 26673 (大法师茉德拉的影像)
(27055, 0, 0, 0, 258, 0, 0, 0, 0, ''), -- 27055 (哨兵蓝塔娜·琥珀)
(30358, 0, 0, 0, 1, 0, 0, 0, 0, '25824'), -- 30358 (长者墨尔希) - -Unknown-
(26276, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 26276 (魔枢守护者)
(62693, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 62693 (极地野兔)
(26448, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26448 (群星之墓哨兵)
(26482, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26482 (极地灰熊)
(27749, 0, 0, 0, 258, 0, 0, 0, 0, ''), -- 27749 (部落援兵)
(27763, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27763 (瓦加斯塔兹)
(29328, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 29328 (极地野兔)
(26838, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26838 (恐怖之爪)
(27725, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27725 (红玉守护者)
(27533, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27533 (冰冷恶鬼)
(27369, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27369 (Necromantic Rune Bunny)
(27680, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27680 (达莉亚)
(27539, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27539 (冰冷通灵师)
(33704, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 33704 (冰冷憎恶)
(27572, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27572 (Ruby Controller Bunny)
(27542, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27542 (红玉警戒者)
(27531, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27531 (进攻的冰冷憎恶)
(27589, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27589 (Ruby Strafe Bunny)
(27686, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27686 (进攻的冰冷恶鬼)
(27564, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 27564 (联盟援兵)
(27006, 0, 0, 0, 1, 0, 0, 0, 0, '42459'), -- 27006 (裂骨者) - -Unknown-
(26889, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26889 (The End of the Line Area Trigger Kill Credit Bunny)
(26836, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26836 (吉加托尔)
(27698, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27698 (Defending Wyrmrest Temple Kill Credit Bunny)
(24879, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 24879 (北极云雾)
(26816, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26816 (魔法焦点巫师)
(32572, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 32572 (龙骨荒野法师猎手)
(27279, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27279 (雪原萨满祭司)
(27278, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27278 (雪原狂战士)
(26480, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26480 (猛犸人幼体)
(26295, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26295 (猛犸人族长)
(27294, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27294 (苔原食腐豺狼)
(26443, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 26443 (塔里奥斯塔兹)
(26705, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26705 (雪原徒工)
(26481, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26481 (猛犸人突击者)
(26271, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26271 (衰弱的雄性猛犸象)
(26272, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26272 (瘦弱的猛犸象)
(62852, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 62852 (龙骨幼鸟)
(26273, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26273 (衰弱的猛犸象幼崽)
(124100, 0, 0, 0, 1, 0, 0, 0, 0, '247198'), -- 124100 (药剂师蒂林丝) - -Unknown-
(124103, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 124103 (塔乐莎·韧皮)
(124104, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 124104 (妖术师贾昆达)
(124101, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 124101 (萝比·电压)
(124102, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 124102 (格罗索格)
(124074, 0, 29754, 0, 1, 0, 0, 0, 0, ''), -- 124074 (亡灵卫兵战地队长)
(124379, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 124379 (阿德林·韧皮)
(123662, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 123662 (龙眠神殿)
(124072, 0, 8469, 0, 1, 0, 0, 0, 0, ''), -- 124072 (联盟战地指挥官)
(124096, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 124096 (布里格斯)
(124154, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 124154 (克罗米)
(124052, 0, 0, 0, 1, 0, 0, 0, 0, '246547 246548'), -- 124052 (部落攻城火炮) - -Unknown-, -Unknown-
(124053, 0, 0, 0, 1, 0, 0, 0, 0, '246547 246548'), -- 124053 (联盟攻城火炮) - -Unknown-, -Unknown-
(124073, 0, 0, 0, 1, 0, 0, 0, 0, '84558 54913'), -- 124073 (亡灵卫兵) - -Unknown-, -Unknown-
(124071, 0, 0, 0, 1, 0, 0, 0, 0, '54913'), -- 124071 (联盟防御者) - -Unknown-
(122875, 0, 0, 0, 1, 0, 0, 0, 0, '245490'), -- 122875 (萨拉斯·维索恩) - -Unknown-
(123458, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 123458 (梦境折磨者)
(122545, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122545 (奥德拉长老)
(122547, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122547 (巴克隆)
(122546, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122546 (布鲁彼得)
(122544, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122544 (护园者尼瑟拉)
(122548, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 122548 (翡翠天爪枭)
(122549, 0, 0, 9, 1, 0, 0, 0, 0, ''), -- 122549 (翡翠鞭笞者)
(122522, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122522 (破冰者)
(122552, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122552 (魔网元素)
(122551, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 122551 (魔网浮龙)
(122550, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122550 (克雷苟斯)
(122524, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122524 (食血者)
(27804, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27804 (古拉克·石拳)
(26483, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26483 (龙骨秃鹫)
(122513, 0, 0, 0, 1, 0, 0, 0, 0, '245183'), -- 122513 (伊萨里奥斯勋爵) - -Unknown-
(122514, 0, 0, 0, 1, 0, 0, 0, 0, '245183'), -- 122514 (卡雷苟斯) - -Unknown-
(122510, 0, 0, 0, 1, 0, 0, 0, 0, '245183'), -- 122510 (克罗米) - -Unknown-
(122511, 0, 0, 0, 1, 0, 0, 0, 0, '245183'), -- 122511 (阿莱克丝塔萨，生命的缚誓者) - -Unknown-
(125249, 0, 0, 50331648, 1, 0, 0, 0, 0, '245183'), -- 125249 (返回现在) - -Unknown-
(30078, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 30078 ([DND]Wyrmrest Temple Beam Target)
(23155, 0, 0, 0, 1, 0, 0, 0, 0, '42051'), -- 23155 (Invisible Stalker (Scale x3)) - -Unknown-
(26983, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26983 (奥拉斯塔萨)
(26851, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 26851 (奈瑟斯塔兹)
(27950, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 27950 (德米斯塔兹)
(27948, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 27948 (莉塞拉)
(27803, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 27803 (劳莉耶尔·图布雷)
(27575, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 27575 (阿弗拉沙斯塔兹)
(27608, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 27608 (碧蓝巨龙)
(27682, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 27682 (碧蓝幼龙)
(34381, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 34381 ([DND]Northrend Children's Week Trigger)
(32533, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 32533 (希尔丝塔萨)
(38017, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38017 (卡雷苟斯)
(27765, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27765 (纳莉丝)
(27785, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27785 (伊萨里奥斯勋爵)
(27856, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27856 (克罗米)
(26917, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26917 (阿莱克丝塔萨，生命的缚誓者)
(27990, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 27990 (克拉苏斯)
(26949, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 26949 (托拉斯塔萨)
(26925, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 26925 (龙眠神殿幼龙)
(26933, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 26933 (龙眠神殿守护者)
(113865, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 113865 (梦魇之门)
(71304, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 71304 (爱莉丝·月梦)
(129211, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 129211 (泰兰德·语风)
(129210, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 129210 (玛法里奥·怒风)
(129209, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 129209 (伊利丹·怒风)
(118003, 0, 0, 0, 257, 0, 0, 0, 0, '18950 134735'), -- 118003 (洛拉希尔哨兵) - -Unknown-, -Unknown-
(83588, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 83588 (阳光幼苗)
(70082, 0, 0, 0, 1, 0, 0, 0, 0, '139915'), -- 70082 (皮埃尔) - -Unknown-
(126070, 0, 0, 0, 0, 0, 0, 0, 0, '245570'), -- 126070 (光铸技师) - -Unknown-
(128949, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 128949 (先知维伦)
(129896, 0, 0, 0, 0, 0, 0, 0, 0, '247987'), -- 129896 (光铸百夫长) - -Unknown-
(129829, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 129829 (高阶女祭司伊莎娜)
(129793, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 129793 (侦察地图)
(129897, 0, 0, 0, 0, 0, 0, 0, 0, '247987'), -- 129897 (光铸牧师) - -Unknown-
(129871, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 129871 (救赎者阿拉托尔)
(129872, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 129872 (温蕾萨·风行者)
(129429, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 129429 (艾洛达尔水晶)
(129722, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 129722 (泰坦能量微粒)
(127809, 0, 0, 50331648, 1, 0, 2133, 0, 0, '256389'), -- 127809 (起源重组模块) - -Unknown-
(129635, 0, 0, 65536, 1, 0, 0, 0, 0, '256894 258826'), -- 129635 (饥饿灵魂) - -Unknown-, -Unknown-
(129386, 0, 0, 0, 1, 0, 2133, 0, 0, '256338'), -- 129386 (生命缚誓者的恩赐) - -Unknown-
(127192, 0, 0, 0, 1, 0, 0, 0, 0, '72242'), -- 127192 (星圣管理官) - -Unknown-
(126268, 0, 0, 0, 1, 0, 0, 0, 0, '255648'), -- 126268 (高戈奈斯) - -Unknown-
(126266, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 126266 (诺甘农)
(126267, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 126267 (艾欧娜尔)
(127458, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127458 (萨奇尔)
(127473, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127473 (萨拉塔斯)
(128466, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 128466 (艾露尼斯)
(124828, 0, 0, 0, 1, 0, 0, 0, 0, '258040 72242'), -- 124828 (寂灭者阿古斯) - -Unknown-, -Unknown-
(125885, 0, 0, 50331648, 1, 0, 0, 0, 0, '72242'), -- 125885 (阿曼苏尔) - -Unknown-
(125886, 0, 0, 0, 1, 0, 0, 0, 0, '72242 257213'), -- 125886 (卡兹格罗斯) - -Unknown-, -Unknown-
(125893, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 125893 (阿格拉玛)
(128169, 0, 0, 0, 257, 0, 0, 0, 0, '254311'), -- 128169 (麦格尼·铜须) - -Unknown-
(122581, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122581 (烈焰之迹)
(121975, 0, 0, 0, 1, 0, 0, 0, 0, '243431 243429'), -- 121975 (阿格拉玛) - -Unknown-, -Unknown-
(127470, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127470 (萨拉塔斯)
(127455, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127455 (萨奇尔)
(128464, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 128464 (艾露尼斯)
(123680, 0, 0, 0, 1, 0, 0, 0, 0, '228953'), -- 123680 (黑暗守护者艾迪斯) - -Unknown-
(124166, 0, 0, 0, 1, 0, 0, 0, 0, '245671'), -- 124166 (卡兹格罗斯的痛苦) - -Unknown-
(125837, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 125837 (阿曼苏尔的痛苦)
(124164, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 124164 (高戈奈斯的痛苦)
(123503, 0, 0, 0, 1, 0, 0, 0, 0, '249863'), -- 123503 (诺甘农的痛苦) - -Unknown-
(122643, 0, 0, 0, 1, 0, 0, 0, 0, '244522'), -- 122643 (瓦里玛萨斯之影) - -Unknown-
(122590, 0, 0, 0, 1, 0, 0, 0, 0, '244326'), -- 122590 (瓦里玛萨斯之影) - -Unknown-
(122809, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 122809 (诺甘农之魂)
(122781, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 122781 (卡兹格罗斯之魂)
(122814, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 122814 (高戈奈斯之魂)
(128311, 0, 0, 50331648, 1, 0, 0, 0, 0, ''); -- 128311 (破坏魔女巫会)

INSERT INTO `creature_template_addon` (`entry`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(127472, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127472 (萨拉塔斯)
(126084, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 126084 (阿曼苏尔之魂)
(127457, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127457 (萨奇尔)
(124913, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 124913 (麦格尼·铜须)
(128095, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 128095 (鞭笞姐妹)
(128060, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 128060 (狂乱的女祭司)
(122467, 0, 0, 0, 1, 0, 0, 0, 0, '244740'), -- 122467 (奥萨拉，黑夜之母) - -Unknown-
(122468, 0, 0, 0, 1, 0, 0, 0, 0, '244733'), -- 122468 (诺拉，烈焰之母) - -Unknown-
(122366, 0, 0, 0, 1, 0, 0, 0, 0, '254076'), -- 122366 (瓦里玛萨斯) - -Unknown-
(122469, 0, 0, 0, 1, 0, 0, 0, 0, '244756'), -- 122469 (蒂玛，幽影之母) - -Unknown-
(127471, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127471 (萨拉塔斯)
(128465, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 128465 (艾露尼斯)
(127456, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127456 (萨奇尔)
(128304, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 128304 (光铸道标)
(123533, 0, 0, 0, 1, 0, 0, 0, 0, '246496 87239'), -- 123533 (塔尼斯) - -Unknown-, -Unknown-
(123532, 0, 0, 0, 1, 0, 0, 0, 0, '246496 87239'), -- 123532 (黑暗卫士) - -Unknown-, -Unknown-
(123929, 0, 0, 0, 1, 0, 0, 0, 0, '246504'), -- 123929 (加洛西破坏者) - -Unknown-
(123906, 0, 0, 0, 1, 0, 0, 0, 0, '246504'), -- 123906 (加洛西歼灭者) - -Unknown-
(123921, 0, 0, 0, 1, 0, 0, 0, 0, '246504'), -- 123921 (加洛西屠戮者) - -Unknown-
(125462, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 125462 (Apocalypse Blast Stalker)
(124879, 0, 0, 0, 1, 0, 0, 0, 0, '248048'), -- 124879 (焚化追猎者) - -Unknown-
(122634, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 122634 (地狱塔楼)
(122578, 0, 0, 33554432, 1, 0, 0, 0, 0, '248303'), -- 122578 (金加洛斯) - -Unknown-
(127230, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127230 (加洛西歼灭者)
(127235, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127235 (加洛西破坏者)
(127231, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127231 (加洛西屠戮者)
(124889, 0, 0, 50331648, 1, 0, 0, 0, 0, '251446'), -- 124889 (火炮轰击) - -Unknown-
(124704, 0, 0, 50331648, 1, 0, 0, 0, 0, '251446'), -- 124704 (轰炸) - -Unknown-
(127469, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127469 (萨拉塔斯)
(127454, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127454 (萨奇尔)
(128463, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 128463 (艾露尼斯)
(128303, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 128303 (光铸道标)
(125692, 0, 0, 50331648, 1, 0, 0, 0, 0, '250186'), -- 125692 (猎魂者伊墨纳尔) - -Unknown-
(124158, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 124158 (猎魂者伊墨纳尔)
(128154, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 128154 (加洛西灭世者)
(124550, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 124550 (烈火)
(126678, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 126678 (维迪卡尔火炮)
(125717, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 125717 (码头卫兵)
(124686, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 124686 (陷阱！)
(129876, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 129876 (大技师罗姆尔)
(125691, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 125691 (大法师卡德加)
(125720, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 125720 (光铸道标)
(125682, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 125682 (先知维伦)
(125683, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 125683 (伊利丹·怒风)
(125689, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 125689 (奥蕾莉亚·风行者)
(126426, 0, 0, 50331648, 1, 0, 0, 0, 0, '250877'), -- 126426 (维迪卡尔) - -Unknown-
(127963, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127963 (光铸战争机甲)
(127856, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 127856 (光铸战争机甲)
(122213, 0, 0, 0, 1, 0, 0, 0, 0, '255802'), -- 122213 (领主埃尔加) - -Unknown-
(122212, 0, 0, 0, 1, 0, 0, 0, 0, '255802'), -- 122212 (达西迪奥夫人) - -Unknown-
(122211, 0, 0, 0, 1, 0, 0, 0, 0, '255802'), -- 122211 (乌坎纳) - -Unknown-
(122438, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 122438 (邪破传送门)
(128088, 0, 0, 0, 1, 0, 0, 0, 0, '253754'), -- 128088 (生命宝珠) - -Unknown-
(125364, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 125364 (帕拉克希斯号)
(123452, 0, 0, 0, 1, 0, 0, 0, 0, '247928'), -- 123452 (邪能领主) - -Unknown-
(123191, 0, 0, 0, 1, 0, 0, 0, 0, '123978'), -- 123191 (恶魔犬) - -Unknown-
(123760, 0, 0, 0, 1, 0, 0, 0, 0, '123978'), -- 123760 (注邪毁灭者) - -Unknown-
(123451, 0, 0, 0, 1, 0, 0, 0, 0, '247922'), -- 123451 (恶魔卫士) - -Unknown-
(124298, 0, 0, 50331648, 1, 0, 0, 0, 0, '246896'), -- 124298 (军团战舰) - -Unknown-
(124288, 0, 0, 50331648, 1, 0, 0, 0, 0, '246888'), -- 124288 (军团战舰) - -Unknown-
(130000, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 130000 (侵入点)
(124445, 0, 0, 50331648, 1, 0, 0, 0, 0, '247214'), -- 124445 (帕拉克希斯号) - -Unknown-
(124962, 0, 0, 0, 1, 0, 0, 0, 0, '248222'), -- 124962 (跳板) - -Unknown-
(124963, 0, 0, 0, 1, 0, 0, 0, 0, '252309'), -- 124963 (Jump Dest) - -Unknown-
(127681, 0, 0, 0, 1, 0, 0, 0, 0, '254167'), -- 127681 (生命的缚誓者构造体) - -Unknown-
(127754, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 127754 (艾欧娜尔原祖荆兽)
(122500, 0, 0, 50331648, 1, 0, 0, 0, 0, '257673'), -- 122500 (艾欧娜尔的精华) - -Unknown-
(127763, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 127763 (艾欧娜尔幼龙)
(126982, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 126982 (艾欧娜尔之女)
(126989, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 126989 (艾欧娜尔飞鸟)
(126980, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 126980 (追猎者)
(127717, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 127717 (艾欧娜尔泰坦宝珠)
(127694, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 127694 (Eonar Beam Stalker)
(126937, 0, 0, 50331648, 1, 0, 0, 0, 0, '252021'), -- 126937 (追猎者) - -Unknown-
(127213, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 127213 (艾欧娜尔黄蜂)
(122587, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122587 (传送门：拉恩科纳)
(122647, 0, 0, 0, 1, 0, 0, 0, 0, '251145'), -- 122647 (拉恩科纳酸液) - -Unknown-
(122555, 0, 0, 0, 1, 0, 0, 0, 0, '244139 248539'), -- 122555 (传送通路：拉恩科纳) - -Unknown-, -Unknown-
(122588, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122588 (传送门：纳斯雷萨)
(122586, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122586 (传送门：克索诺斯)
(122104, 0, 0, 0, 1, 0, 0, 0, 0, '247142'), -- 122104 (传送门守护者哈萨贝尔) - -Unknown-
(122953, 0, 0, 0, 1, 0, 0, 0, 0, '251146'), -- 122953 (纳斯雷萨之影) - -Unknown-
(122533, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122533 (传送通路：克索诺斯)
(122628, 0, 0, 0, 1, 0, 0, 0, 0, '251144'), -- 122628 (克索诺斯之焰) - -Unknown-
(128293, 0, 0, 0, 1, 0, 0, 0, 0, '254507 254515 254508 254514'), -- 128293 (传送门) - -Unknown-, -Unknown-, -Unknown-, -Unknown-
(122494, 0, 0, 0, 1, 0, 0, 0, 0, '244017 244075'), -- 122494 (传送通路：克索诺斯) - -Unknown-, -Unknown-
(122558, 0, 0, 0, 1, 0, 0, 0, 0, '244148 244144'), -- 122558 (传送通路：纳斯雷萨) - -Unknown-, -Unknown-
(122559, 0, 0, 0, 1, 0, 0, 0, 0, '244149 248537'), -- 122559 (传送通路：纳斯雷萨) - -Unknown-, -Unknown-
(122543, 0, 0, 0, 1, 0, 0, 0, 0, '244137 244129'), -- 122543 (传送通路：拉恩科纳) - -Unknown-, -Unknown-
(125549, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 125549 (饥饿的猎犬)
(128352, 0, 0, 50331648, 1, 0, 0, 0, 0, '249296'), -- 128352 (艾欧娜尔的影像) - -Unknown-
(125584, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 125584 (麦格尼·铜须)
(125570, 0, 0, 0, 1, 0, 0, 0, 0, '249179'), -- 125570 (裂隙世界助手) - -Unknown-
(129050, 0, 0, 0, 1, 0, 5056, 0, 0, '254705'), -- 129050 (安托兰恶魔卫士) - -Unknown-
(125535, 0, 0, 0, 1, 0, 0, 0, 0, '249157'), -- 125535 (裂隙世界助手) - -Unknown-
(125569, 0, 0, 0, 1, 0, 0, 0, 0, '249172'), -- 125569 (裂隙世界助手) - -Unknown-
(125547, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 125547 (魔触掠行蛛)
(125545, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 125545 (炽燃小鬼)
(126333, 0, 0, 0, 1, 0, 0, 0, 0, '251154'), -- 126333 (导邪祭师) - -Unknown-
(111060, 0, 0, 0, 1, 0, 0, 0, 0, '146011'), -- 111060 (奥术师纳兰) - -Unknown-
(118925, 0, 0, 0, 1, 0, 0, 0, 0, '235985'), -- 118925 (被邪能吞噬的受害者) - -Unknown-
(119629, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 119629 (赫尔努拉斯)
(119146, 0, 0, 0, 1, 0, 0, 0, 0, '238406'), -- 119146 (阿格拉玛之盾) - -Unknown-
(121234, 0, 0, 0, 257, 0, 0, 0, 0, '241351'), -- 121234 (艾格文的影像) - -Unknown-
(120241, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 120241 (萨奇尔)
(116944, 0, 0, 0, 1, 0, 0, 0, 0, '241817'), -- 116944 (孟菲斯托斯) - -Unknown-
(121982, 0, 0, 50331648, 1, 0, 0, 0, 0, '239024'), -- 121982 (伊利丹·怒风) - -Unknown-
(118642, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 118642 (恐翼蝠)
(120207, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 120207 (恐惧魔王蝙蝠追猎者)
(120405, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 120405 (恐翼蝠)
(119157, 0, 0, 0, 1, 0, 0, 0, 0, '211762'), -- 119157 (恶魔卫士) - -Unknown-
(118801, 0, 0, 0, 1, 0, 0, 0, 0, '211762'), -- 118801 (小鬼) - -Unknown-
(118804, 0, 0, 0, 1, 0, 0, 0, 0, '241001'), -- 118804 (多玛塔克斯) - -Unknown-
(118797, 0, 0, 0, 1, 0, 0, 0, 0, '241351'), -- 118797 (大法师卡德加) - -Unknown-
(122085, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122085 (脉动的卵囊)
(120016, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 120016 (死疽小蜘蛛) - -Unknown-
(120373, 0, 0, 0, 1, 0, 0, 0, 0, '243458'), -- 120373 (邪脉植物学家) - -Unknown-
(118712, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 118712 (邪足执行者)
(118713, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 118713 (邪足晶球法师)
(118705, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 118705 (纳尔莎)
(118706, 0, 0, 0, 1, 0, 0, 0, 0, '236952'), -- 118706 (死疽小蜘蛛) - -Unknown-
(117194, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 117194 (轻蔑的萨什比特)
(118884, 0, 0, 50331648, 1, 0, 0, 0, 0, '144373'), -- 118884 (阿格拉玛之盾) - -Unknown-
(121102, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 121102 (Aegis RP Finale Stalker)
(121713, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 121713 (邪能传送门守卫)
(118834, 0, 0, 0, 1, 0, 0, 0, 0, '235827'), -- 118834 (邪能传送门守卫) - -Unknown-
(118723, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 118723 (加泽拉克斯)
(120257, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 120257 (涌动邪能)
(120371, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 120371 (鬼火小鬼)
(120246, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 120246 (萨奇尔)
(122238, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122238 (神奇图书馆)
(119897, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 119897 (神奇图书馆)
(122236, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122236 (神奇图书馆)
(122237, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 122237 (神奇图书馆)
(121231, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 121231 (恐翼蝠)
(120366, 0, 0, 0, 1, 0, 0, 0, 0, '238990'), -- 120366 (鬼焰女妖) - -Unknown-
(119190, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 119190 (窒息藤蔓)
(119930, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 119930 (恐翼蝠)
(119977, 0, 0, 0, 1, 0, 0, 0, 0, '177645'), -- 119977 (绞藤鞭笞者) - -Unknown-
(119169, 0, 0, 0, 1, 0, 0, 0, 0, '175057'), -- 119169 (狂暴的鞭笞者) - -Unknown-
(121695, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 121695 (初生的花朵)
(120374, 0, 0, 0, 1, 0, 0, 0, 0, '241598'), -- 120374 (恶魔卫士毁灭者) - -Unknown-
(117193, 0, 0, 0, 1, 0, 0, 0, 0, '218987 244332'), -- 117193 (阿格洛诺克斯) - -Unknown-, -Unknown-
(121318, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 121318 (狂暴的鞭笞者)
(118700, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 118700 (邪疫猎犬)
(120556, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 120556 (恐翼蝠)
(118716, 0, 0, 0, 1, 0, 0, 0, 0, '177645'), -- 118716 (喷怨鞭笞者) - -Unknown-
(119923, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 119923 (鬼火慰魂者)
(118714, 0, 0, 0, 1, 0, 0, 0, 0, '238990'), -- 118714 (鬼焰女妖) - -Unknown-
(120778, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 120778 (愤怒卫士入侵者)
(118704, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 118704 (杜尔扎克)
(121711, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 121711 (喷怨鞭笞者)
(118703, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 118703 (邪脉植物学家)
(119978, 0, 0, 0, 1, 0, 0, 0, 0, '177645'), -- 119978 (狂暴的鞭笞者) - -Unknown-
(119952, 0, 0, 0, 1, 0, 0, 0, 0, '241937'), -- 119952 (恶魔卫士毁灭者) - -Unknown-
(120779, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 120779 (鬼火邪能使者)
(118724, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 118724 (鬼火邪能使者)
(120770, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 120770 (恶魔卫士毁灭者)
(120550, 0, 0, 0, 1, 0, 0, 0, 0, '241937'), -- 120550 (愤怒卫士入侵者) - -Unknown-
(118690, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 118690 (愤怒卫士入侵者)
(119147, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 119147 (玛维·影歌)
(120312, 0, 0, 0, 1, 0, 0, 0, 0, '236609'), -- 120312 (玛维·影歌) - -Unknown-
(118717, 0, 0, 0, 1, 0, 0, 0, 0, '141502'), -- 118717 (鬼火小鬼) - -Unknown-
(118719, 0, 0, 0, 1, 0, 0, 0, 0, '141502'), -- 118719 (虫语清道夫) - -Unknown-
(120792, 0, 0, 0, 1, 0, 0, 0, 0, ''); -- 120792 (伊利丹·怒风)

UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=105333; -- 105333 (瓦尔祖恩)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=3835; -- 3835 (黄蟾蜍)
UPDATE `creature_template_addon` SET `emote`=0 WHERE `entry`=26645; -- 26645 (菲兹兰克工程人员)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=21757; -- 21757 (大型电荷元素)
UPDATE `creature_template_addon` SET `bytes1`=0, `auras`='29266' WHERE `entry`=26477; -- 26477 (死亡的法师猎手)
UPDATE `creature_template_addon` SET `bytes2`=257 WHERE `entry`=27060; -- 27060 (信使兰森)
UPDATE `creature_template_addon` SET `bytes2`=1, `auras`='50689' WHERE `entry`=26926; -- 26926 (瓦伦哈尔公爵)
UPDATE `creature_template_addon` SET `bytes2`=1, `auras`='49082' WHERE `entry`=27530; -- 27530 (红玉看守者)
UPDATE `creature_template_addon` SET `emote`=0 WHERE `entry`=26198; -- 26198 (飘雪林地狼獾人)
UPDATE `creature_template_addon` SET `emote`=0 WHERE `entry`=26280; -- 26280 (龙骨荒野法师猎手)
UPDATE `creature_template_addon` SET `bytes2`=1, `auras`='29266' WHERE `entry`=30058; -- 30058 (大厅守卫者)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=27943; -- 27943 (达尔洛米)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=27940; -- 27940 (莱瑟库斯)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=27938; -- 27938 (特利索尔姆)
UPDATE `creature_template_addon` SET `bytes2`=257, `auras`='' WHERE `entry`=27953; -- 27953 (龙眠神殿保卫者)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=27935; -- 27935 (费里索斯)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=27629; -- 27629 (龙眠神殿防御者)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=43427; -- 43427 (狂怒的海加尔守望者)
UPDATE `creature_template_addon` SET `auras`='106562' WHERE `entry`=109382; -- 109382 (瓦尔莎拉德鲁伊)
UPDATE `creature_template_addon` SET `bytes2`=256 WHERE `entry`=93462; -- 93462 (洛拉希尔哨兵)
UPDATE `creature_template_addon` SET `bytes2`=1, `auras`='' WHERE `entry`=93508; -- 93508 (洛拉希尔德鲁伊)
UPDATE `creature_template_addon` SET `bytes1`=0, `auras`='' WHERE `entry`=95719; -- 95719 (鹿角德鲁伊)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=92788; -- 92788 (暗魔篡梦者)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=92789; -- 92789 (暗魔恐怖使者)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=98638; -- 98638 (伊塞拉修女)
UPDATE `creature_template_addon` SET `bytes1`=50331651, `auras`='151597' WHERE `entry`=93946; -- 93946 (神殿弓箭手)
UPDATE `creature_template_addon` SET `bytes1`=50331651 WHERE `entry`=94137; -- 94137 (神殿卫士)
UPDATE `creature_template_addon` SET `bytes1`=0, `bytes2`=2 WHERE `entry`=94372; -- 94372 (鲑鱼溪村民)
UPDATE `creature_template_addon` SET `bytes1`=8 WHERE `entry`=92617; -- 92617 (鲑鱼溪村民)
UPDATE `creature_template_addon` SET `mount`=62486 WHERE `entry`=114676; -- 114676 (复活的先锋)
UPDATE `creature_template_addon` SET `bytes1`=0, `auras`='109525' WHERE `entry`=100409; -- 100409 (暮色啸狼)
UPDATE `creature_template_addon` SET `bytes2`=1, `auras`='46598' WHERE `entry`=91860; -- 91860 (复生的弓箭手)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=91839; -- 91839 (卡多雷风鹫)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=93314; -- 93314 (闪蹄母鹿)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=51649; -- 51649 (枭兽宝宝)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=16548; -- 16548 (扭扭先生)
UPDATE `creature_template_addon` SET `bytes1`=0, `bytes2`=0, `auras`='' WHERE `entry`=121397; -- 121397 (光铸战争祭司)
UPDATE `creature_template_addon` SET `auras`='18950 12544' WHERE `entry`=96770; -- 96770 (战斗法师穆琳娜)
UPDATE `creature_template_addon` SET `auras`='60913' WHERE `entry`=96979; -- 96979 (布拉古德·明火)
UPDATE `creature_template_addon` SET `auras`='237007 248886' WHERE `entry`=119391; -- 119391 (堕暗难民)
UPDATE `creature_template_addon` SET `bytes2`=0 WHERE `entry`=118830; -- 118830 (光铸道标)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=125512; -- 125512 (大主教图拉扬)
UPDATE `creature_template_addon` SET `auras`='123978 255081' WHERE `entry`=125478; -- 125478 (光铸百夫长)
UPDATE `creature_template_addon` SET `auras`='123978 255081' WHERE `entry`=124778; -- 124778 (光铸牧师)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=121263; -- 121263 (大技师罗姆尔)
UPDATE `creature_template_addon` SET `bytes1`=0, `bytes2`=0, `auras`='' WHERE `entry`=121396; -- 121396 (光铸神射手)
UPDATE `creature_template_addon` SET `auras`='251608' WHERE `entry`=120533; -- 120533 (先知维伦)
UPDATE `creature_template_addon` SET `bytes2`=0 WHERE `entry`=121394; -- 121394 (光铸盾卫)
UPDATE `creature_template_addon` SET `bytes1`=1, `auras`='244972' WHERE `entry`=121516; -- 121516 (光铸战斗法师)
UPDATE `creature_template_addon` SET `auras`='237554' WHERE `entry`=126030; -- 126030 (光誓学者)
UPDATE `creature_template_addon` SET `bytes1`=1, `auras`='244972' WHERE `entry`=121395; -- 121395 (光铸骑兵)
UPDATE `creature_template_addon` SET `auras`='250286' WHERE `entry`=126057; -- 126057 (损坏的战争机甲)
UPDATE `creature_template_addon` SET `auras`='132951' WHERE `entry`=127476; -- 127476 (侦察地图)
UPDATE `creature_template_addon` SET `bytes2`=1, `auras`='' WHERE `entry`=123413; -- 123413 (大法师伊米拉)
UPDATE `creature_template_addon` SET `bytes2`=1, `auras`='' WHERE `entry`=123669; -- 123669 (大守备官索沃斯)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=123668; -- 123668 (法瑞娅队长)
UPDATE `creature_template_addon` SET `bytes2`=1, `auras`='' WHERE `entry`=123670; -- 123670 (“神射手”巴拉特)
UPDATE `creature_template_addon` SET `bytes2`=1, `auras`='' WHERE `entry`=123671; -- 123671 (剑圣特拉蒙)
UPDATE `creature_template_addon` SET `bytes1`=50331648 WHERE `entry`=110966; -- 110966 (邪恶的魔牙蛛)
UPDATE `creature_template_addon` SET `auras`='211064' WHERE `entry`=105915; -- 105915 (夜之子复国者)
UPDATE `creature_template_addon` SET `auras`='202158' WHERE `entry`=98728; -- 98728 (酸蚀胆汁)
UPDATE `creature_template_addon` SET `bytes1`=8 WHERE `entry`=93538; -- 93538 (博学者达瑞妮斯)
UPDATE `creature_template_addon` SET `auras`='60913' WHERE `entry`=92457; -- 92457 (帕蒂卡·埃根)
UPDATE `creature_template_addon` SET `aiAnimKit`=3228 WHERE `entry`=110622; -- 110622 (特雷弗·佩吉)
UPDATE `creature_template_addon` SET `bytes1`=8 WHERE `entry`=96198; -- 96198 (卡翠欧娜·麦克雷)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=112661; -- 112661 (梦境之路徘徊者)
UPDATE `creature_template_addon` SET `aiAnimKit`=8998 WHERE `entry`=118257; -- 118257 (瓦拉加尔雷铸者)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=118375; -- 118375 (血骑士)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=117763; -- 117763 (肯瑞托书籍)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=118545; -- 118545 (妖术祭司)
UPDATE `creature_template_addon` SET `bytes1`=50331648, `aiAnimKit`=0 WHERE `entry`=118275; -- 118275 (岛礁海鸥)
UPDATE `creature_template_addon` SET `auras`='60913 61354' WHERE `entry`=96778; -- 96778 (艾玛拉)
UPDATE `creature_template_addon` SET `auras`='79849' WHERE `entry`=104091; -- 104091 (肯瑞托卫士)
UPDATE `creature_template_addon` SET `bytes2`=0, `auras`='79968' WHERE `entry`=122130; -- 122130 (高阶守备官)
UPDATE `creature_template_addon` SET `auras`='141502' WHERE `entry`=119768; -- 119768 (抗魔联军士兵)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=98043; -- 98043 (天海游荡者)
UPDATE `creature_template_addon` SET `auras`='206450' WHERE `entry`=98027; -- 98027 (欢笑的姐妹)
UPDATE `creature_template_addon` SET `auras`='122729 123236' WHERE `entry`=62821; -- 62821 (秘法师鸟羽帽)
UPDATE `creature_template_addon` SET `auras`='122729 123240' WHERE `entry`=62822; -- 62822 (表弟慢热手)

DELETE FROM `creature_template_scaling` WHERE `Entry` IN (27278, 26477, 123348, 26295, 91860, 121023, 40254, 119768, 27056, 28010, 26402, 25817, 26448, 26816, 28101, 27539, 27685, 28002, 26983, 98234, 24601, 32572, 27533, 26273, 25680, 25715, 26455, 26483, 25793, 27629, 26482, 27294, 26281, 27686, 26280, 24614, 27530, 26174, 26615, 25758, 25752, 26925, 32492, 28069, 28085, 25750, 27682, 28011, 25429, 29124, 28129, 29123, 25814, 25701, 25753, 25668, 24957, 43408, 25743, 25454, 33704, 25428, 25383, 28315, 26933, 28098, 25747, 28086, 29066, 27749, 30058, 26126, 26616, 25700, 24613, 26271, 26837, 26480, 129876, 26272, 27608, 28108, 26286, 25699, 26705, 26973, 25444, 114676, 25748, 26596, 26160, 25781, 26619, 27542, 26598, 25452, 27534, 26841, 26711, 27725, 40278, 125682, 28217, 27564, 25767, 25791, 26198, 26041, 26481, 92680, 26413, 26597, 27279, 28568, 97756, 40843, 27054, 19644, 26162, 26456, 50314, 26645, 26094, 27765, 108978, 25765, 98638, 25702, 26600, 29036, 25660, 27531, 71304, 43411, 27950, 27948, 27943, 27940, 27938, 118003, 91839, 40833, 92697, 27804, 27803, 92617, 28327, 26156, 27119, 26634, 27052, 39925, 26725, 26838, 28325, 27060, 28096, 27763, 26197, 25780, 25766, 26599, 27935, 25434, 26836, 43410, 26926, 26276, 25590, 27006, 28641, 27680, 27055);
INSERT INTO `creature_template_scaling` (`Entry`, `LevelScalingDeltaMin`, `LevelScalingDeltaMax`, `VerifiedBuild`) VALUES
(27278, -1, -1, 25996),
(26477, -1, -1, 25996),
(123348, 0, 0, 25996),
(26295, 0, 0, 25996),
(91860, 0, 0, 25996),
(121023, 0, 0, 25996),
(40254, 0, 0, 25996),
(119768, 0, 0, 25996),
(27056, 0, 0, 25996),
(28010, 0, 0, 25996),
(26402, 0, 0, 25996),
(25817, 0, 0, 25996),
(26448, 0, 0, 25996),
(26816, 1,  1, 25996),
(28101, -1, -1, 25996),
(27539, -1, -1, 25996),
(27685, -1, -1, 25996),
(28002, 1,  1, 25996),
(26983, 0, 0, 25996),
(98234, 0, 0, 25996),
(24601, 0, 0, 25996),
(32572, 1,  1, 25996),
(27533, 1,  1, 25996),
(26273, 0, 0, 25996),
(25680, 0, 0, 25996),
(25715, 0, 0, 25996),
(26455, -1, -1, 25996),
(26483, -1, -1, 25996),
(25793, 1,  1, 25996),
(27629, 0, 0, 25996),
(26482, 0, 0, 25996),
(27294, -1, -1, 25996),
(26281, 0, 0, 25996),
(27686, 0, 0, 25996),
(26280, 0, 0, 25996),
(24614, 0, 0, 25996),
(27530, 0, 0, 25996),
(26174, -1, -1, 25996),
(26615, 0, 0, 25996),
(25758, 1,  1, 25996),
(25752, 0, 0, 25996),
(26925, -1, -1, 25996),
(32492, 0, 0, 25996),
(28069, 0, 0, 25996),
(28085, -1, -1, 25996),
(25750, 0, 0, 25996),
(27682, 0, 0, 25996),
(28011, 0, 0, 25996),
(25429, 1,  1, 25996),
(29124, 0, 0, 25996),
(28129, 0, 0, 25996),
(29123, 1,  1, 25996),
(25814, 0, 0, 25996),
(25701, 0, 0, 25996),
(25753, 0, 0, 25996),
(25668, 0, 0, 25996),
(24957, 0, 0, 25996),
(43408, 0, 0, 25996),
(25743, 0, 0, 25996),
(25454, 0, 0, 25996),
(33704, 0, 0, 25996),
(25428, 0, 0, 25996),
(25383, 0, 0, 25996),
(28315, 0, 0, 25996),
(26933, 1,  1, 25996),
(28098, 0, 0, 25996),
(25747, 0, 0, 25996),
(28086, -1, -1, 25996),
(29066, 0, 0, 25996),
(27749, 0, 0, 25996),
(30058, 0, 0, 25996),
(26126, 0, 0, 25996),
(26616, 0, 0, 25996),
(25700, -1, -1, 25996),
(24613, 0, 0, 25996),
(26271, 0, 0, 25996),
(26837, 0, 0, 25996),
(26480, 0, 0, 25996),
(129876, 0, 0, 25996),
(26272, 0, 0, 25996),
(27608, 0, 0, 25996),
(28108, -1, -1, 25996),
(26286, 0, 0, 25996),
(25699, 1,  1, 25996),
(26705, 1,  1, 25996),
(26973, 0, 0, 25996),
(25444, 0, 0, 25996),
(114676, 0, 0, 25996),
(25748, 0, 0, 25996),
(26596, 0, 0, 25996),
(26160, 0, 0, 25996),
(25781, 0, 0, 25996),
(26619, 0, 0, 25996),
(27542, 1,  1, 25996),
(26598, 0, 0, 25996),
(25452, 0, 0, 25996),
(27534, -1, -1, 25996),
(26841, 0, 0, 25996),
(26711, 0, 0, 25996),
(27725, 0, 0, 25996),
(40278, 0, 0, 25996),
(125682, 0, 0, 25996),
(28217, 0, 0, 25996),
(27564, 0, 0, 25996),
(25767, 0, 0, 25996),
(25791, 0, 0, 25996),
(26198, 0, 0, 25996),
(26041, 0, 0, 25996),
(26481, 1,  1, 25996),
(92680, 0, 0, 25996),
(26413, 1,  1, 25996),
(26597, 0, 0, 25996),
(27279, 0, 0, 25996),
(28568, 0, 0, 25996),
(97756, 0, 0, 25996),
(40843, 0, 0, 25996),
(27054, 0, 0, 25996),
(19644, 0, 0, 25996),
(26162, 0, 0, 25996),
(26456, 1,  1, 25996),
(50314, 0, 0, 25996),
(26645, 0, 0, 25996),
(26094, 0, 0, 25996),
(27765, 0, 0, 25996),
(108978, 0, 0, 25996),
(25765, 0, 0, 25996),
(98638, 0, 0, 25996),
(25702, 0, 0, 25996),
(26600, 0, 0, 25996),
(29036, -1, -1, 25996),
(25660, 0, 0, 25996),
(27531, 1,  1, 25996),
(71304, 0, 0, 25996),
(43411, 0, 0, 25996),
(27950, 0, 0, 25996),
(27948, 0, 0, 25996),
(27943, 0, 0, 25996),
(27940, 0, 0, 25996),
(27938, 0, 0, 25996),
(118003, 0, 0, 25996),
(91839, 0, 0, 25996),
(40833, 0, 0, 25996),
(92697, 0, 0, 25996),
(27804, 0, 0, 25996),
(27803, 0, 0, 25996),
(92617, 0, 0, 25996),
(28327, 0, 0, 25996),
(26156, 0, 0, 25996),
(27119, 0, 0, 25996),
(26634, 0, 0, 25996),
(27052, 0, 0, 25996),
(39925, 0, 0, 25996),
(26725, 0, 0, 25996),
(26838, 1,  1, 25996),
(28325, 0, 0, 25996),
(27060, 0, 0, 25996),
(28096, 1,  1, 25996),
(27763, 0, 0, 25996),
(26197, 0, 0, 25996),
(25780, 0, 0, 25996),
(25766, 0, 0, 25996),
(26599, 0, 0, 25996),
(27935, 0, 0, 25996),
(25434, 0, 0, 25996),
(26836, 1,  1, 25996),
(43410, 0, 0, 25996),
(26926, 0, 0, 25996),
(26276, 0, 0, 25996),
(25590, 0, 0, 25996),
(27006, 1,  1, 25996),
(28641, 1,  1, 25996),
(27680, 0, 0, 25996),
(27055, 0, 0, 25996);

UPDATE `creature_template_scaling` SET `VerifiedBuild`=25996 WHERE `Entry`=105333;
UPDATE `creature_template_scaling` SET `VerifiedBuild`=25996 WHERE `Entry`=105333;


UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=65287;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=57295;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=65192;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=22175;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=70270;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=65405;
UPDATE `creature_model_info` SET `BoundingRadius`=0.208, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=74162;
UPDATE `creature_model_info` SET `BoundingRadius`=0.383, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=74160;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=70267;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=65191;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=65190;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=67528;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=65187;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=73366;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=69095;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=63429;
UPDATE `creature_model_info` SET `BoundingRadius`=0.0155, `CombatReach`=0.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77152;
UPDATE `creature_model_info` SET `BoundingRadius`=0.3, `VerifiedBuild`=25996 WHERE `DisplayID`=64192;
UPDATE `creature_model_info` SET `BoundingRadius`=1.44382, `CombatReach`=3, `VerifiedBuild`=25996 WHERE `DisplayID`=76033;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=26140;
UPDATE `creature_model_info` SET `BoundingRadius`=0.3, `VerifiedBuild`=25996 WHERE `DisplayID`=25889;
UPDATE `creature_model_info` SET `BoundingRadius`=12.68279, `VerifiedBuild`=25996 WHERE `DisplayID`=27982;
UPDATE `creature_model_info` SET `BoundingRadius`=1.395899, `VerifiedBuild`=25996 WHERE `DisplayID`=171;
UPDATE `creature_model_info` SET `BoundingRadius`=2.17608, `VerifiedBuild`=25996 WHERE `DisplayID`=25926;
UPDATE `creature_model_info` SET `BoundingRadius`=1.102251, `VerifiedBuild`=25996 WHERE `DisplayID`=14706;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=809;
UPDATE `creature_model_info` SET `BoundingRadius`=1.086309, `VerifiedBuild`=25996 WHERE `DisplayID`=22124;
UPDATE `creature_model_info` SET `BoundingRadius`=1.011588, `VerifiedBuild`=25996 WHERE `DisplayID`=25016;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25524;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25518;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25671;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=22719;
UPDATE `creature_model_info` SET `BoundingRadius`=0.7278407, `VerifiedBuild`=25996 WHERE `DisplayID`=26954;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=2601;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25329;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25163;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25156;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=15145;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25466;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25164;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=26583;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25455;
UPDATE `creature_model_info` SET `BoundingRadius`=0.325, `CombatReach`=0.975, `VerifiedBuild`=25996 WHERE `DisplayID`=25860;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=29113;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25120;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25121;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=27578;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=31126;
UPDATE `creature_model_info` SET `BoundingRadius`=1.978767, `VerifiedBuild`=25996 WHERE `DisplayID`=22633;
UPDATE `creature_model_info` SET `BoundingRadius`=1.583013, `VerifiedBuild`=25996 WHERE `DisplayID`=23403;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24005;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23956;
UPDATE `creature_model_info` SET `BoundingRadius`=1.314208, `VerifiedBuild`=25996 WHERE `DisplayID`=23434;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23378;
UPDATE `creature_model_info` SET `BoundingRadius`=2.146427, `VerifiedBuild`=25996 WHERE `DisplayID`=26423;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23967;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23953;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23955;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24008;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23957;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23969;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24007;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23354;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23935;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23368;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23324;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23965;
UPDATE `creature_model_info` SET `BoundingRadius`=3.4704, `VerifiedBuild`=25996 WHERE `DisplayID`=24851;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23264;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=27174;
UPDATE `creature_model_info` SET `BoundingRadius`=0.3, `VerifiedBuild`=25996 WHERE `DisplayID`=27192;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=27170;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24049;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24006;
UPDATE `creature_model_info` SET `BoundingRadius`=5.458125, `VerifiedBuild`=25996 WHERE `DisplayID`=23365;
UPDATE `creature_model_info` SET `BoundingRadius`=0.3, `VerifiedBuild`=25996 WHERE `DisplayID`=27185;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24103;
UPDATE `creature_model_info` SET `BoundingRadius`=0.093, `CombatReach`=0.3, `VerifiedBuild`=25996 WHERE `DisplayID`=42781;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=6774;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24119;
UPDATE `creature_model_info` SET `BoundingRadius`=1.006752, `VerifiedBuild`=25996 WHERE `DisplayID`=24997;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23307;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23294;
UPDATE `creature_model_info` SET `BoundingRadius`=0.8530628, `VerifiedBuild`=25996 WHERE `DisplayID`=11489;
UPDATE `creature_model_info` SET `BoundingRadius`=1.050524, `VerifiedBuild`=25996 WHERE `DisplayID`=24996;
UPDATE `creature_model_info` SET `BoundingRadius`=0.8530628, `VerifiedBuild`=25996 WHERE `DisplayID`=775;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24114;
UPDATE `creature_model_info` SET `BoundingRadius`=0.8530628, `VerifiedBuild`=25996 WHERE `DisplayID`=7847;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24947;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24108;
UPDATE `creature_model_info` SET `BoundingRadius`=1.118828, `VerifiedBuild`=25996 WHERE `DisplayID`=6888;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=28065;
UPDATE `creature_model_info` SET `BoundingRadius`=0.3, `VerifiedBuild`=25996 WHERE `DisplayID`=23343;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23313;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=1236;
UPDATE `creature_model_info` SET `BoundingRadius`=0.7973255, `VerifiedBuild`=25996 WHERE `DisplayID`=15903;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24564;
UPDATE `creature_model_info` SET `BoundingRadius`=1.445125, `VerifiedBuild`=25996 WHERE `DisplayID`=23320;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23311;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23652;
UPDATE `creature_model_info` SET `BoundingRadius`=2.833284, `VerifiedBuild`=25996 WHERE `DisplayID`=26425;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23645;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23651;
UPDATE `creature_model_info` SET `BoundingRadius`=2.416986, `CombatReach`=2.85, `VerifiedBuild`=25996 WHERE `DisplayID`=30562;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23650;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=26702;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=26703;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23483;
UPDATE `creature_model_info` SET `BoundingRadius`=3.257098, `VerifiedBuild`=25996 WHERE `DisplayID`=23348;
UPDATE `creature_model_info` SET `BoundingRadius`=2.791799, `VerifiedBuild`=25996 WHERE `DisplayID`=23349;
UPDATE `creature_model_info` SET `BoundingRadius`=3.722398, `VerifiedBuild`=25996 WHERE `DisplayID`=22249;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23642;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23643;
UPDATE `creature_model_info` SET `BoundingRadius`=0.4487035, `VerifiedBuild`=25996 WHERE `DisplayID`=24906;
UPDATE `creature_model_info` SET `BoundingRadius`=2.075341, `VerifiedBuild`=25996 WHERE `DisplayID`=25238;
UPDATE `creature_model_info` SET `BoundingRadius`=1.313507, `VerifiedBuild`=25996 WHERE `DisplayID`=23952;
UPDATE `creature_model_info` SET `BoundingRadius`=0.9751981, `VerifiedBuild`=25996 WHERE `DisplayID`=23820;
UPDATE `creature_model_info` SET `BoundingRadius`=2.72085, `VerifiedBuild`=25996 WHERE `DisplayID`=25195;
UPDATE `creature_model_info` SET `BoundingRadius`=0.4038332, `VerifiedBuild`=25996 WHERE `DisplayID`=24909;
UPDATE `creature_model_info` SET `BoundingRadius`=2.614227, `VerifiedBuild`=25996 WHERE `DisplayID`=6762;
UPDATE `creature_model_info` SET `BoundingRadius`=3.308066, `VerifiedBuild`=25996 WHERE `DisplayID`=14695;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23852;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24072;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24261;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24809;
UPDATE `creature_model_info` SET `BoundingRadius`=0.8948377, `VerifiedBuild`=25996 WHERE `DisplayID`=14331;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24265;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24255;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23849;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=11662;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24397;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23991;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24260;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23853;
UPDATE `creature_model_info` SET `BoundingRadius`=0.7278407, `VerifiedBuild`=25996 WHERE `DisplayID`=26951;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23851;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=22120;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23850;
UPDATE `creature_model_info` SET `BoundingRadius`=1.739087, `CombatReach`=4, `VerifiedBuild`=25996 WHERE `DisplayID`=10618;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24773;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24776;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24775;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24774;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24783;
UPDATE `creature_model_info` SET `BoundingRadius`=1.266596, `VerifiedBuild`=25996 WHERE `DisplayID`=23951;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24166;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24071;
UPDATE `creature_model_info` SET `BoundingRadius`=3.178348, `VerifiedBuild`=25996 WHERE `DisplayID`=8313;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24692;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24163;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=984;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24694;
UPDATE `creature_model_info` SET `BoundingRadius`=10.5548, `VerifiedBuild`=25996 WHERE `DisplayID`=23739;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24702;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24772;
UPDATE `creature_model_info` SET `BoundingRadius`=3.685953, `VerifiedBuild`=25996 WHERE `DisplayID`=12818;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24771;
UPDATE `creature_model_info` SET `BoundingRadius`=0.3981705, `VerifiedBuild`=25996 WHERE `DisplayID`=24590;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24701;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24137;
UPDATE `creature_model_info` SET `BoundingRadius`=1.100027, `VerifiedBuild`=25996 WHERE `DisplayID`=25381;
UPDATE `creature_model_info` SET `BoundingRadius`=5.55264, `VerifiedBuild`=25996 WHERE `DisplayID`=24954;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24062;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25347;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24061;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24059;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24060;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=14886;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23832;
UPDATE `creature_model_info` SET `BoundingRadius`=0.3, `VerifiedBuild`=25996 WHERE `DisplayID`=27183;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=27175;
UPDATE `creature_model_info` SET `BoundingRadius`=0.3, `VerifiedBuild`=25996 WHERE `DisplayID`=27181;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=27173;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23833;
UPDATE `creature_model_info` SET `BoundingRadius`=1.38816, `VerifiedBuild`=25996 WHERE `DisplayID`=24840;
UPDATE `creature_model_info` SET `BoundingRadius`=2.77632, `VerifiedBuild`=25996 WHERE `DisplayID`=24857;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=10271;
UPDATE `creature_model_info` SET `BoundingRadius`=1.030285, `VerifiedBuild`=25996 WHERE `DisplayID`=27278;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23845;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=27172;
UPDATE `creature_model_info` SET `BoundingRadius`=3.4704, `VerifiedBuild`=25996 WHERE `DisplayID`=24856;
UPDATE `creature_model_info` SET `BoundingRadius`=4.292855, `VerifiedBuild`=25996 WHERE `DisplayID`=27271;
UPDATE `creature_model_info` SET `BoundingRadius`=2.833284, `VerifiedBuild`=25996 WHERE `DisplayID`=27275;
UPDATE `creature_model_info` SET `BoundingRadius`=1.287856, `VerifiedBuild`=25996 WHERE `DisplayID`=27276;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=42735;
UPDATE `creature_model_info` SET `BoundingRadius`=1.030285, `VerifiedBuild`=25996 WHERE `DisplayID`=27277;
UPDATE `creature_model_info` SET `BoundingRadius`=0.383, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77791;
UPDATE `creature_model_info` SET `BoundingRadius`=0.8725, `CombatReach`=3.75, `VerifiedBuild`=25996 WHERE `DisplayID`=77794;
UPDATE `creature_model_info` SET `BoundingRadius`=0.306, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77795;
UPDATE `creature_model_info` SET `BoundingRadius`=0.306, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77792;
UPDATE `creature_model_info` SET `BoundingRadius`=0.372, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77793;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33907;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33872;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33913;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33870;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33877;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33908;
UPDATE `creature_model_info` SET `BoundingRadius`=0.347222, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77788;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33875;
UPDATE `creature_model_info` SET `BoundingRadius`=0.3519, `CombatReach`=1.725, `VerifiedBuild`=25996 WHERE `DisplayID`=78231;
UPDATE `creature_model_info` SET `BoundingRadius`=0.93, `CombatReach`=15, `VerifiedBuild`=25996 WHERE `DisplayID`=78103;
UPDATE `creature_model_info` SET `BoundingRadius`=0.93, `CombatReach`=15, `VerifiedBuild`=25996 WHERE `DisplayID`=78104;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33873;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33871;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33874;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33876;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=66131;
UPDATE `creature_model_info` SET `BoundingRadius`=2.561949, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=74442;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=21773;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24469;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24467;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24466;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24453;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24468;
UPDATE `creature_model_info` SET `BoundingRadius`=4.16448, `VerifiedBuild`=25996 WHERE `DisplayID`=24850;
UPDATE `creature_model_info` SET `BoundingRadius`=0.465, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=70392;
UPDATE `creature_model_info` SET `BoundingRadius`=0.4213, `CombatReach`=1.65, `VerifiedBuild`=25996 WHERE `DisplayID`=76937;
UPDATE `creature_model_info` SET `BoundingRadius`=4.16448, `VerifiedBuild`=25996 WHERE `DisplayID`=24854;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24817;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=23962;
UPDATE `creature_model_info` SET `BoundingRadius`=0.21, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77547;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=26748;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=14308;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=14357;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=14355;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24176;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=26741;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=26747;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24234;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=14358;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=6371;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24958;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24956;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24955;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24953;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24951;
UPDATE `creature_model_info` SET `BoundingRadius`=3.010244, `VerifiedBuild`=25996 WHERE `DisplayID`=25257;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24816;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=14359;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=14356;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=14888;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24706;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24140;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24175;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24781;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=25710;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24743;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=28017;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=31103;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24786;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24877;
UPDATE `creature_model_info` SET `BoundingRadius`=0.6781119, `VerifiedBuild`=25996 WHERE `DisplayID`=28227;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24976;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24190;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=6376;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24782;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=27217;
UPDATE `creature_model_info` SET `BoundingRadius`=4, `CombatReach`=4, `VerifiedBuild`=25996 WHERE `DisplayID`=72981;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=31777;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=29213;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=32107;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33357;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=32086;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33358;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=36763;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=48747;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=33359;
UPDATE `creature_model_info` SET `BoundingRadius`=0.306, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=80441;
UPDATE `creature_model_info` SET `BoundingRadius`=0.389, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=80440;
UPDATE `creature_model_info` SET `BoundingRadius`=0.389, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=80439;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=64500;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=65927;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=64037;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=63217;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=63227;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=68965;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=64038;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=70796;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=64638;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=64633;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=64637;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=63760;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=63439;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=62644;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=47711;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=16943;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=16257;
UPDATE `creature_model_info` SET `BoundingRadius`=1, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77964;
UPDATE `creature_model_info` SET `BoundingRadius`=1, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77961;
UPDATE `creature_model_info` SET `BoundingRadius`=1, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77959;
UPDATE `creature_model_info` SET `BoundingRadius`=1, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=78675;
UPDATE `creature_model_info` SET `BoundingRadius`=1, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77958;
UPDATE `creature_model_info` SET `BoundingRadius`=1, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=77963;
UPDATE `creature_model_info` SET `BoundingRadius`=0.2822891, `CombatReach`=3, `VerifiedBuild`=25996 WHERE `DisplayID`=56253;
UPDATE `creature_model_info` SET `BoundingRadius`=2.692422, `CombatReach`=9, `VerifiedBuild`=25996 WHERE `DisplayID`=81327;
UPDATE `creature_model_info` SET `BoundingRadius`=0.875, `CombatReach`=1.75, `VerifiedBuild`=25996 WHERE `DisplayID`=51658;
UPDATE `creature_model_info` SET `BoundingRadius`=0.372, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=80581;
UPDATE `creature_model_info` SET `BoundingRadius`=9.501485, `CombatReach`=6.75, `VerifiedBuild`=25996 WHERE `DisplayID`=82242;
UPDATE `creature_model_info` SET `BoundingRadius`=5.489814, `CombatReach`=9.9, `VerifiedBuild`=25996 WHERE `DisplayID`=78491;
UPDATE `creature_model_info` SET `BoundingRadius`=4.896406, `CombatReach`=9.6, `VerifiedBuild`=25996 WHERE `DisplayID`=78489;
UPDATE `creature_model_info` SET `BoundingRadius`=5.433746, `CombatReach`=10.5, `VerifiedBuild`=25996 WHERE `DisplayID`=78492;
UPDATE `creature_model_info` SET `BoundingRadius`=5.840499, `CombatReach`=9.6, `VerifiedBuild`=25996 WHERE `DisplayID`=78709;
UPDATE `creature_model_info` SET `BoundingRadius`=6.15398, `CombatReach`=9.6, `VerifiedBuild`=25996 WHERE `DisplayID`=78493;
UPDATE `creature_model_info` SET `BoundingRadius`=4.956306, `CombatReach`=9.6, `VerifiedBuild`=25996 WHERE `DisplayID`=78490;
UPDATE `creature_model_info` SET `BoundingRadius`=4.924653, `CombatReach`=9.6, `VerifiedBuild`=25996 WHERE `DisplayID`=78488;
UPDATE `creature_model_info` SET `BoundingRadius`=3.916014, `CombatReach`=13.75, `VerifiedBuild`=25996 WHERE `DisplayID`=76570;
UPDATE `creature_model_info` SET `BoundingRadius`=2.522332, `CombatReach`=6.25, `VerifiedBuild`=25996 WHERE `DisplayID`=77538;
UPDATE `creature_model_info` SET `CombatReach`=1.2 WHERE `DisplayID`=75888;
UPDATE `creature_model_info` SET `CombatReach`=1.648352 WHERE `DisplayID`=74923;
UPDATE `creature_model_info` SET `BoundingRadius`=2.017865, `CombatReach`=5, `VerifiedBuild`=25996 WHERE `DisplayID`=77653;
UPDATE `creature_model_info` SET `BoundingRadius`=2.307743, `CombatReach`=3.6, `VerifiedBuild`=25996 WHERE `DisplayID`=79842;
UPDATE `creature_model_info` SET `BoundingRadius`=1.996296, `CombatReach`=3.6, `VerifiedBuild`=25996 WHERE `DisplayID`=79846;
UPDATE `creature_model_info` SET `BoundingRadius`=1.836152, `CombatReach`=3.6, `VerifiedBuild`=25996 WHERE `DisplayID`=79852;
UPDATE `creature_model_info` SET `BoundingRadius`=1.882959, `CombatReach`=6.25, `VerifiedBuild`=25996 WHERE `DisplayID`=76917;
UPDATE `creature_model_info` SET `BoundingRadius`=4.094897, `CombatReach`=6.25, `VerifiedBuild`=25996 WHERE `DisplayID`=76919;
UPDATE `creature_model_info` SET `BoundingRadius`=6.412943, `CombatReach`=8, `VerifiedBuild`=25996 WHERE `DisplayID`=76327;
UPDATE `creature_model_info` SET `BoundingRadius`=4.094851, `CombatReach`=6.25, `VerifiedBuild`=25996 WHERE `DisplayID`=76918;
UPDATE `creature_model_info` SET `BoundingRadius`=1.147, `CombatReach`=3, `VerifiedBuild`=25996 WHERE `DisplayID`=77142;
UPDATE `creature_model_info` SET `BoundingRadius`=2.017865, `CombatReach`=5, `VerifiedBuild`=25996 WHERE `DisplayID`=77296;
UPDATE `creature_model_info` SET `BoundingRadius`=1.483246, `CombatReach`=3, `VerifiedBuild`=25996 WHERE `DisplayID`=77019;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=65116;
UPDATE `creature_model_info` SET `BoundingRadius`=17.45859, `CombatReach`=25, `VerifiedBuild`=25996 WHERE `DisplayID`=54860;
UPDATE `creature_model_info` SET `BoundingRadius`=3.637638, `CombatReach`=11.25, `VerifiedBuild`=25996 WHERE `DisplayID`=77295;
UPDATE `creature_model_info` SET `BoundingRadius`=3.637638, `CombatReach`=11.25, `VerifiedBuild`=25996 WHERE `DisplayID`=77748;
UPDATE `creature_model_info` SET `BoundingRadius`=2.541934, `CombatReach`=7, `VerifiedBuild`=25996 WHERE `DisplayID`=78031;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=35495;
UPDATE `creature_model_info` SET `BoundingRadius`=12.53201, `CombatReach`=75, `VerifiedBuild`=25996 WHERE `DisplayID`=79045;
UPDATE `creature_model_info` SET `BoundingRadius`=5.048706, `CombatReach`=4.5, `VerifiedBuild`=25996 WHERE `DisplayID`=74446;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=73021;
UPDATE `creature_model_info` SET `BoundingRadius`=1.794317, `CombatReach`=5, `VerifiedBuild`=25996 WHERE `DisplayID`=81040;
UPDATE `creature_model_info` SET `BoundingRadius`=1.284656, `CombatReach`=4, `VerifiedBuild`=25996 WHERE `DisplayID`=77321;
UPDATE `creature_model_info` SET `BoundingRadius`=1.45271, `CombatReach`=1.5 WHERE `DisplayID`=9018;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=17321;
UPDATE `creature_model_info` SET `BoundingRadius`=1.828017, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=70435;
UPDATE `creature_model_info` SET `BoundingRadius`=1.828017, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=70434;
UPDATE `creature_model_info` SET `BoundingRadius`=4.850184, `CombatReach`=15, `VerifiedBuild`=25996 WHERE `DisplayID`=79610;
UPDATE `creature_model_info` SET `BoundingRadius`=1.45271, `CombatReach`=1.5 WHERE `DisplayID`=9129;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=31104;
UPDATE `creature_model_info` SET `BoundingRadius`=16.17915, `CombatReach`=42, `VerifiedBuild`=25996 WHERE `DisplayID`=79579;
UPDATE `creature_model_info` SET `BoundingRadius`=24, `CombatReach`=24, `VerifiedBuild`=25996 WHERE `DisplayID`=78648;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=67127;
UPDATE `creature_model_info` SET `BoundingRadius`=1.55055, `CombatReach`=3, `VerifiedBuild`=25996 WHERE `DisplayID`=79723;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=59158;
UPDATE `creature_model_info` SET `BoundingRadius`=9.555006, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=75780;
UPDATE `creature_model_info` SET `BoundingRadius`=2.050935, `CombatReach`=1, `VerifiedBuild`=25996 WHERE `DisplayID`=56044;
UPDATE `creature_model_info` SET `BoundingRadius`=4.029676, `CombatReach`=4.725, `VerifiedBuild`=25996 WHERE `DisplayID`=78229;
UPDATE `creature_model_info` SET `BoundingRadius`=2.984945, `CombatReach`=2, `VerifiedBuild`=25996 WHERE `DisplayID`=78506;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=78507;
UPDATE `creature_model_info` SET `BoundingRadius`=1.005061, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=65891;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=62543;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=63463;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=69978;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=62544;
UPDATE `creature_model_info` SET `BoundingRadius`=0.62, `CombatReach`=2 WHERE `DisplayID`=34772;
UPDATE `creature_model_info` SET `BoundingRadius`=0.8821245, `CombatReach`=0.4 WHERE `DisplayID`=43898;
UPDATE `creature_model_info` SET `CombatReach`=1 WHERE `DisplayID`=33012;
UPDATE `creature_model_info` SET `BoundingRadius`=2.028713 WHERE `DisplayID`=55131;
UPDATE `creature_model_info` SET `BoundingRadius`=0.465 WHERE `DisplayID`=31471;
UPDATE `creature_model_info` SET `BoundingRadius`=0.7510955, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=71722;
UPDATE `creature_model_info` SET `BoundingRadius`=3.389657, `CombatReach`=3.5 WHERE `DisplayID`=39908;
UPDATE `creature_model_info` SET `BoundingRadius`=1.531279 WHERE `DisplayID`=27972;
UPDATE `creature_model_info` SET `CombatReach`=1.5 WHERE `DisplayID`=44898;
UPDATE `creature_model_info` SET `VerifiedBuild`=25996 WHERE `DisplayID`=24862;
UPDATE `creature_model_info` SET `BoundingRadius`=5.877525, `CombatReach`=9.45, `VerifiedBuild`=25996 WHERE `DisplayID`=74999;
UPDATE `creature_model_info` SET `BoundingRadius`=2.596362, `CombatReach`=8, `VerifiedBuild`=25996 WHERE `DisplayID`=75613;
UPDATE `creature_model_info` SET `BoundingRadius`=0.62, `CombatReach`=2, `VerifiedBuild`=25996 WHERE `DisplayID`=76632;
UPDATE `creature_model_info` SET `BoundingRadius`=3.349109, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=74871;
UPDATE `creature_model_info` SET `BoundingRadius`=2.092043, `CombatReach`=2, `VerifiedBuild`=25996 WHERE `DisplayID`=74639;
UPDATE `creature_model_info` SET `BoundingRadius`=4.461882, `CombatReach`=2.5, `VerifiedBuild`=25996 WHERE `DisplayID`=67636;
UPDATE `creature_model_info` SET `BoundingRadius`=4.54107, `CombatReach`=6.3, `VerifiedBuild`=25996 WHERE `DisplayID`=76022;
UPDATE `creature_model_info` SET `BoundingRadius`=2.7502, `CombatReach`=1.1, `VerifiedBuild`=25996 WHERE `DisplayID`=71753;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=75823;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=75831;
UPDATE `creature_model_info` SET `BoundingRadius`=0.3, `VerifiedBuild`=25996 WHERE `DisplayID`=39353;
UPDATE `creature_model_info` SET `BoundingRadius`=2.57633, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=76018;
UPDATE `creature_model_info` SET `BoundingRadius`=2.57633, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=76017;
UPDATE `creature_model_info` SET `BoundingRadius`=1, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=76617;
UPDATE `creature_model_info` SET `BoundingRadius`=6.028629, `CombatReach`=8, `VerifiedBuild`=25996 WHERE `DisplayID`=74482;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=75828;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=75829;
UPDATE `creature_model_info` SET `BoundingRadius`=1.784167, `CombatReach`=3, `VerifiedBuild`=25996 WHERE `DisplayID`=74870;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=75825;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=76261;
UPDATE `creature_model_info` SET `BoundingRadius`=2.57633, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=75988;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=75826;
UPDATE `creature_model_info` SET `BoundingRadius`=1.5, `CombatReach`=2.25, `VerifiedBuild`=25996 WHERE `DisplayID`=75824;
UPDATE `creature_model_info` SET `BoundingRadius`=1.210244, `CombatReach`=2, `VerifiedBuild`=25996 WHERE `DisplayID`=64809;
UPDATE `creature_model_info` SET `BoundingRadius`=0.773124, `CombatReach`=1.5, `VerifiedBuild`=25996 WHERE `DisplayID`=76629;

DELETE FROM `npc_vendor` WHERE (`entry`=107326 AND `item`=144346 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=107326 AND `item`=118599 AND `ExtendedCost`=5886 AND `type`=1) OR (`entry`=106655 AND `item`=157796 AND `ExtendedCost`=6300 AND `type`=1) OR (`entry`=106655 AND `item`=154879 AND `ExtendedCost`=6299 AND `type`=1) OR (`entry`=115373 AND `item`=64670 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=39505 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=20815 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=5956 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=6217 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=6256 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=85663 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=7005 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=2901 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=138293 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=90146 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=4470 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=38682 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=3371 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=115373 AND `item`=39354 AND `ExtendedCost`=0 AND `type`=1);
INSERT INTO `npc_vendor` (`entry`, `slot`, `item`, `maxcount`, `ExtendedCost`, `type`, `PlayerConditionID`, `IgnoreFiltering`, `VerifiedBuild`) VALUES
(107326, 8, 144346, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(107326, 4, 118599, 0, 5886, 1, 0, 0, 25996), -- -Unknown-
(106655, 2, 157796, 0, 6300, 1, 0, 0, 25996), -- -Unknown-
(106655, 1, 154879, 0, 6299, 1, 0, 0, 25996), -- -Unknown-
(115373, 15, 64670, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 14, 39505, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 13, 20815, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 12, 5956, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 11, 6217, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 10, 6256, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 9, 85663, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 8, 7005, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 7, 2901, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 6, 138293, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 5, 90146, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 4, 4470, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 3, 38682, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 2, 3371, 0, 0, 1, 0, 0, 25996), -- -Unknown-
(115373, 1, 39354, 0, 0, 1, 0, 0, 25996); -- -Unknown-

UPDATE `npc_vendor` SET `slot`=7, `VerifiedBuild`=25996 WHERE (`entry`=107326 AND `item`=140231 AND `ExtendedCost`=6073 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=6, `VerifiedBuild`=25996 WHERE (`entry`=107326 AND `item`=136910 AND `ExtendedCost`=5888 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=5, `VerifiedBuild`=25996 WHERE (`entry`=107326 AND `item`=129760 AND `ExtendedCost`=5888 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=3, `VerifiedBuild`=25996 WHERE (`entry`=107326 AND `item`=129878 AND `ExtendedCost`=5886 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=2, `VerifiedBuild`=25996 WHERE (`entry`=107326 AND `item`=140274 AND `ExtendedCost`=5887 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=1, `VerifiedBuild`=25996 WHERE (`entry`=107326 AND `item`=129798 AND `ExtendedCost`=5887 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=11, `VerifiedBuild`=25996 WHERE (`entry`=107109 AND `item`=136706 AND `ExtendedCost`=6072 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=10, `VerifiedBuild`=25996 WHERE (`entry`=107109 AND `item`=136702 AND `ExtendedCost`=6072 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=9, `VerifiedBuild`=25996 WHERE (`entry`=107109 AND `item`=136699 AND `ExtendedCost`=6072 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=8, `VerifiedBuild`=25996 WHERE (`entry`=107109 AND `item`=137727 AND `ExtendedCost`=6072 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=7, `VerifiedBuild`=25996 WHERE (`entry`=107109 AND `item`=137935 AND `ExtendedCost`=6072 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=3, `VerifiedBuild`=25996 WHERE (`entry`=107109 AND `item`=141860 AND `ExtendedCost`=6116 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=17, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=38682 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=16, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=39354 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=15, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=3371 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=14, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=52188 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=13, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=64670 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=12, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=4470 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=11, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=60335 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=10, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=81400 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=9, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=58274 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=8, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=159 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=7, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=74636 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=6, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=81414 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=5, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=81406 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=4, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=81409 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=3, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=81401 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=2, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=81415 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=1, `VerifiedBuild`=25996 WHERE (`entry`=62822 AND `item`=81407 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=20 WHERE (`entry`=32638 AND `item`=33449 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-
UPDATE `npc_vendor` SET `slot`=20 WHERE (`entry`=32638 AND `item`=33449 AND `ExtendedCost`=0 AND `type`=1); -- -Unknown-

DELETE FROM `creature_equip_template` WHERE (`CreatureID`=124103 AND `ID`=1) OR (`CreatureID`=124104 AND `ID`=1) OR (`CreatureID`=124101 AND `ID`=1) OR (`CreatureID`=124102 AND `ID`=1) OR (`CreatureID`=124074 AND `ID`=1) OR (`CreatureID`=124072 AND `ID`=1) OR (`CreatureID`=124096 AND `ID`=1) OR (`CreatureID`=124073 AND `ID`=1) OR (`CreatureID`=124071 AND `ID`=1) OR (`CreatureID`=122544 AND `ID`=1) OR (`CreatureID`=122524 AND `ID`=1) OR (`CreatureID`=27953 AND `ID`=6) OR (`CreatureID`=27953 AND `ID`=5) OR (`CreatureID`=27953 AND `ID`=4) OR (`CreatureID`=27953 AND `ID`=3) OR (`CreatureID`=27953 AND `ID`=2) OR (`CreatureID`=118003 AND `ID`=1) OR (`CreatureID`=128949 AND `ID`=1) OR (`CreatureID`=129896 AND `ID`=1) OR (`CreatureID`=129829 AND `ID`=1) OR (`CreatureID`=129897 AND `ID`=1) OR (`CreatureID`=129871 AND `ID`=1) OR (`CreatureID`=129872 AND `ID`=1) OR (`CreatureID`=124828 AND `ID`=1) OR (`CreatureID`=128169 AND `ID`=1) OR (`CreatureID`=121975 AND `ID`=1) OR (`CreatureID`=123680 AND `ID`=1) OR (`CreatureID`=122578 AND `ID`=1) OR (`CreatureID`=124158 AND `ID`=1) OR (`CreatureID`=129876 AND `ID`=1) OR (`CreatureID`=125682 AND `ID`=1) OR (`CreatureID`=125683 AND `ID`=1) OR (`CreatureID`=125689 AND `ID`=1) OR (`CreatureID`=123452 AND `ID`=1) OR (`CreatureID`=123451 AND `ID`=1) OR (`CreatureID`=125584 AND `ID`=1) OR (`CreatureID`=129050 AND `ID`=1) OR (`CreatureID`=126333 AND `ID`=1) OR (`CreatureID`=121982 AND `ID`=1) OR (`CreatureID`=119157 AND `ID`=1) OR (`CreatureID`=118804 AND `ID`=1) OR (`CreatureID`=117194 AND `ID`=1) OR (`CreatureID`=120374 AND `ID`=1) OR (`CreatureID`=119923 AND `ID`=1) OR (`CreatureID`=120778 AND `ID`=1) OR (`CreatureID`=118704 AND `ID`=1) OR (`CreatureID`=118703 AND `ID`=1) OR (`CreatureID`=119952 AND `ID`=1) OR (`CreatureID`=120779 AND `ID`=1) OR (`CreatureID`=118724 AND `ID`=1) OR (`CreatureID`=120770 AND `ID`=1) OR (`CreatureID`=120550 AND `ID`=1) OR (`CreatureID`=118690 AND `ID`=1) OR (`CreatureID`=119147 AND `ID`=1) OR (`CreatureID`=120312 AND `ID`=1) OR (`CreatureID`=120792 AND `ID`=1);
INSERT INTO `creature_equip_template` (`CreatureID`, `ID`, `ItemID1`, `AppearanceModID1`, `ItemVisual1`, `ItemID2`, `AppearanceModID2`, `ItemVisual2`, `ItemID3`, `AppearanceModID3`, `ItemVisual3`) VALUES
(124103, 1, 150596, 0, 0, 0, 0, 0, 0, 0, 0), -- 塔乐莎·韧皮
(124104, 1, 150588, 0, 0, 0, 0, 0, 0, 0, 0), -- 妖术师贾昆达
(124101, 1, 126937, 0, 0, 0, 0, 0, 0, 0, 0), -- 萝比·电压
(124102, 1, 57038, 0, 0, 0, 0, 0, 0, 0, 0), -- 格罗索格
(124074, 1, 57038, 0, 0, 0, 0, 0, 0, 0, 0), -- 亡灵卫兵战地队长
(124072, 1, 57038, 0, 0, 0, 0, 0, 0, 0, 0), -- 联盟战地指挥官
(124096, 1, 57038, 0, 0, 0, 0, 0, 0, 0, 0), -- 布里格斯
(124073, 1, 1896, 0, 0, 0, 0, 0, 0, 0, 0), -- 亡灵卫兵
(124071, 1, 1896, 0, 0, 0, 0, 0, 0, 0, 0), -- 联盟防御者
(122544, 1, 31253, 0, 0, 0, 0, 0, 0, 0, 0), -- 护园者尼瑟拉
(122524, 1, 39024, 0, 0, 0, 0, 0, 0, 0, 0), -- 食血者
(27953, 6, 38488, 0, 0, 0, 0, 0, 19368, 0, 0), -- 龙眠神殿保卫者
(27953, 5, 38487, 0, 0, 0, 0, 0, 19368, 0, 0), -- 龙眠神殿保卫者
(27953, 4, 38491, 0, 0, 0, 0, 0, 19368, 0, 0), -- 龙眠神殿保卫者
(27953, 3, 38490, 0, 0, 0, 0, 0, 19368, 0, 0), -- 龙眠神殿保卫者
(27953, 2, 38209, 0, 0, 0, 0, 0, 19368, 0, 0), -- 龙眠神殿保卫者
(118003, 1, 73012, 0, 0, 0, 0, 0, 38185, 0, 0), -- 洛拉希尔哨兵
(128949, 1, 152612, 0, 0, 0, 0, 0, 0, 0, 0), -- 先知维伦
(129896, 1, 101388, 0, 0, 138831, 0, 0, 0, 0, 0), -- 光铸百夫长
(129829, 1, 28738, 0, 0, 0, 0, 0, 0, 0, 0), -- 高阶女祭司伊莎娜
(129897, 1, 152342, 0, 0, 0, 0, 0, 0, 0, 0), -- 光铸牧师
(129871, 1, 26003, 0, 0, 0, 0, 0, 0, 0, 0), -- 救赎者阿拉托尔
(129872, 1, 0, 0, 0, 0, 0, 0, 42140, 0, 0), -- 温蕾萨·风行者
(124828, 1, 152429, 0, 0, 0, 0, 0, 0, 0, 0), -- 寂灭者阿古斯
(128169, 1, 101388, 0, 0, 138831, 0, 0, 0, 0, 0), -- 麦格尼·铜须
(121975, 1, 150764, 0, 0, 0, 0, 0, 0, 0, 0), -- 阿格拉玛
(123680, 1, 151027, 0, 0, 0, 0, 0, 0, 0, 0), -- 黑暗守护者艾迪斯
(122578, 1, 151794, 0, 0, 0, 0, 0, 0, 0, 0), -- 金加洛斯
(124158, 1, 151477, 0, 0, 0, 0, 0, 0, 0, 0), -- 猎魂者伊墨纳尔
(129876, 1, 126431, 0, 0, 45617, 0, 0, 0, 0, 0), -- 大技师罗姆尔
(125682, 1, 152612, 0, 0, 0, 0, 0, 0, 0, 0), -- 先知维伦
(125683, 1, 150732, 0, 0, 150732, 0, 0, 0, 0, 0), -- 伊利丹·怒风
(125689, 1, 0, 0, 0, 0, 0, 0, 151781, 0, 0), -- 奥蕾莉亚·风行者
(123452, 1, 124529, 0, 0, 0, 0, 0, 0, 0, 0), -- 邪能领主
(123451, 1, 118289, 0, 0, 0, 0, 0, 0, 0, 0), -- 恶魔卫士
(125584, 1, 101388, 0, 0, 138831, 0, 0, 0, 0, 0), -- 麦格尼·铜须
(129050, 1, 127651, 0, 0, 0, 0, 0, 0, 0, 0), -- 安托兰恶魔卫士
(126333, 1, 34671, 0, 0, 45849, 0, 0, 0, 0, 0), -- 导邪祭师
(121982, 1, 150732, 0, 0, 150732, 0, 0, 0, 0, 0), -- 伊利丹·怒风
(119157, 1, 133351, 0, 0, 0, 0, 0, 0, 0, 0), -- 恶魔卫士
(118804, 1, 124524, 0, 0, 0, 0, 0, 0, 0, 0), -- 多玛塔克斯
(117194, 1, 143630, 0, 0, 0, 0, 0, 0, 0, 0), -- 轻蔑的萨什比特
(120374, 1, 138752, 0, 0, 138744, 0, 0, 0, 0, 0), -- 恶魔卫士毁灭者
(119923, 1, 113988, 0, 0, 0, 0, 0, 0, 0, 0), -- 鬼火慰魂者
(120778, 1, 133519, 0, 0, 133519, 0, 0, 0, 0, 0), -- 愤怒卫士入侵者
(118704, 1, 104139, 0, 0, 0, 0, 0, 0, 0, 0), -- 杜尔扎克
(118703, 1, 133178, 0, 0, 0, 0, 0, 0, 0, 0), -- 邪脉植物学家
(119952, 1, 138752, 0, 0, 138744, 0, 0, 0, 0, 0), -- 恶魔卫士毁灭者
(120779, 1, 113838, 0, 0, 0, 0, 0, 0, 0, 0), -- 鬼火邪能使者
(118724, 1, 113838, 0, 0, 0, 0, 0, 0, 0, 0), -- 鬼火邪能使者
(120770, 1, 138752, 0, 0, 138744, 0, 0, 0, 0, 0), -- 恶魔卫士毁灭者
(120550, 1, 133519, 0, 0, 133519, 0, 0, 0, 0, 0), -- 愤怒卫士入侵者
(118690, 1, 133519, 0, 0, 133519, 0, 0, 0, 0, 0), -- 愤怒卫士入侵者
(119147, 1, 32425, 0, 0, 0, 0, 0, 0, 0, 0), -- 玛维·影歌
(120312, 1, 32425, 0, 0, 0, 0, 0, 0, 0, 0), -- 玛维·影歌
(120792, 1, 150732, 0, 0, 150732, 0, 0, 0, 0, 0); -- 伊利丹·怒风

UPDATE `creature_equip_template` SET `ItemID2`=0 WHERE (`CreatureID`=26448 AND `ID`=1); -- 群星之墓哨兵
UPDATE `creature_equip_template` SET `ItemID3`=0 WHERE (`CreatureID`=26198 AND `ID`=1); -- 飘雪林地狼獾人
UPDATE `creature_equip_template` SET `ItemID1`=0 WHERE (`CreatureID`=27943 AND `ID`=1); -- 达尔洛米
UPDATE `creature_equip_template` SET `ItemID1`=32729 WHERE (`CreatureID`=27953 AND `ID`=1); -- 龙眠神殿保卫者
UPDATE `creature_equip_template` SET `ItemID3`=89364 WHERE (`CreatureID`=94372 AND `ID`=1); -- 鲑鱼溪村民
UPDATE `creature_equip_template` SET `ItemID1`=59616, `ItemID3`=15323 WHERE (`CreatureID`=92617 AND `ID`=1); -- 鲑鱼溪村民
UPDATE `creature_equip_template` SET `ItemID1`=0 WHERE (`CreatureID`=121516 AND `ID`=1); -- 光铸战斗法师
UPDATE `creature_equip_template` SET `ItemID1`=2703 WHERE (`CreatureID`=118384 AND `ID`=1); -- 烈日行者勇士
UPDATE `creature_equip_template` SET `ItemID1`=112261, `ItemID2`=138831 WHERE (`CreatureID`=122130 AND `ID`=1); -- 高阶守备官

DELETE FROM `gossip_menu` WHERE (`MenuId`=20725 AND `TextId`=31110) OR (`MenuId`=20895 AND `TextId`=31424) OR (`MenuId`=21172 AND `TextId`=32288) OR (`MenuId`=21221 AND `TextId`=32193) OR (`MenuId`=21220 AND `TextId`=32192) OR (`MenuId`=21164 AND `TextId`=32105) OR (`MenuId`=21165 AND `TextId`=32106) OR (`MenuId`=21273 AND `TextId`=32283) OR (`MenuId`=21219 AND `TextId`=32191) OR (`MenuId`=21218 AND `TextId`=32190) OR (`MenuId`=21211 AND `TextId`=32182) OR (`MenuId`=21210 AND `TextId`=32182) OR (`MenuId`=21212 AND `TextId`=32182) OR (`MenuId`=21172 AND `TextId`=32114) OR (`MenuId`=21167 AND `TextId`=32108) OR (`MenuId`=21166 AND `TextId`=32107) OR (`MenuId`=21161 AND `TextId`=32102) OR (`MenuId`=21168 AND `TextId`=32109) OR (`MenuId`=21169 AND `TextId`=32110) OR (`MenuId`=21170 AND `TextId`=32111) OR (`MenuId`=21161 AND `TextId`=32101) OR (`MenuId`=21172 AND `TextId`=32185) OR (`MenuId`=21161 AND `TextId`=32100) OR (`MenuId`=18273 AND `TextId`=33196) OR (`MenuId`=21755 AND `TextId`=33194) OR (`MenuId`=21351 AND `TextId`=32452) OR (`MenuId`=21348 AND `TextId`=32448) OR (`MenuId`=21349 AND `TextId`=32450) OR (`MenuId`=21829 AND `TextId`=33359) OR (`MenuId`=21824 AND `TextId`=33354) OR (`MenuId`=21820 AND `TextId`=33351) OR (`MenuId`=21825 AND `TextId`=33355) OR (`MenuId`=21821 AND `TextId`=33352) OR (`MenuId`=21826 AND `TextId`=33356) OR (`MenuId`=21823 AND `TextId`=33353) OR (`MenuId`=21675 AND `TextId`=33019) OR (`MenuId`=21687 AND `TextId`=32550) OR (`MenuId`=21689 AND `TextId`=33041) OR (`MenuId`=21352 AND `TextId`=32453) OR (`MenuId`=21377 AND `TextId`=32550) OR (`MenuId`=21600 AND `TextId`=32868) OR (`MenuId`=21203 AND `TextId`=33006) OR (`MenuId`=21065 AND `TextId`=31840) OR (`MenuId`=21063 AND `TextId`=31838) OR (`MenuId`=20957 AND `TextId`=31568) OR (`MenuId`=19950 AND `TextId`=29658) OR (`MenuId`=19721 AND `TextId`=29250) OR (`MenuId`=21173 AND `TextId`=32117);
INSERT INTO `gossip_menu` (`MenuId`, `TextId`) VALUES
(20725, 31110), -- 96818 (出纳员哈娜)
(20895, 31424), -- 119892 (麦格尼·铜须)
(21172, 32288), -- 122663 (克罗米)
(21221, 32193), -- 122550 (克雷苟斯)
(21220, 32192), -- 122550 (克雷苟斯)
(21164, 32105), -- 122511 (阿莱克丝塔萨，生命的缚誓者)
(21165, 32106), -- 122510 (克罗米)
(21273, 32283), -- 124379 (阿德林·韧皮)
(21219, 32191), -- 122544 (护园者尼瑟拉)
(21218, 32190), -- 122544 (护园者尼瑟拉)
(21211, 32182), -- 122546 (布鲁彼得)
(21210, 32182), -- 122545 (奥德拉长老)
(21212, 32182), -- 122547 (巴克隆)
(21172, 32114), -- 122663 (克罗米)
(21167, 32108), -- 122514 (卡雷苟斯)
(21166, 32107), -- 122513 (伊萨里奥斯勋爵)
(21161, 32102), -- 27856 (克罗米)
(21168, 32109), -- 122511 (阿莱克丝塔萨，生命的缚誓者)
(21169, 32110), -- 122513 (伊萨里奥斯勋爵)
(21170, 32111), -- 122514 (卡雷苟斯)
(21161, 32101), -- 27856 (克罗米)
(21172, 32185), -- 122663 (克罗米)
(21161, 32100), -- 27856 (克罗米)
(18273, 33196), -- 91462 (玛法里奥·怒风)
(21755, 33194), -- 104921 (泰兰德·语风)
(21351, 32452), -- 125349 (恩斯特拉)
(21348, 32448), -- 125341 (卡米尔)
(21349, 32450), -- 125343 (沃雷尔)
(21829, 33359), -- 129876 (大技师罗姆尔)
(21824, 33354), -- 125512 (大主教图拉扬)
(21820, 33351), -- 125689 (奥蕾莉亚·风行者)
(21825, 33355), -- 129872 (温蕾萨·风行者)
(21821, 33352), -- 129871 (救赎者阿拉托尔)
(21826, 33356), -- 125691 (大法师卡德加)
(21823, 33353), -- 128949 (先知维伦)
(21675, 33019), -- 128169 (麦格尼·铜须)
(21687, 32550), -- 128303 (光铸道标)
(21689, 33041), -- 128241 (希尔格林)
(21352, 32453), -- 125351 (凯拉)
(21377, 32550), -- 125720 (光铸道标)
(21600, 32868), -- 127963 (光铸战争机甲)
(21203, 33006), -- 122500 (艾欧娜尔的精华)
(21065, 31840), -- 120316 (马特·德瓦恩)
(21063, 31838), -- 115373 (安克斯)
(20957, 31568), -- 120221 (艾里扎尔·锤须)
(19950, 29658), -- 109612 (护林者达兰妮尔)
(19721, 29250), -- 103832 (守护者雷姆洛斯)
(21173, 32117); -- 120792 (伊利丹·怒风)

DELETE FROM `gossip_menu_option` WHERE (`MenuId`=20725 AND `OptionIndex`=0) OR (`MenuId`=20895 AND `OptionIndex`=0) OR (`MenuId`=21172 AND `OptionIndex`=3) OR (`MenuId`=21172 AND `OptionIndex`=2) OR (`MenuId`=21161 AND `OptionIndex`=3) OR (`MenuId`=21220 AND `OptionIndex`=0) OR (`MenuId`=21219 AND `OptionIndex`=0) OR (`MenuId`=21218 AND `OptionIndex`=0) OR (`MenuId`=21161 AND `OptionIndex`=2) OR (`MenuId`=21165 AND `OptionIndex`=0) OR (`MenuId`=21168 AND `OptionIndex`=0) OR (`MenuId`=21164 AND `OptionIndex`=0) OR (`MenuId`=21169 AND `OptionIndex`=0) OR (`MenuId`=21166 AND `OptionIndex`=0) OR (`MenuId`=21170 AND `OptionIndex`=0) OR (`MenuId`=21167 AND `OptionIndex`=0) OR (`MenuId`=21161 AND `OptionIndex`=1) OR (`MenuId`=21172 AND `OptionIndex`=1) OR (`MenuId`=21161 AND `OptionIndex`=0) OR (`MenuId`=18273 AND `OptionIndex`=1) OR (`MenuId`=21755 AND `OptionIndex`=0) OR (`MenuId`=19601 AND `OptionIndex`=2) OR (`MenuId`=21829 AND `OptionIndex`=3) OR (`MenuId`=21829 AND `OptionIndex`=2) OR (`MenuId`=21829 AND `OptionIndex`=1) OR (`MenuId`=21675 AND `OptionIndex`=0) OR (`MenuId`=21380 AND `OptionIndex`=4) OR (`MenuId`=21380 AND `OptionIndex`=2) OR (`MenuId`=21687 AND `OptionIndex`=1) OR (`MenuId`=21689 AND `OptionIndex`=0) OR (`MenuId`=21377 AND `OptionIndex`=0) OR (`MenuId`=21600 AND `OptionIndex`=0) OR (`MenuId`=21203 AND `OptionIndex`=2) OR (`MenuId`=21065 AND `OptionIndex`=0) OR (`MenuId`=21063 AND `OptionIndex`=0) OR (`MenuId`=21173 AND `OptionIndex`=0);
INSERT INTO `gossip_menu_option` (`MenuId`, `OptionIndex`, `OptionIcon`, `OptionText`, `OptionBroadcastTextId`) VALUES
(20725, 0, 6, '我要进入我的银行。', 125594),
(20895, 0, 0, '让我们听听她怎么说吧，麦格尼。', 128392),
(21172, 3, 0, '我准备好了。我们去救你的命吧！\n|cFF0000FF（开启场景战役。）|r', 0),
(21172, 2, 32, '我们调整一下战术吧。\n|cFF0000FF（变更克罗米的天赋。）|r', 0),
(21161, 3, 0, '我们再尝试一次吧！', 132073),
(21220, 0, 0, '我们正在寻找袭击克罗米的人。我们听说你遇到了一些魔网方面的麻烦——你觉得这两件事会有联系吗？', 132597),
(21219, 0, 0, '我们可以帮忙。', 132596), 
(21218, 0, 0, '我们正在寻找袭击克罗米的人。你遇到过什么怪事吗？', 132595),
(21161, 2, 0, '就等你了！', 133626),
(21165, 0, 0, '最近有什么怪事吗？', 132087),
(21168, 0, 0, '我明白了，谢谢你。', 132091), -- OptionBroadcastTextID: 38415 - 132091
(21164, 0, 0, '最近有什么怪事吗？', 132087),
(21169, 0, 0, '我明白了，谢谢你。', 132091), -- OptionBroadcastTextID: 38415 - 132091
(21166, 0, 0, '最近有什么怪事吗？', 132087),
(21170, 0, 0, '我明白了，谢谢你。', 132091), -- OptionBroadcastTextID: 38415 - 132091
(21167, 0, 0, '最近有什么怪事吗？', 132087),
(21161, 1, 0, '我们准备好了。让我们再试一次吧！', 133625),
(21172, 1, 0, '就等你了。', 132577), -- OptionBroadcastTextID: 62098 - 132577 - 103569
(21161, 0, 0, '我准备好了。我们走！', 132063),
(18273, 1, 0, '伊利丹让我把这块水晶带给你。', 138840),
(21755, 0, 0, '伊利丹让我把这块水晶带给你。', 138840),
(19601, 2, 1, '让我看看你出售的货物。', 95471), -- OptionBroadcastTextID: 2823 - 20225 - 20232 - 27299 - 29959 - 67573 - 83214 - 95471
(21829, 3, 0, '破碎群岛上方的达拉然', 129157),
(21829, 2, 0, '燃烧王座', 134920),
(21829, 1, 0, '排气口', 134913),
(21675, 0, 0, '我准备好了。', 130105), -- OptionBroadcastTextID: 4084 - 27602 - 28039 - 35320 - 35539 - 39152 - 50996 - 52091 - 52966 - 68157 - 72264 - 75831 - 77207 - 137729 - 137286 - 134034 - 132934 - 130808 - 130536 - 130105 - 129525 - 128423 - 125992 - 124171 - 122483 - 122010 - 121757 - 120960 - 120867 - 120845 - 118751 - 117010 - 116029 - 115011 - 114517 - 114311 - 111965 - 110410 - 109483 - 109366 - 108067 - 107434 - 106714 - 106086 - 105611 - 105455 - 105294 - 104314 - 102817 - 101165 - 98694 - 96430 - 93586
(21380, 4, 0, '<观看万神殿的破灭。>', 137566),
(21380, 2, 0, '<将你的手放在石头上。>', 135022),
(21687, 1, 0, '燃烧王座', 134920),
(21689, 0, 0, '<驻足聆听。>', 137786),
(21377, 0, 0, '排气口', 134913),
(21600, 0, 0, '我准备好了。', 130105), -- OptionBroadcastTextID: 4084 - 27602 - 28039 - 35320 - 35539 - 39152 - 50996 - 52091 - 52966 - 68157 - 72264 - 75831 - 77207 - 137729 - 137286 - 134034 - 132934 - 130808 - 130536 - 130105 - 129525 - 128423 - 125992 - 124171 - 122483 - 122010 - 121757 - 120960 - 120867 - 120845 - 118751 - 117010 - 116029 - 115011 - 114517 - 114311 - 111965 - 110410 - 109483 - 109366 - 108067 - 107434 - 106714 - 106086 - 105611 - 105455 - 105294 - 104314 - 102817 - 101165 - 98694 - 96430 - 93586
(21203, 2, 0, '把我送回安托鲁斯。', 137650),
(21065, 0, 1, '我想从你这里买点东西。', 7142), -- OptionBroadcastTextID: 2583 - 6399 - 7142
(21063, 0, 1, '我想从你这里买点东西。', 7142), -- OptionBroadcastTextID: 2583 - 6399 - 7142
(21173, 0, 0, '我想离开这里。', 123355);


UPDATE `gossip_menu_option` SET `OptionText`='我想去龙眠神殿中层，与阿弗拉沙斯塔兹指挥官谈一谈。' WHERE (`MenuId`=9457 AND `OptionIndex`=1);
UPDATE `gossip_menu_option` SET `OptionText`='嗯，我想返回神殿底层。' WHERE (`MenuId`=9457 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionIcon`=0, `OptionText`='我们可以帮忙。' WHERE (`MenuId`=21221 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionIcon`=0, `OptionText`='我们可以帮忙。' WHERE (`MenuId`=21221 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionIcon`=0, `OptionText`='我们可以帮忙。' WHERE (`MenuId`=21221 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='请让我接受训练。' WHERE (`MenuId`=19601 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='请让我接受训练。' WHERE (`MenuId`=19601 AND `OptionIndex`=0);
DELETE FROM `gossip_menu_option_action` WHERE (`MenuId`=21220 AND `OptionIndex`=0) OR (`MenuId`=21218 AND `OptionIndex`=0) OR (`MenuId`=21164 AND `OptionIndex`=0) OR (`MenuId`=21166 AND `OptionIndex`=0) OR (`MenuId`=21167 AND `OptionIndex`=0) OR (`MenuId`=21380 AND `OptionIndex`=4);
INSERT INTO `gossip_menu_option_action` (`MenuId`, `OptionIndex`, `ActionMenuId`, `ActionPoiId`) VALUES
(21220, 0, 21221, 0),
(21218, 0, 21219, 0),
(21164, 0, 21168, 0),
(21166, 0, 21169, 0),
(21167, 0, 21170, 0),
(21380, 4, 21380, 0);



UPDATE `creature_template` SET `minlevel`=98 WHERE `entry`=97756; -- 伊克罗特
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=190, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=8, `unit_flags`=33024, `unit_flags2`=2048 WHERE `entry`=116323; -- 下水道贱民
UPDATE `creature_template` SET `gossip_menu_id`=20895, `minlevel`=110, `maxlevel`=110, `faction`=2860, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33554432, `unit_flags2`=2048 WHERE `entry`=119892; -- 麦格尼·铜须
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1665, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=33556480 WHERE `entry`=120971; -- 生命侍女
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=360448, `unit_flags2`=35653632 WHERE `entry`=120486; -- 痛苦聚合体
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=360448, `unit_flags2`=35653632 WHERE `entry`=120487; -- 梦魇恐魔
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=360448, `unit_flags2`=35653632 WHERE `entry`=120472; -- 令人不安的残影
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=360448, `unit_flags2`=35653632 WHERE `entry`=120470; -- 凝结的梦魇
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `npcflag`=16777216, `speed_walk`=1.2, `speed_run`=0.4285714, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33280, `unit_flags2`=33556480 WHERE `entry`=119895; -- 防御构装体
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33587200, `unit_flags2`=33556480 WHERE `entry`=122929; -- 虚空触须
UPDATE `creature_template` SET `faction`=190, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=2048 WHERE `entry`=120111; -- Trigger Bunny
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33915392, `unit_flags2`=35653632, `unit_flags3`=1 WHERE `entry`=120479; -- 蠕行恐魔
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=360448, `unit_flags2`=35653632 WHERE `entry`=120484; -- 鬼魅幻影
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=360448, `unit_flags2`=35653632 WHERE `entry`=121008; -- 不安的绝望
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=360448, `unit_flags2`=35653632 WHERE `entry`=120489; -- 痛苦幻象
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1665, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=33556480, `HoverHeight`=2 WHERE `entry`=120488; -- 防御节点
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=190, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=100665344 WHERE `entry`=121244; -- Azeroth's Warning Nightmare Bunny
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1665, `speed_walk`=1.2, `speed_run`=0.4285714, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=33556480 WHERE `entry`=120974; -- 监控构造体
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80 WHERE `entry`=28069; -- 索拉查卫士
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=28641; -- 凋零的身体
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `speed_walk`=1, `unit_flags2`=2099200 WHERE `entry`=29066; -- 泰坦哨兵
UPDATE `creature_template` SET `minlevel`=67, `maxlevel`=80, `unit_flags2`=1073743872 WHERE `entry`=32492; -- 霜巢雌龙
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `speed_walk`=1, `unit_flags`=32768 WHERE `entry`=29124; -- 源血元素
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `speed_walk`=1 WHERE `entry`=29123; -- 天灾巨怪
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `speed_run`=1.142857, `unit_flags`=0 WHERE `entry`=28108; -- 骨镰劫掠者
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `unit_flags`=32768 WHERE `entry`=28096; -- 硬皮冲锋者
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=28101; -- 损毁的天灾怪
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `npcflag`=1, `unit_flags`=537166080, `unit_flags2`=2049 WHERE `entry`=28217; -- 受伤的雨声神谕者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `npcflag`=8192 WHERE `entry`=28574; -- 玛尔文·摇链
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `npcflag`=2 WHERE `entry`=28568; -- 塔玛拉·摇链

UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `speed_walk`=1, `speed_run`=1.142857 WHERE `entry`=28315; -- 萨满祭司维克伊克
UPDATE `creature_template` SET `speed_run`=1.142857 WHERE `entry`=30362; -- 长者杉德雷
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `unit_flags`=0 WHERE `entry`=28010; -- 搁浅的蛇颈龙
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `unit_flags`=32768 WHERE `entry`=29036; -- 弗蕾亚的仆从
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `unit_flags`=32768 WHERE `entry`=28002; -- 蛮藤谷鳄鱼
UPDATE `creature_template` SET `npcflag`=1073741824, `speed_run`=0.8571429, `unit_flags`=512, `unit_flags2`=2048 WHERE `entry`=62815; -- 黄蟾蜍
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `unit_flags`=0 WHERE `entry`=28011; -- 帝王眼镜蛇
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `speed_run`=1.142857, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768 WHERE `entry`=28098; -- 硬皮抢夺者
UPDATE `creature_template` SET `unit_flags2`=2099200 WHERE `entry`=28466; -- Fruit Tosser
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768 WHERE `entry`=28086; -- 蓝玉虫巢巨蜂
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80 WHERE `entry`=28085; -- 蓝玉虫巢雄蜂
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=80, `unit_flags`=0 WHERE `entry`=28129; -- 食草长颈鹿
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=25793; -- 回收机器人55-D型
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `faction`=35, `unit_flags`=570425344, `unit_flags2`=2049 WHERE `entry`=25781; -- 油坑
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `unit_flags`=0, `unit_flags2`=2099200 WHERE `entry`=25748; -- 覆满油污的鹰
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `unit_flags`=0, `unit_flags2`=2099200 WHERE `entry`=25817; -- 覆满油污的小鸟
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_walk`=1, `speed_run`=1.142857, `unit_flags`=0, `unit_flags2`=2099200 WHERE `entry`=25791; -- 沾满油污的狼
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `npcflag`=0, `speed_walk`=1, `unit_flags`=0 WHERE `entry`=25743; -- 雄性长毛猛犸象
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=26598; -- 米丝蒂·飞晨
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_run`=1.142857, `unit_flags2`=2099200 WHERE `entry`=25750; -- 浸满油污的驯鹿
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_run`=1.142857, `unit_flags`=0 WHERE `entry`=24613; -- 猛犸幼崽
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=25780; -- 阿布尼·扭矩
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_walk`=1, `speed_run`=1.142857, `unit_flags`=0 WHERE `entry`=24614; -- 长毛猛犸象
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=26600; -- 首席技师加尔比·旋链
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=26599; -- 威利斯·转轮
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110 WHERE `entry`=26602; -- 卡拉·芒星
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=26597; -- “母鹅”托比·铁栓
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=26645; -- 菲兹兰克工程人员
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=25766; -- 牵引机器人AC-9型
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=25747; -- 金吉·温纳特
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=26596; -- 查莉·诺斯托
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=25767; -- 菲兹兰克飞行员
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=25702; -- 墨尔杜·旋轮
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=26634; -- 菲兹兰克看护者鲁伯特·锐眼
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=25434; -- 犸格莫斯碾压者
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=25590; -- 菲兹兰克·铁阀
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=25428; -- 犸格莫斯萨满祭司
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=26619; -- 菲兹兰克伞兵
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `npcflag`=0, `speed_walk`=1, `speed_run`=3.428571, `unit_flags2`=2099200 WHERE `entry`=25765; -- 菲兹兰克轰炸机
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=25429; -- 犸格莫斯劫掠者
UPDATE `creature_template` SET `faction`=2136, `npcflag`=1073741824, `speed_run`=0.8571429, `unit_flags`=512, `unit_flags2`=2048 WHERE `entry`=62697; -- 油腻软泥怪
UPDATE `creature_template` SET `minlevel`=65, `maxlevel`=80 WHERE `entry`=21757; -- 大型电荷元素
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=25752; -- 清除机器人004-A8型
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=24957; -- 诅咒教派药剂师
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=25660; -- 生疮的食尸鬼
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `faction`=1991 WHERE `entry`=26126; -- 白骨战士
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=25758; -- 防御坦克66D型
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=25814; -- 菲兹兰克机械侏儒
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=25753; -- 警戒机器人57-K型
UPDATE `creature_template` SET `unit_flags2`=2099200 WHERE `entry`=32544; -- 蒸汽云雾
UPDATE `creature_template` SET `speed_walk`=1, `speed_run`=1.142857 WHERE `entry`=25739; -- 蒸汽喷泉口
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=24601; -- 蒸汽狂怒者
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=26725; -- 驯风者奥里尔
UPDATE `creature_template` SET `faction`=31, `npcflag`=1073741824, `speed_run`=0.8571429, `unit_flags`=512, `unit_flags2`=2048 WHERE `entry`=62695; -- 北风土拨鼠
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `unit_flags2`=2099200 WHERE `entry`=26041; -- Lightning Target
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_run`=1.142857, `unit_flags`=0 WHERE `entry`=25680; -- 沼泽驯鹿
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768 WHERE `entry`=25454; -- 苔原爬虫
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=25700; -- 鳄鱼人猎手
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=25701; -- 掘泥鳄鱼人
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=25699; -- 污泥鳄鱼人
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `unit_flags2`=2099200 WHERE `entry`=25383; -- 恩其拉憎恶
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `unit_flags2`=2099200 WHERE `entry`=26094; -- Naxxanar Caster
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_walk`=1, `speed_run`=1.142857 WHERE `entry`=25452; -- 天灾猛犸
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `unit_flags`=537133824, `unit_flags2`=2049, `unit_flags3`=8192 WHERE `entry`=26160; -- 牦牛村科多兽
UPDATE `creature_template` SET `minlevel`=66, `maxlevel`=71, `unit_flags`=537166592, `unit_flags2`=2049, `unit_flags3`=8192 WHERE `entry`=26159; -- 牦牛村撤离者
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `RangeAttackTime`=2000 WHERE `entry`=25668; -- 复仇的牦牛人之魂
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `unit_flags`=0, `unit_flags2`=2099200 WHERE `entry`=26174; -- 食腐秃鹰
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `unit_flags3`=1 WHERE `entry`=26162; -- Transborea Generator 001
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80, `speed_walk`=1 WHERE `entry`=25715; -- 冰冷元素
UPDATE `creature_template` SET `minlevel`=58, `maxlevel`=80 WHERE `entry`=26156; -- 沃图克
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=26413; -- 阿努巴尔恐怖编织者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1, `unit_flags`=32768 WHERE `entry`=26616; -- 天灾麋鹿
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1, `speed_run`=1.142857 WHERE `entry`=26402; -- 阿努巴尔伏击者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1, `speed_run`=1.142857, `unit_flags`=32768 WHERE `entry`=26281; -- 眠月魔犬
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `npcflag`=0, `unit_flags`=537133056, `unit_flags2`=2049, `unit_flags3`=8192 WHERE `entry`=26477; -- 死亡的法师猎手
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1 WHERE `entry`=26455; -- 眠月神殿上层精灵
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=26837; -- 萨蕾德亚娜
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27056; -- 哨兵琪珊·清泉
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27054; -- 莫度鲁
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857, `RangeAttackTime`=2000 WHERE `entry`=27119; -- 雪足
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27052; -- 诺哈因
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `RangeAttackTime`=2000 WHERE `entry`=27060; -- 信使兰森
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `npcflag`=8194 WHERE `entry`=26881; -- 帕蕾娜·银云
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=26973; -- 典狱官朱蒂·月歌

UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `npcflag`=4224 WHERE `entry`=27055; -- 哨兵蓝塔娜·琥珀
UPDATE `creature_template` SET `speed_run`=1.142857 WHERE `entry`=30358; -- 长者墨尔希
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=26456; -- 寒冬姐妹
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags2`=2099200 WHERE `entry`=26276; -- 魔枢守护者
UPDATE `creature_template` SET `faction`=31, `npcflag`=1073741824, `speed_run`=1.285714, `unit_flags`=512, `unit_flags2`=2048 WHERE `entry`=62693; -- 极地野兔
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=26448; -- 群星之墓哨兵
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags`=32768 WHERE `entry`=26482; -- 极地灰熊
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags`=32768 WHERE `entry`=27749; -- 部落援兵
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27763; -- 瓦加斯塔兹
UPDATE `creature_template` SET `unit_flags`=0 WHERE `entry`=29328; -- 极地野兔
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1 WHERE `entry`=26615; -- 雪落麋鹿
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1, `unit_flags2`=2099200 WHERE `entry`=26841; -- 复活的冰霜巨龙
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags2`=2099200, `HoverHeight`=3 WHERE `entry`=26838; -- 恐怖之爪
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1 WHERE `entry`=27725; -- 红玉守护者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=27533; -- 冰冷恶鬼
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857, `unit_flags2`=2099200 WHERE `entry`=26926; -- 瓦伦哈尔公爵
UPDATE `creature_template` SET `unit_flags3`=1 WHERE `entry`=27369; -- Necromantic Rune Bunny
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27680; -- 达莉亚
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27539; -- 冰冷通灵师
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=33704; -- 冰冷憎恶
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags2`=2099200, `unit_flags3`=1 WHERE `entry`=26286; -- 灰烬之龙
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27542; -- 红玉警戒者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27531; -- 进攻的冰冷憎恶
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=27686; -- 进攻的冰冷恶鬼
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27564; -- 联盟援兵
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `faction`=2041, `npcflag`=0, `unit_flags2`=2099200, `unit_flags3`=1 WHERE `entry`=27530; -- 红玉看守者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27006; -- 裂骨者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1, `speed_run`=1.142857 WHERE `entry`=26197; -- 飘雪林地掠夺者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1, `speed_run`=1.142857 WHERE `entry`=26198; -- 飘雪林地狼獾人
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags2`=2099200 WHERE `entry`=26836; -- 吉加托尔
UPDATE `creature_template` SET `unit_flags2`=2099200 WHERE `entry`=24879; -- 北极云雾
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=26816; -- 魔法焦点巫师
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags`=32768 WHERE `entry`=32572; -- 龙骨荒野法师猎手
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=27279; -- 雪原萨满祭司
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=27278; -- 雪原狂战士
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=26280; -- 龙骨荒野法师猎手
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=26480; -- 猛犸人幼体
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=26295; -- 猛犸人族长
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags`=32768 WHERE `entry`=27294; -- 苔原食腐豺狼

UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_run`=1.142857 WHERE `entry`=26705; -- 雪原徒工
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=26481; -- 猛犸人突击者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1, `speed_run`=1.142857, `unit_flags`=32768 WHERE `entry`=26271; -- 衰弱的雄性猛犸象
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1, `speed_run`=1.142857 WHERE `entry`=26272; -- 瘦弱的猛犸象
UPDATE `creature_template` SET `faction`=188, `npcflag`=1073741824, `speed_run`=0.8571429, `unit_flags`=512, `unit_flags2`=2048 WHERE `entry`=62852; -- 龙骨幼鸟
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `speed_walk`=1, `speed_run`=1.142857 WHERE `entry`=26273; -- 衰弱的猛犸象幼崽
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2213, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33280, `unit_flags2`=2048 WHERE `entry`=124100; -- 药剂师蒂林丝
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2213, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33280, `unit_flags2`=2048 WHERE `entry`=124103; -- 塔乐莎·韧皮
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2213, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33280, `unit_flags2`=2048 WHERE `entry`=124104; -- 妖术师贾昆达
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2213, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33280, `unit_flags2`=2048 WHERE `entry`=124101; -- 萝比·电压
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2213, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33280, `unit_flags2`=2048 WHERE `entry`=124102; -- 格罗索格
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2213, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33280, `unit_flags2`=2048 WHERE `entry`=124074; -- 亡灵卫兵战地队长
UPDATE `creature_template` SET `gossip_menu_id`=21273, `minlevel`=110, `maxlevel`=110, `faction`=635, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=124379; -- 阿德林·韧皮
UPDATE `creature_template` SET `minlevel`=70, `maxlevel`=70, `faction`=35, `npcflag`=16777216, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=512, `unit_flags2`=67143680, `unit_flags3`=1 WHERE `entry`=123662; -- 龙眠神殿
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2202, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33280, `unit_flags2`=2048 WHERE `entry`=124072; -- 联盟战地指挥官
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2202, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33280, `unit_flags2`=2048 WHERE `entry`=124096; -- 布里格斯
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2010, `npcflag`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33280 WHERE `entry`=124154; -- 克罗米
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=83, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=4194304, `unit_flags3`=1 WHERE `entry`=124052; -- 部落攻城火炮
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=84, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=4194304, `unit_flags3`=1 WHERE `entry`=124053; -- 联盟攻城火炮
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2213, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33536, `unit_flags2`=2048 WHERE `entry`=124073; -- 亡灵卫兵
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2202, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=124071; -- 联盟防御者
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=90, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=122875; -- 萨拉斯·维索恩
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2849, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags2`=2048 WHERE `entry`=123458; -- 梦境折磨者
UPDATE `creature_template` SET `gossip_menu_id`=21210, `minlevel`=112, `maxlevel`=112, `faction`=2010, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=295168, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=122545; -- 奥德拉长老
UPDATE `creature_template` SET `gossip_menu_id`=21212, `minlevel`=112, `maxlevel`=112, `faction`=2010, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=295168, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=122547; -- 巴克隆
UPDATE `creature_template` SET `gossip_menu_id`=21211, `minlevel`=112, `maxlevel`=112, `faction`=2010, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=295168, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=122546; -- 布鲁彼得
UPDATE `creature_template` SET `gossip_menu_id`=21219, `minlevel`=112, `maxlevel`=112, `faction`=2010, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33024, `unit_flags2`=2048 WHERE `entry`=122544; -- 护园者尼瑟拉
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=2, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=122548; -- 翡翠天爪枭
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=50, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags2`=2048 WHERE `entry`=122549; -- 翡翠鞭笞者
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=1.6, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=122522; -- 破冰者
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=122552; -- 魔网元素
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=122551; -- 魔网浮龙
UPDATE `creature_template` SET `gossip_menu_id`=21221, `minlevel`=112, `maxlevel`=112, `faction`=2010, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33024, `unit_flags2`=2048 WHERE `entry`=122550; -- 克雷苟斯
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=1.6, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=122524; -- 食血者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27804; -- 古拉克·石拳
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags`=32768, `unit_flags2`=2099200, `HoverHeight`=2 WHERE `entry`=26483; -- 龙骨秃鹫
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2010, `npcflag`=3, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=768, `unit_flags2`=2048 WHERE `entry`=122513; -- 伊萨里奥斯勋爵
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2010, `npcflag`=3, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=122514; -- 卡雷苟斯
UPDATE `creature_template` SET `gossip_menu_id`=21165, `minlevel`=112, `maxlevel`=112, `faction`=2010, `npcflag`=3, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33536, `unit_flags2`=2048 WHERE `entry`=122510; -- 克罗米
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2010, `npcflag`=3, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=768, `unit_flags2`=2048 WHERE `entry`=122511; -- 阿莱克丝塔萨，生命的缚誓者
UPDATE `creature_template` SET `minlevel`=70, `maxlevel`=70, `faction`=35, `npcflag`=16777216, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=512, `unit_flags2`=67143680, `unit_flags3`=1 WHERE `entry`=125249; -- 返回现在
UPDATE `creature_template` SET `unit_flags3`=1 WHERE `entry`=30078; -- [DND]Wyrmrest Temple Beam Target
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags`=537165824, `unit_flags2`=2049, `unit_flags3`=8192 WHERE `entry`=30058; -- 大厅守卫者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=26983; -- 奥拉斯塔萨
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `npcflag`=8192 WHERE `entry`=26851; -- 奈瑟斯塔兹
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27950; -- 德米斯塔兹
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27948; -- 莉塞拉
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags`=0 WHERE `entry`=27943; -- 达尔洛米
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `npcflag`=640, `unit_flags`=0 WHERE `entry`=27940; -- 莱瑟库斯
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `npcflag`=129, `unit_flags`=0 WHERE `entry`=27938; -- 特利索尔姆
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27803; -- 劳莉耶尔·图布雷
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `unit_flags`=32768 WHERE `entry`=27953; -- 龙眠神殿保卫者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags`=0 WHERE `entry`=27935; -- 费里索斯

UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags2`=2099200, `HoverHeight`=12.5 WHERE `entry`=27608; -- 碧蓝巨龙
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `npcflag`=0, `unit_flags`=768, `unit_flags2`=2099200 WHERE `entry`=27629; -- 龙眠神殿防御者
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags2`=2099200 WHERE `entry`=27682; -- 碧蓝幼龙

UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80 WHERE `entry`=27765; -- 纳莉丝

UPDATE `creature_template` SET `gossip_menu_id`=21161 WHERE `entry`=27856; -- 克罗米
UPDATE `creature_template` SET `speed_walk`=1, `speed_run`=1.142857, `unit_flags2`=2099200 WHERE `entry`=26917; -- 阿莱克丝塔萨，生命的缚誓者

UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags2`=2099200 WHERE `entry`=26925; -- 龙眠神殿幼龙
UPDATE `creature_template` SET `minlevel`=61, `maxlevel`=80, `unit_flags2`=2099200 WHERE `entry`=26933; -- 龙眠神殿守护者
UPDATE `creature_template` SET `minlevel`=100, `maxlevel`=100, `faction`=1768, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=526336 WHERE `entry`=113865; -- 梦魇之门
UPDATE `creature_template` SET `minlevel`=80, `maxlevel`=90 WHERE `entry`=40278; -- 索罗·白蹄
UPDATE `creature_template` SET `maxlevel`=90 WHERE `entry`=39925; -- 安伦·觅影者
UPDATE `creature_template` SET `minlevel`=80, `maxlevel`=90 WHERE `entry`=40843; -- 塞贝莉亚
UPDATE `creature_template` SET `maxlevel`=90, `npcflag`=4194433 WHERE `entry`=43408; -- 艾丽·绿柳
UPDATE `creature_template` SET `maxlevel`=90 WHERE `entry`=40833; -- 蒂亚拉·白鬃
UPDATE `creature_template` SET `minlevel`=80, `maxlevel`=90, `unit_flags3`=1 WHERE `entry`=40254; -- 受伤的德鲁伊
UPDATE `creature_template` SET `maxlevel`=90 WHERE `entry`=43410; -- 托隆·石蹄
UPDATE `creature_template` SET `minlevel`=80, `maxlevel`=90 WHERE `entry`=50314; -- 供给官白云
UPDATE `creature_template` SET `maxlevel`=90, `faction`=2252, `npcflag`=4198528, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=71304; -- 爱莉丝·月梦
UPDATE `creature_template` SET `maxlevel`=90 WHERE `entry`=43411; -- 利尼迪尔·月翼
UPDATE `creature_template` SET `minlevel`=105, `maxlevel`=105, `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=129211; -- 泰兰德·语风
UPDATE `creature_template` SET `minlevel`=101, `maxlevel`=101, `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=129210; -- 玛法里奥·怒风
UPDATE `creature_template` SET `minlevel`=108, `maxlevel`=108, `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=129209; -- 伊利丹·怒风

UPDATE `creature_template` SET `gossip_menu_id`=18273 WHERE `entry`=91462; -- 玛法里奥·怒风
UPDATE `creature_template` SET `minlevel`=110 WHERE `entry`=93508; -- 洛拉希尔德鲁伊
UPDATE `creature_template` SET `minlevel`=98, `maxlevel`=110, `faction`=2892, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=118003; -- 洛拉希尔哨兵
UPDATE `creature_template` SET `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=95719; -- 鹿角德鲁伊
UPDATE `creature_template` SET `unit_flags`=32768 WHERE `entry`=93157; -- 被亵渎的巡林者
UPDATE `creature_template` SET `unit_flags`=32768 WHERE `entry`=110896; -- 上古歼灭者
UPDATE `creature_template` SET `unit_flags`=32768, `unit_flags2`=33556480, `unit_flags3`=0 WHERE `entry`=93946; -- 神殿弓箭手
UPDATE `creature_template` SET `gossip_menu_id`=21755, `npcflag`=3, `speed_run`=1.142857 WHERE `entry`=104921; -- 泰兰德·语风
UPDATE `creature_template` SET `unit_flags`=67141632 WHERE `entry`=92794; -- 恐魔蝙蝠
UPDATE `creature_template` SET `speed_run`=1.142857 WHERE `entry`=114676; -- 复活的先锋
UPDATE `creature_template` SET `speed_run`=1.142857 WHERE `entry`=95224; -- 迪娜
UPDATE `creature_template` SET `unit_flags`=294912 WHERE `entry`=100409; -- 暮色啸狼
UPDATE `creature_template` SET `speed_run`=1.142857 WHERE `entry`=91839; -- 卡多雷风鹫
UPDATE `creature_template` SET `unit_flags`=32768 WHERE `entry`=93314; -- 闪蹄母鹿
UPDATE `creature_template` SET `speed_run`=1.142857, `BaseAttackTime`=1500, `unit_flags`=768 WHERE `entry`=51649; -- 枭兽宝宝
UPDATE `creature_template` SET `minlevel`=1, `maxlevel`=1, `faction`=35, `speed_run`=0.8571429, `unit_flags`=512, `unit_flags2`=2048 WHERE `entry`=70082; -- 皮埃尔
UPDATE `creature_template` SET `faction`=35, `unit_flags`=768 WHERE `entry`=53623; -- 塞纳里奥角鹰兽宝宝
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2916, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33536, `unit_flags2`=2048 WHERE `entry`=126070; -- 光铸技师
UPDATE `creature_template` SET `gossip_menu_id`=21823, `minlevel`=110, `maxlevel`=110, `faction`=35, `npcflag`=3, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33536, `unit_flags3`=1 WHERE `entry`=128949; -- 先知维伦
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2916, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33536, `unit_flags2`=2048 WHERE `entry`=129896; -- 光铸百夫长
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33536, `unit_flags2`=2048 WHERE `entry`=129829; -- 高阶女祭司伊莎娜
UPDATE `creature_template` SET `minlevel`=100, `maxlevel`=100, `faction`=190, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=67143680 WHERE `entry`=129793; -- 侦察地图
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2916, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33536, `unit_flags2`=2048 WHERE `entry`=129897; -- 光铸牧师
UPDATE `creature_template` SET `gossip_menu_id`=21821, `minlevel`=110, `maxlevel`=110, `faction`=35, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33536, `unit_flags2`=18432 WHERE `entry`=129871; -- 救赎者阿拉托尔
UPDATE `creature_template` SET `gossip_menu_id`=21825, `minlevel`=110, `maxlevel`=110, `faction`=35, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33536, `unit_flags2`=18432 WHERE `entry`=129872; -- 温蕾萨·风行者
UPDATE `creature_template` SET `unit_flags`=32768, `unit_flags2`=33556480, `unit_flags3`=0 WHERE `entry`=121397; -- 光铸战争祭司
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `npcflag`=2, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33536, `unit_flags2`=67110912 WHERE `entry`=129429; -- 艾洛达尔水晶
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=768, `unit_flags2`=67110912 WHERE `entry`=129722; -- 泰坦能量微粒
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2129920, `unit_flags3`=1, `HoverHeight`=1.5 WHERE `entry`=127809; -- 起源重组模块
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=129635; -- 饥饿灵魂
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=3145728, `unit_flags3`=1 WHERE `entry`=129386; -- 生命缚誓者的恩赐
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=2099200 WHERE `entry`=127192; -- 星圣管理官
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=1770, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=126268; -- 高戈奈斯
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=1770, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=126266; -- 诺甘农
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=1770, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=126267; -- 艾欧娜尔
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=127458; -- 萨奇尔
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=127473; -- 萨拉塔斯
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=128466; -- 艾露尼斯
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=2099200 WHERE `entry`=124828; -- 寂灭者阿古斯
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=1770, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=2048 WHERE `entry`=125885; -- 阿曼苏尔
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=1770, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=2048 WHERE `entry`=125886; -- 卡兹格罗斯
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=1770, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=125893; -- 阿格拉玛
UPDATE `creature_template` SET `gossip_menu_id`=21675, `minlevel`=110, `maxlevel`=110, `faction`=35, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=128169; -- 麦格尼·铜须
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554688, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=122581; -- 烈焰之迹
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=16, `speed_walk`=6, `speed_run`=2.142857, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=1073741824 WHERE `entry`=121975; -- 阿格拉玛
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=127470; -- 萨拉塔斯
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=127455; -- 萨奇尔
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=128464; -- 艾露尼斯
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=14, `speed_walk`=6, `speed_run`=2.142857, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags2`=4196352 WHERE `entry`=123680; -- 黑暗守护者艾迪斯

UPDATE `creature_template` SET `gossip_menu_id`=20725 WHERE `entry`=96818; -- 出纳员哈娜

UPDATE `creature_template` SET `gossip_menu_id`=20578 WHERE `entry`=90418; -- 大法师茉德拉

UPDATE `creature_template` SET `minlevel`=107 WHERE `entry`=121174; -- 堕暗奴隶
UPDATE `creature_template` SET `unit_flags`=33024 WHERE `entry`=125061; -- 克罗库驯兽师
UPDATE `creature_template` SET `npcflag`=8796093030400 WHERE `entry`=118830; -- 光铸道标

UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags3`=1 WHERE `entry`=124166; -- 卡兹格罗斯的痛苦
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags2`=2048 WHERE `entry`=125837; -- 阿曼苏尔的痛苦
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags3`=1 WHERE `entry`=124164; -- 高戈奈斯的痛苦
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=2147483904 WHERE `entry`=123503; -- 诺甘农的痛苦
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_walk`=5.6, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=122643; -- 瓦里玛萨斯之影
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2099200, `unit_flags3`=1 WHERE `entry`=122590; -- 瓦里玛萨斯之影
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `speed_run`=0.5714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=2048 WHERE `entry`=122809; -- 诺甘农之魂
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `speed_run`=0.5714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=2048 WHERE `entry`=122781; -- 卡兹格罗斯之魂
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `speed_run`=0.5714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=2048 WHERE `entry`=122814; -- 高戈奈斯之魂
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `speed_run`=0.5714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=2048 WHERE `entry`=128311; -- 破坏魔女巫会
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=127472; -- 萨拉塔斯
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `speed_run`=0.5714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=2048 WHERE `entry`=126084; -- 阿曼苏尔之魂
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=127457; -- 萨奇尔
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=124913; -- 麦格尼·铜须
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=128095; -- 鞭笞姐妹
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_walk`=2, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=33554432 WHERE `entry`=128060; -- 狂乱的女祭司
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=256, `unit_flags2`=2099200 WHERE `entry`=122467; -- 奥萨拉，黑夜之母
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=256, `unit_flags2`=2099200 WHERE `entry`=122468; -- 诺拉，烈焰之母
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=2097152 WHERE `entry`=122366; -- 瓦里玛萨斯
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=256, `unit_flags2`=2099200 WHERE `entry`=122469; -- 蒂玛，幽影之母
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=127471; -- 萨拉塔斯
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=128465; -- 艾露尼斯
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=127456; -- 萨奇尔
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=35, `npcflag`=8796093022209, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33280, `unit_flags2`=34816 WHERE `entry`=128304; -- 光铸道标
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=1.2, `speed_run`=1.571429, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=37750784 WHERE `entry`=123533; -- 塔尼斯
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_walk`=1.2, `speed_run`=1.571429, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=35651584 WHERE `entry`=123532; -- 黑暗卫士
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=4194304, `VehicleId`=5616 WHERE `entry`=123929; -- 加洛西破坏者
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=4194304, `VehicleId`=5499 WHERE `entry`=123906; -- 加洛西歼灭者
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=4194304, `VehicleId`=5614 WHERE `entry`=123921; -- 加洛西屠戮者
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=125462; -- Apocalypse Blast Stalker
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=256, `unit_flags2`=34816, `unit_flags3`=1 WHERE `entry`=124879; -- 焚化追猎者
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554688, `unit_flags2`=4196352, `unit_flags3`=1 WHERE `entry`=122634; -- 地狱塔楼
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=1073741824, `VehicleId`=5498 WHERE `entry`=122578; -- 金加洛斯
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=1073741824, `VehicleId`=5499 WHERE `entry`=127230; -- 加洛西歼灭者
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=1073741824 WHERE `entry`=127235; -- 加洛西破坏者
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=1073741824 WHERE `entry`=127231; -- 加洛西屠戮者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33882112, `unit_flags2`=69208064, `unit_flags3`=1 WHERE `entry`=124889; -- 火炮轰击
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33882112, `unit_flags2`=69208064, `unit_flags3`=1 WHERE `entry`=124704; -- 轰炸
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=127469; -- 萨拉塔斯
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=127454; -- 萨奇尔
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=128463; -- 艾露尼斯
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=35, `npcflag`=8796093022209, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33280, `unit_flags2`=34816 WHERE `entry`=128303; -- 光铸道标
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=1147144192, `unit_flags3`=1 WHERE `entry`=125692; -- 猎魂者伊墨纳尔
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags2`=6291456 WHERE `entry`=124158; -- 猎魂者伊墨纳尔
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=69208064, `unit_flags3`=1 WHERE `entry`=128154; -- 加洛西灭世者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=69240832, `unit_flags3`=1 WHERE `entry`=124550; -- 烈火
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=35, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=1073776640, `unit_flags3`=1 WHERE `entry`=126678; -- 维迪卡尔火炮
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33554496, `unit_flags2`=1147144192, `unit_flags3`=1 WHERE `entry`=125717; -- 码头卫兵
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=73402368, `unit_flags3`=1 WHERE `entry`=124686; -- 陷阱！
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `npcflag`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33536, `unit_flags2`=2048 WHERE `entry`=129876; -- 大技师罗姆尔
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2860, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=8, `unit_flags3`=1 WHERE `entry`=125691; -- 大法师卡德加
UPDATE `creature_template` SET `gossip_menu_id`=21377, `minlevel`=111, `maxlevel`=111, `faction`=35, `npcflag`=8796093022209, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33280, `unit_flags2`=34816 WHERE `entry`=125720; -- 光铸道标
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `npcflag`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33536, `unit_flags2`=2048 WHERE `entry`=125682; -- 先知维伦
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=35, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags2`=33554432 WHERE `entry`=125683; -- 伊利丹·怒风
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2916, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=33536, `unit_flags2`=2048 WHERE `entry`=125689; -- 奥蕾莉亚·风行者
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=1073776640, `unit_flags3`=1 WHERE `entry`=126426; -- 维迪卡尔
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=2916, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=256, `unit_flags2`=67143680, `unit_flags3`=1 WHERE `entry`=127963; -- 光铸战争机甲
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=2916, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=256, `unit_flags2`=71337984, `unit_flags3`=1 WHERE `entry`=127856; -- 光铸战争机甲
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=14, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags2`=2097152 WHERE `entry`=122213; -- 领主埃尔加
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=14, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags2`=2097152 WHERE `entry`=122212; -- 达西迪奥夫人
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=14, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags2`=2097152 WHERE `entry`=122211; -- 乌坎纳
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=71305216 WHERE `entry`=122438; -- 邪破传送门
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=768, `unit_flags2`=67635200, `unit_flags3`=1 WHERE `entry`=128088; -- 生命宝珠
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=1140852736, `unit_flags3`=1 WHERE `entry`=125364; -- 帕拉克希斯号
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `npcflag`=17609365913600, `speed_run`=0.7142857, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=4194304, `unit_flags3`=33 WHERE `entry`=123452; -- 邪能领主
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `npcflag`=17609365913600, `speed_run`=1.542857, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=4194304, `unit_flags3`=33 WHERE `entry`=123191; -- 恶魔犬
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags2`=4196352, `unit_flags3`=1 WHERE `entry`=123760; -- 注邪毁灭者
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `npcflag`=17609365913600, `speed_run`=0.7714286, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=4194304, `unit_flags3`=33 WHERE `entry`=123451; -- 恶魔卫士
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=768, `unit_flags2`=71305216, `unit_flags3`=1 WHERE `entry`=124298; -- 军团战舰
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=768, `unit_flags2`=71305216, `unit_flags3`=1 WHERE `entry`=124288; -- 军团战舰
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=768, `unit_flags2`=67110912, `unit_flags3`=1 WHERE `entry`=130000; -- 侵入点
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=1140850688 WHERE `entry`=124445; -- 帕拉克希斯号
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=768, `unit_flags2`=67635200, `unit_flags3`=1 WHERE `entry`=124962; -- 跳板
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=768, `unit_flags2`=67110912, `unit_flags3`=1 WHERE `entry`=124963; -- Jump Dest
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=8, `unit_flags`=33555200, `unit_flags2`=67108864 WHERE `entry`=127681; -- 生命的缚誓者构造体
UPDATE `creature_template` SET `minlevel`=120, `maxlevel`=120, `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=71305216 WHERE `entry`=127754; -- 艾欧娜尔原祖荆兽
UPDATE `creature_template` SET `gossip_menu_id`=21203, `minlevel`=113, `maxlevel`=113, `faction`=35, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=1073741824, `unit_flags3`=1 WHERE `entry`=122500; -- 艾欧娜尔的精华
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `speed_walk`=2.8, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=1073741824, `HoverHeight`=10 WHERE `entry`=127763; -- 艾欧娜尔幼龙
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `speed_walk`=2.8, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=768, `unit_flags2`=2097152 WHERE `entry`=126982; -- 艾欧娜尔之女
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `speed_walk`=2.8, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=4194304 WHERE `entry`=126989; -- 艾欧娜尔飞鸟
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200 WHERE `entry`=126980; -- 追猎者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `speed_walk`=2.8, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=4194304, `HoverHeight`=1.5 WHERE `entry`=127717; -- 艾欧娜尔泰坦宝珠
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200 WHERE `entry`=127694; -- Eonar Beam Stalker
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=4194304 WHERE `entry`=126937; -- 追猎者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `speed_walk`=2.8, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=4196352 WHERE `entry`=127213; -- 艾欧娜尔黄蜂
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=69208064 WHERE `entry`=122587; -- 传送门：拉恩科纳
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=69208064, `unit_flags3`=1 WHERE `entry`=122647; -- 拉恩科纳酸液
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2099200, `unit_flags3`=1 WHERE `entry`=122555; -- 传送通路：拉恩科纳
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=69208064 WHERE `entry`=122588; -- 传送门：纳斯雷萨
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=69208064 WHERE `entry`=122586; -- 传送门：克索诺斯
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags2`=2097152 WHERE `entry`=122104; -- 传送门守护者哈萨贝尔
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=69208064, `unit_flags3`=1 WHERE `entry`=122953; -- 纳斯雷萨之影
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2099200, `unit_flags3`=1 WHERE `entry`=122533; -- 传送通路：克索诺斯
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=69208064, `unit_flags3`=1 WHERE `entry`=122628; -- 克索诺斯之焰
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=69208064, `unit_flags3`=1 WHERE `entry`=128293; -- 传送门
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2099200, `unit_flags3`=1 WHERE `entry`=122494; -- 传送通路：克索诺斯
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2099200, `unit_flags3`=1 WHERE `entry`=122558; -- 传送通路：纳斯雷萨
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2099200, `unit_flags3`=1 WHERE `entry`=122559; -- 传送通路：纳斯雷萨
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2099200, `unit_flags3`=1 WHERE `entry`=122543; -- 传送通路：拉恩科纳
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags2`=2099200 WHERE `entry`=125549; -- 饥饿的猎犬
UPDATE `creature_template` SET `minlevel`=113, `maxlevel`=113, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=34816, `unit_flags3`=1 WHERE `entry`=128352; -- 艾欧娜尔的影像
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=125584; -- 麦格尼·铜须
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=125570; -- 裂隙世界助手
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=129050; -- 安托兰恶魔卫士
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=125535; -- 裂隙世界助手
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=125569; -- 裂隙世界助手
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags2`=2099200 WHERE `entry`=125547; -- 魔触掠行蛛
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_walk`=2.8, `speed_run`=1.714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags2`=2099200 WHERE `entry`=125545; -- 炽燃小鬼
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1.571429, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags2`=2099200 WHERE `entry`=126333; -- 导邪祭师
UPDATE `creature_template` SET `npcflag`=8796093030400 WHERE `entry`=123139; -- 导航控制台

UPDATE `creature_template` SET `unit_flags`=32768, `unit_flags2`=33556480, `unit_flags3`=0 WHERE `entry`=121396; -- 光铸神射手
UPDATE `creature_template` SET `npcflag`=2, `unit_flags2`=2097152 WHERE `entry`=120533; -- 先知维伦

UPDATE `creature_template` SET `gossip_menu_id`=21352 WHERE `entry`=125351; -- 凯拉

UPDATE `creature_template` SET `unit_flags`=32768, `unit_flags2`=33556480, `unit_flags3`=0 WHERE `entry`=121395; -- 光铸骑兵
UPDATE `creature_template` SET `gossip_menu_id`=21059 WHERE `entry`=121589; -- 魔术师瓦西里恩
UPDATE `creature_template` SET `gossip_menu_id`=21423 WHERE `entry`=125525; -- 杜拉尔
UPDATE `creature_template` SET `VehicleId`=5393 WHERE `entry`=126057; -- 损坏的战争机甲
UPDATE `creature_template` SET `npcflag`=3 WHERE `entry`=126389; -- 技师席拉娜
UPDATE `creature_template` SET `npcflag`=3 WHERE `entry`=123413; -- 大法师伊米拉
UPDATE `creature_template` SET `npcflag`=66177 WHERE `entry`=123395; -- 高阶女祭司伊莎娜
UPDATE `creature_template` SET `unit_flags`=33024, `unit_flags3`=1 WHERE `entry`=110966; -- 邪恶的魔牙蛛
UPDATE `creature_template` SET `speed_run`=1.142857 WHERE `entry`=105845; -- 荧光小蜘蛛
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=8, `unit_flags`=768, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=111060; -- 奥术师纳兰
UPDATE `creature_template` SET `minlevel`=106 WHERE `entry`=107622; -- 格鲁托妮雅

UPDATE `creature_template` SET `minlevel`=109 WHERE `entry`=110738; -- 凯拉·格瑞姆洛克

UPDATE `creature_template` SET `minlevel`=99 WHERE `entry`=112079; -- 赤色朝圣者

UPDATE `creature_template` SET `gossip_menu_id`=20501 WHERE `entry`=114719; -- 商人塞林

UPDATE `creature_template` SET `gossip_menu_id`=19601 WHERE `entry`=106655; -- 奥法工匠维迪尔
UPDATE `creature_template` SET `minlevel`=103, `maxlevel`=104 WHERE `entry`=105904; -- 乌鸦
UPDATE `creature_template` SET `unit_flags`=32832 WHERE `entry`=119629; -- 赫尔努拉斯
UPDATE `creature_template` SET `gossip_menu_id`=21065 WHERE `entry`=120316; -- 马特·德瓦恩
UPDATE `creature_template` SET `gossip_menu_id`=21063 WHERE `entry`=115373; -- 安克斯
UPDATE `creature_template` SET `gossip_menu_id`=20957 WHERE `entry`=120221; -- 艾里扎尔·锤须
UPDATE `creature_template` SET `HoverHeight`=6 WHERE `entry`=117763; -- 肯瑞托书籍
UPDATE `creature_template` SET `unit_flags`=33587200 WHERE `entry`=17213; -- 扫帚

UPDATE `creature_template` SET `minlevel`=102, `maxlevel`=102 WHERE `entry`=96641; -- 兽栏中的猎人宠物
UPDATE `creature_template` SET `minlevel`=101, `maxlevel`=101 WHERE `entry`=96636; -- 兽栏中的猎人宠物
UPDATE `creature_template` SET `minlevel`=105 WHERE `entry`=96592; -- 兽栏中的猎人宠物
UPDATE `creature_template` SET `minlevel`=105, `maxlevel`=105 WHERE `entry`=96639; -- 兽栏中的猎人宠物
UPDATE `creature_template` SET `minlevel`=108 WHERE `entry`=96635; -- 兽栏中的猎人宠物
UPDATE `creature_template` SET `minlevel`=105, `maxlevel`=105 WHERE `entry`=96643; -- 兽栏中的猎人宠物
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=35, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33555264 WHERE `entry`=119146; -- 阿格拉玛之盾
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=35, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=64, `unit_flags2`=2048 WHERE `entry`=121234; -- 艾格文的影像
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=120241; -- 萨奇尔
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=14, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32832, `unit_flags2`=2097152, `VehicleId`=5309 WHERE `entry`=116944; -- 孟菲斯托斯
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=35, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=64, `unit_flags2`=35651584 WHERE `entry`=121982; -- 伊利丹·怒风
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=14, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags3`=1 WHERE `entry`=118642; -- 恐翼蝠
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=120207; -- 恐惧魔王蝙蝠追猎者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=120405; -- 恐翼蝠
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=954, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=119157; -- 恶魔卫士
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=954, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=118801; -- 小鬼
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=14, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=33587264, `unit_flags2`=2097152, `unit_flags3`=1 WHERE `entry`=118804; -- 多玛塔克斯
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2860, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=8, `unit_flags`=64 WHERE `entry`=118797; -- 大法师卡德加
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=634, `speed_run`=1, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33554432 WHERE `entry`=122085; -- 脉动的卵囊
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=1500, `RangeAttackTime`=2000 WHERE `entry`=120016; -- 死疽小蜘蛛
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33555264 WHERE `entry`=120373; -- 邪脉植物学家
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=118712; -- 邪足执行者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=118713; -- 邪足晶球法师
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=118705; -- 纳尔莎
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=118706; -- 死疽小蜘蛛
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=16, `speed_walk`=2, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33024, `unit_flags2`=4196352, `unit_flags3`=1 WHERE `entry`=117194; -- 轻蔑的萨什比特
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=94, `npcflag`=1, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=832, `unit_flags2`=67143680 WHERE `entry`=118884; -- 阿格拉玛之盾
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=35, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=33554496 WHERE `entry`=121102; -- Aegis RP Finale Stalker
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags3`=1 WHERE `entry`=121713; -- 邪能传送门守卫
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags3`=1 WHERE `entry`=118834; -- 邪能传送门守卫
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=2099200, `HoverHeight`=1.5 WHERE `entry`=118723; -- 加泽拉克斯
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=120257; -- 涌动邪能
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=120371; -- 鬼火小鬼
UPDATE `creature_template` SET `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554944, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=120246; -- 萨奇尔
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_run`=0.5714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33587200, `unit_flags3`=1 WHERE `entry`=122238; -- 神奇图书馆
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_run`=0.5714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33587200, `unit_flags3`=1 WHERE `entry`=119897; -- 神奇图书馆
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_run`=0.5714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33587200, `unit_flags3`=1 WHERE `entry`=122236; -- 神奇图书馆
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_run`=0.5714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33587200, `unit_flags3`=1 WHERE `entry`=122237; -- 神奇图书馆
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33587264, `unit_flags2`=35653632, `unit_flags3`=1 WHERE `entry`=121231; -- 恐翼蝠
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=120366; -- 鬼焰女妖
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_run`=0.5714286, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33587200, `unit_flags3`=1 WHERE `entry`=119190; -- 窒息藤蔓
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=119930; -- 恐翼蝠
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=0.4, `speed_run`=0.1428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=119977; -- 绞藤鞭笞者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=14, `speed_run`=0.7142857, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33587200, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=119169; -- 狂暴的鞭笞者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=35, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=256, `unit_flags2`=526336 WHERE `entry`=121695; -- 初生的花朵
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2048 WHERE `entry`=120374; -- 恶魔卫士毁灭者
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=14, `speed_walk`=2, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=4196352 WHERE `entry`=117193; -- 阿格洛诺克斯
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=0.4285714, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=121318; -- 狂暴的鞭笞者
UPDATE `creature_template` SET `minlevel`=98 WHERE `entry`=121023; -- 抗魔联军士兵
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=118700; -- 邪疫猎犬
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=120556; -- 恐翼蝠
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=118716; -- 喷怨鞭笞者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=119923; -- 鬼火慰魂者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=118714; -- 鬼焰女妖
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=120778; -- 愤怒卫士入侵者
UPDATE `creature_template` SET `minlevel`=111, `maxlevel`=111, `faction`=16, `speed_walk`=2.8, `speed_run`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=118704; -- 杜尔扎克
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=121711; -- 喷怨鞭笞者
UPDATE `creature_template` SET `minlevel`=98, `unit_flags`=570687488, `unit_flags2`=37750785, `unit_flags3`=8192 WHERE `entry`=119768; -- 抗魔联军士兵
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=118703; -- 邪脉植物学家
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=0.4285714, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2099200 WHERE `entry`=119978; -- 狂暴的鞭笞者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=119952; -- 恶魔卫士毁灭者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=120779; -- 鬼火邪能使者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=118724; -- 鬼火邪能使者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=120770; -- 恶魔卫士毁灭者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=120550; -- 愤怒卫士入侵者
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=2099200 WHERE `entry`=118690; -- 愤怒卫士入侵者
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=35, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=64, `unit_flags2`=33554432 WHERE `entry`=119147; -- 玛维·影歌
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=2804, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=64, `unit_flags2`=33554432 WHERE `entry`=120312; -- 玛维·影歌
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=570720320, `unit_flags2`=35653633, `unit_flags3`=8193 WHERE `entry`=118717; -- 鬼火小鬼
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=570720320, `unit_flags2`=35653633, `unit_flags3`=8193 WHERE `entry`=118719; -- 虫语清道夫
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `faction`=35, `speed_run`=1.428571, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=64, `unit_flags2`=33554432 WHERE `entry`=120792; -- 伊利丹·怒风
UPDATE `creature_template` SET `gossip_menu_id`=19717 WHERE `entry`=107457; -- 黛妮丝·凝星

UPDATE `creature_template` SET `gossip_menu_id`=20177 WHERE `entry`=111737; -- 命运守护者塞拉蒂妮

UPDATE `creature_template` SET `npcflag`=0 WHERE `entry`=114296; -- 树苗
UPDATE `creature_template` SET `gossip_menu_id`=19721 WHERE `entry`=103832; -- 守护者雷姆洛斯
UPDATE `creature_template` SET `gossip_menu_id`=19156 WHERE `entry`=101195; -- 伦萨·巨蹄
UPDATE `creature_template` SET `gossip_menu_id`=19950 WHERE `entry`=109612; -- 护林者达兰妮尔

SET @GROUP_ID=0;
SET @ID=0;
INSERT IGNORE INTO `creature_text` (`CreatureID`, `groupid`, `id`, `text`, `type`, `language`, `probability`, `emote`, `duration`, `sound`, `BroadcastTextId`, `comment`) VALUES
(27856, @GROUP_ID+0, @ID+0, '戴上你的头盔。我们要穿越时空啦！', 12, 0, 100, 0, 0, 85371, 131898, '克罗米 to Player'),
(27856, @GROUP_ID+1, @ID+0, '我们又要出发啦！', 12, 0, 100, 0, 0, 85372, 131902, '克罗米 to Player'),
(32638, @GROUP_ID+0, @ID+0, '谢谢你！谢谢你一点忙都不帮！', 12, 0, 100, 6, 0, 0, 33014, '阿古斯的哈克穆德 to Player'),
(32638, @GROUP_ID+1, @ID+0, '哈克穆德没法在这种环境下工作！再见！', 12, 0, 100, 6, 0, 0, 33017, '阿古斯的哈克穆德 to Player'),
(32638, @GROUP_ID+2, @ID+0, '你为什么要这样对待哈克穆德？', 12, 0, 100, 6, 0, 0, 33015, '阿古斯的哈克穆德 to Player'),
(32638, @GROUP_ID+3, @ID+0, '你要把哈克穆德留在这里吗？', 12, 0, 100, 6, 0, 0, 138004, '阿古斯的哈克穆德 to Player'),
(91462, @GROUP_ID+0, @ID+0, '我们的世界之魂很痛苦……', 12, 0, 100, 1, 0, 90799, 139280, '玛法里奥·怒风 to Player'),
(91462, @GROUP_ID+1, @ID+0, '这块水晶……发出了熟悉的声音。', 12, 0, 100, 25, 0, 90779, 139349, '玛法里奥·怒风 to Player'),
(93462, @GROUP_ID+0, @ID+0, '是的。$n在诺森德找到了它。这就是上古之战中达斯雷玛对抗燃烧军团时所用的那把魔法剑。', 12, 0, 100, 1, 0, 0, 110910, '洛拉希尔哨兵 to Player'),
(93508, @GROUP_ID+0, @ID+0, '那是……烈焰之击吗？“那把”烈焰之击？', 12, 0, 100, 6, 0, 0, 110909, '洛拉希尔德鲁伊 to Player'),
(93508, @GROUP_ID+1, @ID+0, '但愿那些法师不会被燃烧军团影响。我们需要他们的帮助。', 12, 0, 100, 1, 0, 0, 110911, '洛拉希尔德鲁伊 to Player'),
(96479, @GROUP_ID+0, @ID+0, '恭祝你春节快乐，并愿你一切顺利，$c。', 12, 0, 100, 3, 0, 0, 49946, '布琳妮 to Player'), -- BroadcastTextID: 49937 - 49942 - 49946
(96990, @GROUP_ID+0, @ID+0, '苹果树注意到了加尼尔，扔给你一只新鲜苹果！', 16, 0, 100, 0, 0, 61694, 101456, '苹果树 to Player'),
(98027, @GROUP_ID+0, @ID+0, '日安，$ct。', 12, 0, 100, 0, 0, 0, 106801, '欢笑的姐妹 to Player'),
(98027, @GROUP_ID+1, @ID+0, '嗨，$ct！', 12, 0, 100, 0, 0, 6515, 106799, '欢笑的姐妹 to Player'), 
(98027, @GROUP_ID+2, @ID+0, '森林中的一切都是那么美妙，$ct。', 12, 0, 100, 0, 0, 0, 106800, '欢笑的姐妹 to Player'),
(98203, @GROUP_ID+0, @ID+0, '后退！它是我的！', 14, 0, 100, 0, 0, 57762, 101906, '伊凡尔 to Player'),
(98203, @GROUP_ID+1, @ID+0, '小偷！法力是我的！', 14, 0, 100, 0, 0, 57765, 101907, '伊凡尔 to Player'), 
(98203, @GROUP_ID+2, @ID+0, '走开！', 14, 0, 100, 0, 0, 57757, 101910, '伊凡尔'), 
(98203, @GROUP_ID+3, @ID+0, '离我的法力远点！', 14, 0, 100, 0, 0, 57758, 101909, '伊凡尔'),
(98203, @GROUP_ID+4, @ID+0, '不……还要……', 14, 0, 100, 0, 0, 57764, 101914, '伊凡尔 to Player'),
(98206, @GROUP_ID+0, @ID+0, '整队，蛆虫们！守住这个缺口，等待古尔丹的命令！', 14, 0, 100, 0, 0, 57770, 105710, '萨卡尔将军 to Player'),
(98206, @GROUP_ID+1, @ID+0, '很好！又有消遣送上门来了！我正闲得发慌呢！', 14, 0, 100, 0, 0, 57772, 105711, '萨卡尔将军 to Player'),
(98206, @GROUP_ID+2, @ID+0, '跟燃烧军团作对的人都得死！', 14, 0, 100, 0, 0, 57773, 105719, '萨卡尔将军'),
(98206, @GROUP_ID+3, @ID+0, '|TInterface\\Icons\\Spell_Nature_Earthquake:20|t萨卡尔将军开始施放|cFFF00000|Hspell:197810|h[邪恶重击]|h|r！', 41, 0, 100, 0, 0, 57774, 103571, '萨卡尔将军'),
(98206, @GROUP_ID+4, @ID+0, '在我阴影下的一切都将崩塌！', 14, 0, 100, 0, 0, 57774, 105718, '萨卡尔将军'),
(98206, @GROUP_ID+5, @ID+0, '不……不！没人能击败……伟大的萨卡尔……', 14, 0, 100, 0, 0, 57771, 105713, '萨卡尔将军 to Player'),
(98207, @GROUP_ID+0, @ID+0, '|TINTERFACE\\ICONS\\inv_misc_web_02.blp:20|t纳尔提拉开始施放|cFFF00000|Hspell:200227|h[缠绕之网]|h|r！', 41, 0, 100, 0, 0, 0, 104947, '纳尔提拉'),
(98208, @GROUP_ID+0, @ID+0, '我活了一万年，我是不会死在一群老鼠手里的。', 14, 0, 100, 0, 0, 57783, 105700, '顾问凡多斯 to Player'),
(98208, @GROUP_ID+1, @ID+0, '我是暗夜井宣泄其伟力的载体！我是夜之子！', 14, 0, 100, 0, 0, 57784, 105708, '顾问凡多斯'),
(98208, @GROUP_ID+2, @ID+0, '|TInterface\\Icons\\Spell_Holy_BorrowedTime:20|t快在你受到|cFFF00000|Hspell:203935|h[时空迷失]|h|r的影响前重新靠近顾问凡多斯！', 41, 0, 100, 0, 0, 0, 105697, '顾问凡多斯'),
(98208, @GROUP_ID+3, @ID+0, '够了！你们这些小畜生真是太难管教了！', 14, 0, 100, 0, 0, 57786, 105706, '顾问凡多斯 to Player'),
(98208, @GROUP_ID+4, @ID+0, '蝼蚁，你见识过这么狂暴的力量吗？恐怕没有吧？', 14, 0, 100, 0, 0, 57785, 105707, '顾问凡多斯'),
(98208, @GROUP_ID+5, @ID+0, '大魔导师……会砍掉你们的脑袋……', 14, 0, 100, 0, 0, 57782, 105701, '顾问凡多斯 to Player'),
(99560, @GROUP_ID+0, @ID+0, '|TINTERFACE\\ICONS\\trade_archaeology_naarucrystal.blp:20|t$n被囚禁在了|cFFF00000|Hspell:195791|h[隔离区]|h|r内！', 41, 0, 100, 0, 0, 0, 101462, '隔离区 to Player'),
(104921, @GROUP_ID+0, @ID+0, '我的一生中，曾两次见证世界崩裂。我祈求月亮母亲不要让我再见到第三次。', 12, 0, 100, 1, 0, 90800, 139273, '泰兰德·语风 to Player'),
(104921, @GROUP_ID+1, @ID+0, '我感觉这块水晶上有巫术存在。', 12, 0, 100, 1, 0, 90801, 139274, '泰兰德·语风 to Player'),
(107622, @GROUP_ID+0, @ID+0, '别忘了按高级账户的按钮！', 12, 0, 100, 25, 0, 0, 112342, '格鲁托妮雅'),
(107622, @GROUP_ID+1, @ID+0, '看看这些……但愿没有丢什么东西……', 12, 0, 100, 11, 0, 0, 112343, '格鲁托妮雅'),
(107622, @GROUP_ID+2, @ID+0, '如果您丢了东西，请联系客服！呵呵呵……', 12, 0, 100, 22, 0, 0, 112344, '格鲁托妮雅'),
(111060, @GROUP_ID+0, @ID+0, '很高兴见到你，朋友。我可以挡住他们，但我担心很快就会涌过来更多。', 12, 0, 100, 0, 0, 0, 119654, '奥术师纳兰 to Player'),
(111060, @GROUP_ID+1, @ID+0, '元素感应到了这里的骚动。保护好你自己！', 14, 0, 100, 0, 0, 0, 119662, '奥术师纳兰 to Player'),
(111060, @GROUP_ID+2, @ID+0, '这只是个开始。枯法者很快就会被如此庞大的能量吸引过来的。', 12, 0, 100, 0, 0, 0, 119664, '奥术师纳兰 to 法力浮龙'),
(111060, @GROUP_ID+3, @ID+0, '来了！', 14, 0, 100, 0, 0, 0, 119666, '奥术师纳兰 to 法力浮龙'), 
(111060, @GROUP_ID+4, @ID+0, '好险啊。我以为他们不会停下呢。', 12, 0, 100, 0, 0, 0, 119668, '奥术师纳兰 to 枯法魔'),
(111060, @GROUP_ID+5, @ID+0, '什么？！夜之子在攻击我们！', 14, 0, 100, 0, 0, 0, 119669, '奥术师纳兰 to 枯法魔'),
(111060, @GROUP_ID+6, @ID+0, '这是我的最后一点力量了。接受它，去消灭这些叛徒吧！', 14, 0, 100, 0, 0, 0, 119670, '奥术师纳兰 to 枯法魔'),
(111060, @GROUP_ID+7, @ID+0, '这应该是最后一批了。我可以用最后一点力量逃出去。再见了，朋友们。', 12, 0, 100, 0, 0, 0, 119671, '奥术师纳兰 to 夜之子魔剑士'),
(116944, @GROUP_ID+0, @ID+0, '终于落单了。', 14, 0, 100, 0, 0, 82036, 129343, '孟菲斯托斯 to 恐翼蝠'),
(116944, @GROUP_ID+1, @ID+0, '交出圣盾，我就给你们一个痛快！', 14, 0, 100, 0, 0, 80500, 127948, '孟菲斯托斯'),
(116944, @GROUP_ID+2, @ID+0, '我们……才是……最后的赢家……', 14, 0, 100, 0, 0, 80501, 127952, '孟菲斯托斯 to Player'),
(117193, @GROUP_ID+0, @ID+0, '这片古老的土地不属于你们！', 14, 0, 100, 0, 0, 81715, 128811, '阿格洛诺克斯 to Player'),
(117193, @GROUP_ID+1, @ID+0, '这将是你们的最后一口气！', 14, 0, 100, 0, 0, 81712, 128806, '阿格洛诺克斯'),
(117193, @GROUP_ID+2, @ID+0, '我的末日……已刻在……轮回中……', 14, 0, 100, 0, 0, 81722, 128818, '阿格洛诺克斯 to Player'),
(117194, @GROUP_ID+0, @ID+0, '失败者才看书！', 14, 0, 100, 0, 0, 81842, 128827, '轻蔑的萨什比特 to Player'),
(117194, @GROUP_ID+1, @ID+0, '过来打啊！', 14, 0, 100, 0, 0, 81840, 128825, '轻蔑的萨什比特'),
(117194, @GROUP_ID+2, @ID+0, '我没认真……想过……', 14, 0, 100, 0, 0, 81847, 128832, '轻蔑的萨什比特 to Player'),
(118705, @GROUP_ID+0, @ID+0, '来吧，孩子们，吃吧！', 14, 0, 100, 0, 0, 0, 128858, '纳尔莎'),
(118705, @GROUP_ID+1, @ID+0, '开饭了！', 14, 0, 100, 0, 0, 0, 25745, '纳尔莎'), -- BroadcastTextID: 20813 - 25745
(118719, @GROUP_ID+0, @ID+0, '他们战胜了萨什比特？！快跑！！！', 14, 0, 100, 0, 0, 0, 130703, '虫语清道夫 to 鬼火小鬼'),
(118723, @GROUP_ID+0, @ID+0, '|TInterface\\Icons\\ABILITY_WARLOCK_SOULSWAP.BLP:20|t转身避开加泽拉克斯的|cFFFF0000|Hspell:239217|h[眩目闪光]|h|r！', 41, 0, 100, 0, 0, 0, 130806, '加泽拉克斯'),
(118804, @GROUP_ID+0, @ID+0, '我代表基尔加丹感谢你们把圣盾送上门来。', 14, 0, 100, 396, 0, 80466, 127970, '多玛塔克斯'),
(118804, @GROUP_ID+1, @ID+0, '军团之力将倾泻到你们头上！', 14, 0, 100, 0, 0, 80472, 127988, '多玛塔克斯'),
(118804, @GROUP_ID+2, @ID+0, '多玛塔克斯撕开了新的邪能传送门！', 41, 0, 100, 0, 0, 0, 128902, '多玛塔克斯'),
(118804, @GROUP_ID+3, @ID+0, '恶魔们！打破护盾！', 14, 0, 100, 0, 0, 80469, 127985, '多玛塔克斯'),
(118804, @GROUP_ID+4, @ID+0, '这世界……必将属于……军团……', 14, 0, 100, 0, 0, 80474, 127990, '多玛塔克斯 to Player'),
(119169, @GROUP_ID+0, @ID+0, '|TInterface\\Icons\\ability_fixated_state_purple:20|t%s|cFFFF0404|Hspell:238674|h[锁定]|h|r了你！', 42, 0, 100, 0, 0, 81722, 130791, '狂暴的鞭笞者 to Player'),
(119892, @GROUP_ID+0, @ID+0, '你好啊，$n。既然梦魇消失了，我们就能听清她想说什么了。下令吧，我们马上开始。', 12, 0, 100, 0, 0, 85236, 128653, '麦格尼·铜须 to Player'),
(119895, @GROUP_ID+0, @ID+0, '重启序列完成。正在初始化警戒协议。', 12, 0, 100, 0, 0, 0, 128659, '防御构装体 to 防御构装体'),
(119895, @GROUP_ID+1, @ID+0, '自我修复模块恢复。外部协助评估：感谢。', 12, 0, 100, 0, 0, 0, 128660, '防御构装体 to 防御构装体'),
(120312, @GROUP_ID+0, @ID+0, '又是伊利丹留下的烂摊子！跟紧点……我们得杀过去。', 14, 0, 100, 0, 0, 0, 127932, '玛维·影歌 to 鬼火小鬼'),
(120312, @GROUP_ID+1, @ID+0, '我去追伊利丹。你来对付这些怪物。', 14, 0, 100, 0, 0, 80488, 127933, '玛维·影歌 to 玛维·影歌'),
(120486, @GROUP_ID+0, @ID+0, '凝视死亡的真正面孔吧，你们的末日就要来了！', 14, 0, 100, 0, 0, 85393, 128857, '痛苦聚合体 to Player'), -- BroadcastTextID: 34360 - 128857
(120486, @GROUP_ID+1, @ID+0, '血肉的痛苦会消散。真正的折磨永无止境。', 14, 0, 100, 0, 0, 85395, 128860, '痛苦聚合体'), -- BroadcastTextID: 128860 - 109139
(120486, @GROUP_ID+2, @ID+0, '你们这些瞎子。睁大眼睛好好看看！', 14, 0, 100, 0, 0, 85394, 128663, '痛苦聚合体'),
(120486, @GROUP_ID+3, @ID+0, '很快，这个世界的心脏将停止跳动。', 14, 0, 100, 0, 0, 85396, 128866, '痛苦聚合体'),
(120486, @GROUP_ID+4, @ID+0, '你的勇气会消失殆尽。', 14, 0, 100, 0, 0, 85397, 128862, '痛苦聚合体 to Player'),
(120488, @GROUP_ID+0, @ID+0, '未发现本地威胁。感谢先前的帮助。', 12, 0, 100, 0, 0, 0, 128688, '防御节点'),
(120488, @GROUP_ID+1, @ID+0, '威胁已消除。正在配置修复矩阵。', 12, 0, 100, 0, 0, 0, 128687, '防御节点'),
(120792, @GROUP_ID+0, @ID+0, '我来封锁空域。看好圣盾！', 14, 0, 100, 0, 0, 82035, 129342, '伊利丹·怒风 to 恐翼蝠'),
(121975, @GROUP_ID+0, @ID+0, '我要烧死你！', 14, 0, 100, 0, 0, 86364, 133394, '阿格拉玛'), -- BroadcastTextID: 133394 - 117291 - 107462
(121975, @GROUP_ID+1, @ID+0, '淹没在火海吧！', 14, 0, 100, 0, 0, 86362, 133422, '阿格拉玛 to Player'),
(121975, @GROUP_ID+2, @ID+0, '生灵俱灭！', 14, 0, 100, 0, 0, 86363, 133424, '阿格拉玛 to Player'),
(121975, @GROUP_ID+3, @ID+0, '|TINTERFACE\\ICONS\\INV_KNIFE_1H_FIRELANDSRAID_D_01.BLP:20|t阿格拉玛开始施放|cFFFF0404|Hspell:244688|h[泰沙拉克剑技]|h|r！', 41, 0, 100, 0, 0, 86361, 132829, '阿格拉玛 to 阿格拉玛'),
(121975, @GROUP_ID+4, @ID+0, '燃烧吧！', 14, 0, 100, 0, 0, 86361, 133419, '阿格拉玛 to 阿格拉玛'), -- BroadcastTextID: 50253 - 52453 - 53513 - 76164 - 80034 - 82429 - 83628 - 85476 - 133419 - 130741 - 127462 - 124859 - 106132 - 96884 - 95736 - 95022
(121975, @GROUP_ID+5, @ID+0, '没人能抵挡泰沙拉克！', 14, 0, 100, 0, 0, 86360, 133418, '阿格拉玛 to 阿格拉玛'),
(121975, @GROUP_ID+6, @ID+0, '泰沙拉克的力量爆发了！', 14, 0, 100, 0, 0, 86358, 133433, '阿格拉玛'),
(121975, @GROUP_ID+7, @ID+0, '你们能抗拒烈焰，但休想抗拒我的怒火。', 14, 0, 100, 0, 0, 86356, 133435, '阿格拉玛 to 阿格拉玛'),
(121975, @GROUP_ID+8, @ID+0, '你们的血肉将熊熊燃烧！', 14, 0, 100, 0, 0, 86353, 133431, '阿格拉玛'), -- BroadcastTextID: 133431 - 127989
(121975, @GROUP_ID+9, @ID+0, '让烈焰吞噬你们！', 14, 0, 100, 0, 0, 86352, 133427, '阿格拉玛'),
(121975, @GROUP_ID+10, @ID+0, '恐怕……来不及阻止他了……', 14, 0, 100, 0, 0, 86365, 133417, '阿格拉玛 to Player'),
(122104, @GROUP_ID+0, @ID+0, '我们经过的世界都陷落了。下一个就是你们。', 14, 0, 100, 0, 0, 86882, 133166, '传送门守护者哈萨贝尔 to Player'),
(122104, @GROUP_ID+1, @ID+0, '军团将毁灭一切反抗者！', 14, 0, 100, 0, 0, 86892, 133160, '传送门守护者哈萨贝尔 to Player'),
(122104, @GROUP_ID+2, @ID+0, '这就是跟我们作对的下场。', 14, 0, 100, 0, 0, 86881, 133165, '传送门守护者哈萨贝尔'),
(122104, @GROUP_ID+3, @ID+0, '不留活口！', 14, 0, 100, 0, 0, 86884, 132432, '传送门守护者哈萨贝尔'), -- BroadcastTextID: 12352 - 25951 - 29508 - 29734 - 31567 - 32417 - 70864 - 81175 - 83377 - 79903 - 83377 - 134886 - 132432
(122104, @GROUP_ID+4, @ID+0, '看，克索诺斯，一个地狱火与枯骨的世界！', 14, 0, 100, 0, 0, 86888, 133171, '传送门守护者哈萨贝尔'),
/*
(122104, @GROUP_ID+5, @ID+0, '|TInterface\\Icons\\SPELL_MAGE_FLAMEORB:20|t通向克索诺斯的烈焰传送门开启了！', 41, 0, 100, 0, 0, 86888, UNKNOWN, '传送门守护者哈萨贝尔'),
*/
(122104, @GROUP_ID+6, @ID+0, '打倒他们！', 14, 0, 100, 0, 0, 86883, 84270, '传送门守护者哈萨贝尔'),
(122104, @GROUP_ID+7, @ID+0, '我们的大军无穷无尽！', 14, 0, 100, 0, 0, 86890, 96226, '传送门守护者哈萨贝尔'),
(122104, @GROUP_ID+8, @ID+0, '军团的势力遍及宇宙，听候我的调遣！', 14, 0, 100, 0, 0, 86889, 133184, '传送门守护者哈萨贝尔'),
(122104, @GROUP_ID+9, @ID+0, '看，拉恩科纳，这片布满溃烂之池、死亡横行的地方！', 14, 0, 100, 0, 0, 86886, 133172, '传送门守护者哈萨贝尔'),
/*
(122104, @GROUP_ID+10, @ID+0, '|TInterface\\Icons\\ABILITY_CREATURE_POISON_02:20|t通向拉恩科纳的邪能传送门开启了！', 41, 0, 100, 0, 0, 86886, UNKNOWN, '传送门守护者哈萨贝尔'),
*/
(122104, @GROUP_ID+11, @ID+0, '撕碎他们！', 14, 0, 100, 0, 0, 86885, 113522, '传送门守护者哈萨贝尔'), -- BroadcastTextID: 53874 - 113522 - 104586
(122104, @GROUP_ID+12, @ID+0, '军团的怒火必将吞噬你们！', 14, 0, 100, 0, 0, 86891, 133186, '传送门守护者哈萨贝尔'),
(122104, @GROUP_ID+13, @ID+0, '纳斯雷萨……它曾是魔法与知识的世界，现在却成了无法逃离的扭曲之地。', 14, 0, 100, 0, 0, 86887, 133173, '传送门守护者哈萨贝尔'),
/*
(122104, @GROUP_ID+14, @ID+0, '|TInterface\\Icons\\SPELL_HOLY_CONSUMEMAGIC:20|t通向纳斯雷萨的暗影传送门开启了！', 41, 0, 100, 0, 0, 86887, UNKNOWN, '传送门守护者哈萨贝尔'),
*/
(122104, @GROUP_ID+15, @ID+0, '传送门……不能……关闭……', 14, 0, 100, 0, 0, 86898, 133174, '传送门守护者哈萨贝尔 to Player'),
(122211, @GROUP_ID+0, @ID+0, '你们的骨灰将被吹进宇宙！', 14, 0, 100, 0, 0, 86968, 133245, '乌坎纳 to Player'),
(122211, @GROUP_ID+1, @ID+0, '我的余烬不会熄灭……', 14, 0, 100, 0, 0, 86969, 133246, '乌坎纳 to Player'),
(122212, @GROUP_ID+0, @ID+0, '靠近点，英雄，我要看着你们的血肉剥落！', 14, 0, 100, 0, 0, 87012, 133243, '达西迪奥夫人 to Player'),
(122212, @GROUP_ID+1, @ID+0, '噢……真想尝尝……你们……融化的血肉……', 14, 0, 100, 0, 0, 87013, 133244, '达西迪奥夫人 to Player'),
(122213, @GROUP_ID+0, @ID+0, '你们的心智太容易被蒙蔽了！', 14, 0, 100, 0, 0, 87022, 133241, '领主埃尔加 to Player'),
(122213, @GROUP_ID+1, @ID+0, '圣光救不了你们……', 14, 0, 100, 0, 0, 87023, 133242, '领主埃尔加 to Player'),
(122366, @GROUP_ID+0, @ID+0, '拔剑吧！来尝尝痛苦的滋味！', 14, 0, 100, 0, 0, 87211, 135099, '瓦里玛萨斯 to Player'),
(122366, @GROUP_ID+1, @ID+0, '后退，杂种！', 14, 0, 100, 0, 0, 87204, 135116, '瓦里玛萨斯'),
(122366, @GROUP_ID+2, @ID+0, '痛苦在黑暗中等着你！', 14, 0, 100, 0, 0, 87199, 135114, '瓦里玛萨斯 to Player'),
(122366, @GROUP_ID+3, @ID+0, '啊，阴影的痛苦！', 14, 0, 100, 0, 0, 87200, 135115, '瓦里玛萨斯 to Player'),
(122366, @GROUP_ID+4, @ID+0, '滚开！', 14, 0, 100, 0, 0, 87205, 135117, '瓦里玛萨斯'), -- BroadcastTextID: 13845 - 34125 - 42355 - 55975 - 57178 - 60662 - 61526 - 63196 - 72007 - 76597 - 77511 - 82801 - 83596 - 89307 - 91010 - 135117 - 120580 - 97151 - 96017
(122366, @GROUP_ID+5, @ID+0, '我们……都有……一死。', 14, 0, 100, 0, 0, 87043, 133876, '瓦里玛萨斯 to Player'),
(122467, @GROUP_ID+0, @ID+0, '你们休想逃出阴影！', 14, 0, 100, 0, 0, 86913, 133879, '奥萨拉，黑夜之母 to 蒂玛，幽影之母'),
(122467, @GROUP_ID+1, @ID+0, '|TInterface\\Icons\\INV_OFFHAND_1H_ULDUARRAID_D_01:20|t女巫会施放了|cFFFF0000|Hspell:250095|h[阿曼苏尔的诡诈]|h|r！', 41, 0, 100, 0, 0, 87027, 137136, '奥萨拉，黑夜之母 to 奥萨拉，黑夜之母'),
(122468, @GROUP_ID+0, @ID+0, '你们的血肉将滋滋作响。', 14, 0, 100, 0, 0, 87025, 133878, '诺拉，烈焰之母 to 蒂玛，幽影之母'),
(122468, @GROUP_ID+1, @ID+0, '我要看着你们被烤熟！', 14, 0, 100, 0, 0, 87024, 134470, '诺拉，烈焰之母'),
(122468, @GROUP_ID+2, @ID+0, '|TInterface\\Icons\\ABILITY_MONK_BREATHOFFIRE:20|t女巫会正准备施放|cFFFF0000|Hspell:245671|h[卡兹格罗斯之焰]|h|r！', 41, 0, 100, 0, 0, 0, 137146, '诺拉，烈焰之母 to 诺拉，烈焰之母'),
(122468, @GROUP_ID+3, @ID+0, '烈焰又吞噬了一具尸体！', 14, 0, 100, 0, 0, 87027, 133889, '诺拉，烈焰之母 to Player'),
(122468, @GROUP_ID+4, @ID+0, '|TInterface\\Icons\\ABILITY_THUNDERKING_LIGHTNINGWHIP:20|t女巫会正准备施放|cFFFF0000|Hspell:246763|h[高戈奈斯之怒]|h|r！', 41, 0, 100, 0, 0, 0, 137145, '诺拉，烈焰之母 to 诺拉，烈焰之母'),
(122469, @GROUP_ID+0, @ID+0, '|TInterface\\Icons\\ABILITY_MAGE_POTENTSPIRIT:20|t女巫会正准备施放|cFFFF0000|Hspell:245910|h[诺甘农的幽灵军团]|h|r！', 41, 0, 100, 0, 0, 0, 137147, '蒂玛，幽影之母 to 蒂玛，幽影之母'),
(122469, @GROUP_ID+1, @ID+0, '享受我冰冷的抚触，化为冰雕吧。', 14, 0, 100, 0, 0, 86927, 134478, '蒂玛，幽影之母'),
(122469, @GROUP_ID+2, @ID+0, '你的尸体我收下了。', 14, 0, 100, 0, 0, 86929, 133888, '蒂玛，幽影之母 to Player'),
(122500, @GROUP_ID+0, @ID+0, '勇士们！军团想为他们那可怕的主人来捕获我的精华！', 14, 0, 100, 0, 0, 88212, 132814, '艾欧娜尔的精华 to 艾欧娜尔的精华'),
/*
(122500, @GROUP_ID+1, @ID+0, '|TInterface\\Icons\\SPELL_NATURE_ABOLISHMAGIC.BLP:20|t艾欧娜尔释放了她的|cFFFF0000|Hspell:250048|h[生命之力]|h|r！', 41, 0, 100, 0, 0, 88222, UNKNOWN, '艾欧娜尔的精华'),
*/
(122500, @GROUP_ID+2, @ID+0, '滚开，入侵者！滚回你主子那去！', 14, 0, 100, 0, 0, 88222, 135939, '艾欧娜尔的精华 to 艾欧娜尔的精华'),
(122500, @GROUP_ID+3, @ID+0, '感受生命之力吧！敬畏它！', 14, 0, 100, 0, 0, 88223, 135945, '艾欧娜尔的精华 to 艾欧娜尔的精华'),
(122500, @GROUP_ID+4, @ID+0, '黑暗的爪牙！见识一下泰坦的力量吧！', 14, 0, 100, 0, 0, 88224, 135946, '艾欧娜尔的精华 to 艾欧娜尔的精华'),
(122545, @GROUP_ID+0, @ID+0, '你必须阻止……巨大的梦魇……', 12, 0, 100, 0, 0, 0, 132538, '奥德拉长老 to 梦境折磨者'),
(122546, @GROUP_ID+0, @ID+0, '去水边……寻找答案……', 12, 0, 100, 0, 0, 0, 132539, '布鲁彼得 to 梦境折磨者'),
(122547, @GROUP_ID+0, @ID+0, '袭击你的人……就在巨龙之掌内……', 12, 0, 100, 0, 0, 0, 132540, '巴克隆 to 梦境折磨者'),
(122578, @GROUP_ID+0, @ID+0, '准备被肢解吧。', 14, 0, 100, 0, 0, 87003, 135246, '金加洛斯'),
(122578, @GROUP_ID+1, @ID+0, '死吧！', 14, 0, 100, 0, 0, 86997, 135011, '金加洛斯 to Player'), -- BroadcastTextID: 1913 - 15042 - 16710 - 20937 - 28793 - 40179 - 50341 - 51125 - 52213 - 58394 - 69531 - 6222 - 43539 - 69531 - 80031 - 80797 - 89719 - 80033 - 80797 - 83278 - 87846 - 91001 - 135011 - 97023 - 94059 - 134403 - 129555 - 117522 - 117343 - 117033 - 101696 - 100918 - 97023 - 94096 - 94059 - 94016
(122578, @GROUP_ID+2, @ID+0, '请允许我介绍我的最新发明。', 14, 0, 100, 0, 0, 86993, 135006, '金加洛斯 to 毁灭者'),
(122578, @GROUP_ID+3, @ID+0, '|TInterface\\Icons\\SPELL_FIRE_FELFIREWARD.BLP:20|t金加洛斯开始引导|cFFFF0000|Hspell:246516|h[天启协议]|h|r！', 41, 0, 100, 0, 0, 87000, 138778, '金加洛斯'),
(122578, @GROUP_ID+4, @ID+0, '受宠若惊吧！你们将参加我的终极武器测试！', 14, 0, 100, 0, 0, 87000, 135013, '金加洛斯'),
(122578, @GROUP_ID+5, @ID+0, '|TInterface\\Icons\\SPELL_FIRE_FELIMMOLATION.BLP:20|t金加洛斯即将激活|cFFFF0000|Hspell:248061|h[净化协议]|h|r！快出去！', 41, 0, 100, 0, 0, 0, 138780, '金加洛斯 to 金加洛斯'),
(122578, @GROUP_ID+6, @ID+0, '看来还需要调整。', 14, 0, 100, 0, 0, 87001, 135014, '金加洛斯 to 金加洛斯'),
(122578, @GROUP_ID+7, @ID+0, '见识真正的力量！', 14, 0, 100, 0, 0, 86996, 135010, '金加洛斯 to Player'),
(122578, @GROUP_ID+8, @ID+0, '你们无路可逃了！', 14, 0, 100, 0, 0, 86995, 135008, '金加洛斯 to 毁灭者'), 
(122578, @GROUP_ID+9, @ID+0, '把下一个试验品送上来！', 14, 0, 100, 0, 0, 86992, 135005, '金加洛斯 to Player'),
(122578, @GROUP_ID+10, @ID+0, '我要将你们化为灰烬！', 14, 0, 100, 0, 0, 86998, 135012, '金加洛斯 to Player'),
(122578, @GROUP_ID+11, @ID+0, '我这就把你送回制图板……但得先碾碎你！', 14, 0, 100, 0, 0, 87009, 133837, '金加洛斯 to Player'),
(122578, @GROUP_ID+12, @ID+0, '让我看看你们能跑多快。', 14, 0, 100, 0, 0, 86994, 135007, '金加洛斯 to 毁灭者'),
(122578, @GROUP_ID+13, @ID+0, '需要先肢解。', 14, 0, 100, 0, 0, 86991, 135004, '金加洛斯 to Player'),
(122578, @GROUP_ID+14, @ID+0, '说明书上不是这么写的……', 14, 0, 100, 0, 0, 87005, 135248, '金加洛斯 to 金加洛斯'),
(122663, @GROUP_ID+0, @ID+0, '魔网扰动？嘁……典型的蓝龙的问题。', 12, 0, 100, 0, 0, 85390, 131924, '克罗米 to Player'),
(122663, @GROUP_ID+1, @ID+0, '谢谢，阁下。我们去看看。如果有发现，我们会通知你的。', 12, 0, 100, 0, 0, 85389, 131923, '克罗米 to Player'),
(122663, @GROUP_ID+2, @ID+0, '亡灵袭击了红玉巨龙圣地？我们去看看。谢谢，艾莉。', 12, 0, 100, 0, 0, 85385, 131919, '克罗米 to Player'),
(122663, @GROUP_ID+3, @ID+0, '站住！', 14, 0, 100, 463, 0, 85602, 135058, '克罗米 to Player'), -- BroadcastTextID: 19171 - 19524 - 70547 - 75026 - 70547 - 76876 - 74361 - 135058 - 114761 - 114760 - 113258 - 108971 - 135058 - 114760 - 113258 - 108971
(122663, @GROUP_ID+4, @ID+0, '噢！你的时间已经用完了！', 12, 0, 100, 0, 0, 85349, 132027, '克罗米 to 梦境折磨者'),
(122663, @GROUP_ID+5, @ID+0, '时间耗尽了。', 42, 0, 100, 0, 0, 0, 133442, '克罗米 to Player'),
(122663, @GROUP_ID+6, @ID+0, '也许下次吧……', 14, 0, 100, 0, 0, 85314, 132032, '克罗米 to Player'),
(122663, @GROUP_ID+7, @ID+0, '记住，那个萨特就在水边的骨爪里。我们去干掉他吧！', 12, 0, 100, 0, 0, 85338, 131944, '克罗米 to Player'),
(122663, @GROUP_ID+8, @ID+0, '耶！我做到了！', 12, 0, 100, 0, 0, 85352, 132030, '克罗米 to 翡翠天爪枭'),
(122663, @GROUP_ID+9, @ID+0, '抱歉，但……这是注定的！', 12, 0, 100, 0, 0, 85350, 132028, '克罗米 to 翡翠天爪枭'),
(122663, @GROUP_ID+10, @ID+0, '奇怪。我不记得自己跟萨特有过冲突，不管是现在还是未来。', 12, 0, 100, 0, 0, 85339, 131945, '克罗米 to 萨拉斯·维索恩'),
(122663, @GROUP_ID+11, @ID+0, '抱歉……', 14, 0, 100, 0, 0, 85317, 96670, '克罗米 to Player'),
(122875, @GROUP_ID+0, @ID+0, '你扭曲时光的好日子到头了，小龙崽子！', 12, 0, 100, 0, 0, 0, 133233, '萨拉斯·维索恩 to Player'),
(124104, @GROUP_ID+0, @ID+0, '干掉那头龙崽子！为了部落！', 12, 0, 100, 0, 0, 0, 133237, '妖术师贾昆达 to Player'),
(124158, @GROUP_ID+0, @ID+0, '结束了，凡人。你们的脑袋值一大笔赏金，我就是为此而来的。', 14, 0, 100, 0, 0, 86522, 134868, '猎魂者伊墨纳尔 to Player'),
(124158, @GROUP_ID+1, @ID+0, '你们的骨头会帮我大赚一笔的。', 14, 0, 100, 0, 0, 86524, 134780, '猎魂者伊墨纳尔 to Player'),
(124158, @GROUP_ID+2, @ID+0, '做个好梦。', 14, 0, 100, 0, 0, 86379, 134402, '猎魂者伊墨纳尔'),
(124158, @GROUP_ID+3, @ID+0, '|TInterface\\Icons\\SPELL_NATURE_SLEEP:20|t%s用|cFFFF0000|Hspell:254244|h[催眠气罐]|h|r瞄准了你！', 42, 0, 100, 0, 0, 0, 137717, '猎魂者伊墨纳尔 to Player'),
(124158, @GROUP_ID+4, @ID+0, '我待会儿再来对付你。', 14, 0, 100, 0, 0, 86381, 134404, '猎魂者伊墨纳尔'),
(124158, @GROUP_ID+5, @ID+0, '有本事的话，就跟上吧！', 14, 0, 100, 0, 0, 86385, 134405, '猎魂者伊墨纳尔'),
(124158, @GROUP_ID+6, @ID+0, '能够证明身份的部分可得保持完整。', 14, 0, 100, 0, 0, 86374, 134409, '猎魂者伊墨纳尔'),
(124158, @GROUP_ID+7, @ID+0, '你们无处可逃了。', 14, 0, 100, 0, 0, 86375, 134440, '猎魂者伊墨纳尔'),
(124158, @GROUP_ID+8, @ID+0, '能活到现在，你们已经赚了。', 14, 0, 100, 0, 0, 86389, 134459, '猎魂者伊墨纳尔'),
(124158, @GROUP_ID+9, @ID+0, '向我的位置开火！', 14, 0, 100, 0, 0, 86377, 134455, '猎魂者伊墨纳尔'),
(124158, @GROUP_ID+10, @ID+0, '轰炸本区域！', 14, 0, 100, 0, 0, 86378, 134456, '猎魂者伊墨纳尔'),
(124158, @GROUP_ID+11, @ID+0, '我真后悔……接了……这个活儿……', 14, 0, 100, 0, 0, 86384, 133864, '猎魂者伊墨纳尔 to Player'),
(124828, @GROUP_ID+0, @ID+0, '主人要你们死！', 14, 0, 100, 0, 0, 88242, 135985, '寂灭者阿古斯'),
(124828, @GROUP_ID+1, @ID+0, '没有希望。只有痛苦。痛苦！', 14, 0, 100, 0, 0, 88244, 135987, '寂灭者阿古斯 to 寂灭者阿古斯'),
(124828, @GROUP_ID+2, @ID+0, '结束这一切吧！', 14, 0, 100, 0, 0, 88239, 135897, '寂灭者阿古斯 to 寂灭者阿古斯'), -- BroadcastTextID: 33871 - 135897
/*
(124828, @GROUP_ID+3, @ID+0, '寂灭者阿古斯正在部署重组模块！', 41, 0, 100, 0, 0, 0, UNKNOWN, '寂灭者阿古斯 to 寂灭者阿古斯'),
*/
(124913, @GROUP_ID+0, @ID+0, '小心！凡人是不能走织梦者的道路的！', 14, 0, 100, 0, 0, 88494, 136088, '麦格尼·铜须 to 蒂玛，幽影之母'),
(124913, @GROUP_ID+1, @ID+0, '那个女巫在用高戈奈斯的风暴攻击你们！', 14, 0, 100, 0, 0, 88490, 136090, '麦格尼·铜须 to 蒂玛，幽影之母'),
(124913, @GROUP_ID+2, @ID+0, '那女巫对众神之父的折磨已经化为了实体！', 14, 0, 100, 0, 0, 88488, 136091, '麦格尼·铜须 to 诺拉，烈焰之母'),
(124913, @GROUP_ID+3, @ID+0, '恶魔在用塑造者的烈焰对付你们！', 14, 0, 100, 0, 0, 86927, 136089, '麦格尼·铜须 to 诺拉，烈焰之母');
/*
(125885, @GROUP_ID+0, @ID+0, '海洋和天空之力能帮助这些勇士，高戈奈斯！', 14, 0, 100, 0, 0, 90889, UNKNOWN, '阿曼苏尔 to 高戈奈斯'),
(125885, @GROUP_ID+1, @ID+0, '让大海的怒涛洗刷这腐蚀吧！', 14, 0, 100, 0, 0, 90890, UNKNOWN, '阿曼苏尔 to 高戈奈斯'),
(125885, @GROUP_ID+2, @ID+0, '阿格拉玛！将你的力量赐予这些凡人吧，兄弟。', 14, 0, 100, 0, 0, 90886, UNKNOWN, '阿曼苏尔 to 阿曼苏尔'),
(125885, @GROUP_ID+3, @ID+0, '我掌握着时间之力，寂灭者！它能束缚你冷酷的怒火！', 14, 0, 100, 0, 0, 90898, UNKNOWN, '阿曼苏尔 to 寂灭者阿古斯'),
(126268, @GROUP_ID+0, @ID+0, '|TInterface\\Icons\\Shaman_PVP_RipplingWaters:20|t%s开始施放|cFFFF0000|Hspell:255594|h[海天之力]|h|r！', 41, 0, 100, 0, 0, 90889, UNKNOWN, '高戈奈斯 to 高戈奈斯');
*/


INSERT IGNORE INTO `npc_spellclick_spells` (`npc_entry`, `spell_id`, `cast_flags`, `user_type`) VALUES
(114296, 227368, 0, 0),
(118884, 190910, 0, 0),
(107448, 213178, 0, 0),
(121014, 241271, 0, 0),
(123230, 245498, 0, 0),
(91975, 182478, 0, 0),
(92072, 182653, 0, 0),
(92017, 182551, 0, 0),
(91983, 182492, 0, 0),
(118992, 224326, 0, 0),
(107772, 234590, 0, 0),
(113901, 234595, 0, 0),
(116408, 231849, 0, 0),
(116419, 231849, 0, 0),
(92438, 103583, 0, 0),
(116420, 231849, 0, 0),
(112947, 234593, 0, 0),
(68232, 75648, 0, 0),
(68239, 75648, 0, 0),
(68238, 75648, 0, 0),
(106359, 210857, 0, 0),
(119437, 237066, 0, 0),
(119396, 237066, 0, 0),
(119438, 237066, 0, 0),
(119436, 237066, 0, 0),
(110390, 219448, 0, 0),
(94109, 186268, 0, 0),
(112991, 224326, 0, 0),
(125249, 248640, 0, 0),
(123662, 243918, 0, 0),
(26477, 61832, 0, 0),
(25743, 46260, 0, 0),
(119895, 241313, 0, 0),
(116323, 231637, 0, 0);


































DELETE FROM `creature_template` WHERE `entry`=117964;
INSERT INTO `creature_template` (`entry`, `KillCredit1`, `KillCredit2`, `modelid1`, `modelid2`, `modelid3`, `modelid4`, `name`, `femaleName`, `subname`, `TitleAlt`, `IconName`, `HealthScalingExpansion`, `RequiredExpansion`, `VignetteID`, `rank`, `family`, `type`, `type_flags`, `type_flags2`, `HealthModifier`, `ManaModifier`, `RacialLeader`, `movementId`, `VerifiedBuild`) VALUES
(117964, 0, 0, 65304, 0, 0, 0, '扎格莫萨', NULL, NULL, NULL, NULL, 6, 0, 0, 1, 0, 3, 2097224, 0, 42, 1, 0, 0, 25996); -- 扎格莫萨

UPDATE `creature_template` SET `name`='艾瑞雅·晨灾', `subname`='虚空之誓教派', `VerifiedBuild`=25996 WHERE `entry`=116362; -- 艾瑞雅·晨灾
UPDATE `creature_template` SET `name`='下水道守卫', `femaleName`='下水道守卫', `VerifiedBuild`=25996 WHERE `entry`=97586; -- 下水道守卫
UPDATE `creature_template` SET `name`='下水道守卫', `femaleName`='下水道守卫', `VerifiedBuild`=25996 WHERE `entry`=103112; -- 下水道守卫
UPDATE `creature_template` SET `name`='劳拉·马利', `subname`='小动物', `VerifiedBuild`=25996 WHERE `entry`=97364; -- 劳拉·马利
UPDATE `creature_template` SET `name`='伊克罗特', `VerifiedBuild`=25996 WHERE `entry`=97756; -- 伊克罗特
UPDATE `creature_template` SET `name`='图妮', `subname`='餐饮与材料商人', `VerifiedBuild`=25996 WHERE `entry`=107764; -- 图妮
UPDATE `creature_template` SET `name`='肮脏的老鼠', `VerifiedBuild`=25996 WHERE `entry`=99895; -- 肮脏的老鼠
UPDATE `creature_template` SET `name`='盲眼老鼠', `VerifiedBuild`=25996 WHERE `entry`=111161; -- 盲眼老鼠
UPDATE `creature_template` SET `name`='斯塔普·扣栓', `subname`='腰带商人', `VerifiedBuild`=25996 WHERE `entry`=107760; -- 斯塔普·扣栓
UPDATE `creature_template` SET `name`='菲果·碎底', `VerifiedBuild`=25996 WHERE `entry`=102193; -- 菲果·碎底
UPDATE `creature_template` SET `name`='柯胡塔', `subname`='传送门与杂货', `VerifiedBuild`=25996 WHERE `entry`=97363; -- 柯胡塔
UPDATE `creature_template` SET `name`='下水道贱民', `IconName`='questinteract', `VerifiedBuild`=25996 WHERE `entry`=116323; -- 下水道贱民
UPDATE `creature_template` SET `name`='达兹克·“普罗德摩尔”', `subname`='魔法物品', `VerifiedBuild`=25996 WHERE `entry`=97362; -- 达兹克·“普罗德摩尔”
UPDATE `creature_template` SET `name`='莱杉', `subname`='下水道守卫队长', `VerifiedBuild`=25996 WHERE `entry`=97359; -- 莱杉
UPDATE `creature_template` SET `name`='威尔森中士', `subname`='战场招募员', `HealthScalingExpansion`=-1, `VerifiedBuild`=25996 WHERE `entry`=114665; -- 威尔森中士
UPDATE `creature_template` SET `name`='灵猫魔宠', `type`=12, `movementId`=121, `VerifiedBuild`=25996 WHERE `entry`=53884; -- 灵猫魔宠
UPDATE `creature_template` SET `name`='瓦尔祖恩', `VerifiedBuild`=25996 WHERE `entry`=105333; -- 瓦尔祖恩
UPDATE `creature_template` SET `modelid1`=24906, `name`='阿卡努斯', `type_flags`=1, `HealthModifier`=1.5, `VerifiedBuild`=25996 WHERE `entry`=51045; -- 阿卡努斯
UPDATE `creature_template` SET `name`='硫磺恶犬', `VerifiedBuild`=25996 WHERE `entry`=52795; -- 硫磺恶犬
UPDATE `creature_template` SET `name`='碎齿熊', `VerifiedBuild`=25996 WHERE `entry`=7444; -- 碎齿熊
UPDATE `creature_template` SET `name`='斯瓦诺斯', `VerifiedBuild`=25996 WHERE `entry`=47544; -- 斯瓦诺斯
UPDATE `creature_template` SET `name`='<个人全息投影仪>', `HealthScalingExpansion`=-1, `type_flags`=1074790416, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=76917; -- <个人全息投影仪>
UPDATE `creature_template` SET `name`='草原土拨鼠' WHERE `entry`=61141; -- 草原土拨鼠
UPDATE `creature_template` SET `name`='麦格尼·铜须', `subname`='代言人', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=4100, `HealthModifier`=10, `ManaModifier`=80, `VerifiedBuild`=25996 WHERE `entry`=119892; -- 麦格尼·铜须
UPDATE `creature_template` SET `name`='生命侍女', `HealthScalingExpansion`=6, `type`=9, `HealthModifier`=1.5, `VerifiedBuild`=25996 WHERE `entry`=120971; -- 生命侍女
UPDATE `creature_template` SET `name`='痛苦聚合体', `HealthScalingExpansion`=6, `rank`=1, `type`=15, `type_flags`=2147483720, `HealthModifier`=10, `VerifiedBuild`=25996 WHERE `entry`=120486; -- 痛苦聚合体
UPDATE `creature_template` SET `name`='防御构装体', `HealthScalingExpansion`=6, `type`=9, `HealthModifier`=1.5, `movementId`=76, `VerifiedBuild`=25996 WHERE `entry`=119895; -- 防御构装体
UPDATE `creature_template` SET `name`='凝结的梦魇', `HealthScalingExpansion`=6, `type`=15, `HealthModifier`=1.5, `VerifiedBuild`=25996 WHERE `entry`=120470; -- 凝结的梦魇
UPDATE `creature_template` SET `name`='梦魇恐魔', `HealthScalingExpansion`=6, `type`=15, `HealthModifier`=3, `VerifiedBuild`=25996 WHERE `entry`=120487; -- 梦魇恐魔
UPDATE `creature_template` SET `name`='令人不安的残影', `HealthScalingExpansion`=6, `type`=15, `HealthModifier`=1.5, `VerifiedBuild`=25996 WHERE `entry`=120472; -- 令人不安的残影
UPDATE `creature_template` SET `name`='损坏的构造体', `IconName`='questinteract', `HealthScalingExpansion`=6, `type`=9, `HealthModifier`=1.5, `movementId`=76, `VerifiedBuild`=25996 WHERE `entry`=121038; -- 损坏的构造体
UPDATE `creature_template` SET `name`='虚空之核', `HealthScalingExpansion`=6, `type`=4, `HealthModifier`=0.2, `movementId`=76, `VerifiedBuild`=25996 WHERE `entry`=122898; -- 虚空之核
UPDATE `creature_template` SET `name`='虚空触须', `HealthScalingExpansion`=6, `type`=15, `VerifiedBuild`=25996 WHERE `entry`=122929; -- 虚空触须
UPDATE `creature_template` SET `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=120111; -- Trigger Bunny
UPDATE `creature_template` SET `name`='蠕行恐魔', `HealthScalingExpansion`=6, `type`=15, `HealthModifier`=3, `VerifiedBuild`=25996 WHERE `entry`=120479; -- 蠕行恐魔
UPDATE `creature_template` SET `name`='不安的绝望', `HealthScalingExpansion`=6, `type`=15, `HealthModifier`=2.5, `VerifiedBuild`=25996 WHERE `entry`=121008; -- 不安的绝望
UPDATE `creature_template` SET `name`='鬼魅幻影', `HealthScalingExpansion`=6, `type`=15, `HealthModifier`=3, `VerifiedBuild`=25996 WHERE `entry`=120484; -- 鬼魅幻影
UPDATE `creature_template` SET `name`='痛苦幻象', `HealthScalingExpansion`=6, `type`=15, `HealthModifier`=2, `VerifiedBuild`=25996 WHERE `entry`=120489; -- 痛苦幻象
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661312, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=121244; -- Azeroth's Warning Nightmare Bunny
UPDATE `creature_template` SET `name`='防御节点', `HealthScalingExpansion`=6, `type`=9, `HealthModifier`=1.5, `VerifiedBuild`=25996 WHERE `entry`=120488; -- 防御节点
UPDATE `creature_template` SET `name`='监控构造体', `HealthScalingExpansion`=6, `type`=9, `HealthModifier`=1.5, `movementId`=76, `VerifiedBuild`=25996 WHERE `entry`=120974; -- 监控构造体
UPDATE `creature_template` SET `name`='索拉查卫士', `VerifiedBuild`=25996 WHERE `entry`=28069; -- 索拉查卫士
UPDATE `creature_template` SET `name`='凋零的身体', `VerifiedBuild`=25996 WHERE `entry`=28641; -- 凋零的身体
UPDATE `creature_template` SET `name`='泰坦哨兵', `VerifiedBuild`=25996 WHERE `entry`=29066; -- 泰坦哨兵
UPDATE `creature_template` SET `name`='霜巢雌龙', `VerifiedBuild`=25996 WHERE `entry`=32492; -- 霜巢雌龙
UPDATE `creature_template` SET `name`='源血元素', `VerifiedBuild`=25996 WHERE `entry`=29124; -- 源血元素
UPDATE `creature_template` SET `name`='天灾巨怪', `VerifiedBuild`=25996 WHERE `entry`=29123; -- 天灾巨怪
UPDATE `creature_template` SET `KillCredit2`=0, `name`='硬皮冲锋者', `VerifiedBuild`=25996 WHERE `entry`=28096; -- 硬皮冲锋者
UPDATE `creature_template` SET `name`='骨镰劫掠者', `VerifiedBuild`=25996 WHERE `entry`=28108; -- 骨镰劫掠者
UPDATE `creature_template` SET `name`='蛇', `VerifiedBuild`=25996 WHERE `entry`=2914; -- 蛇
UPDATE `creature_template` SET `name`='损毁的天灾怪', `VerifiedBuild`=25996 WHERE `entry`=28101; -- 损毁的天灾怪
UPDATE `creature_template` SET `name`='萨满祭司维克伊克', `VerifiedBuild`=25996 WHERE `entry`=28327; -- 萨满祭司维克伊克
UPDATE `creature_template` SET `name`='贪婪的蛮藤谷鳄鱼', `type_flags`=2147483649, `VerifiedBuild`=25996 WHERE `entry`=28325; -- 贪婪的蛮藤谷鳄鱼
UPDATE `creature_template` SET `name`='受伤的雨声神谕者', `VerifiedBuild`=25996 WHERE `entry`=28217; -- 受伤的雨声神谕者
UPDATE `creature_template` SET `name`='飞行员维克', `subname`='飞行训练师', `VerifiedBuild`=25996 WHERE `entry`=28746; -- 飞行员维克
UPDATE `creature_template` SET `name`='玛尔文·摇链', `subname`='飞行管理员', `HealthScalingExpansion`=-1, `VerifiedBuild`=25996 WHERE `entry`=28574; -- 玛尔文·摇链
UPDATE `creature_template` SET `name`='塔玛拉·摇链', `VerifiedBuild`=25996 WHERE `entry`=28568; -- 塔玛拉·摇链
UPDATE `creature_template` SET `name`='飞行器', `VerifiedBuild`=25996 WHERE `entry`=24653; -- 飞行器
UPDATE `creature_template` SET `name`='萨满祭司维克伊克', `VerifiedBuild`=25996 WHERE `entry`=28315; -- 萨满祭司维克伊克
UPDATE `creature_template` SET `name`='长者杉德雷', `VerifiedBuild`=25996 WHERE `entry`=30362; -- 长者杉德雷
UPDATE `creature_template` SET `HealthScalingExpansion`=2, `VerifiedBuild`=25996 WHERE `entry`=28463; -- River's Heart Bunny
UPDATE `creature_template` SET `name`='搁浅的蛇颈龙', `VerifiedBuild`=25996 WHERE `entry`=28010; -- 搁浅的蛇颈龙
UPDATE `creature_template` SET `name`='弗蕾亚的仆从', `VerifiedBuild`=25996 WHERE `entry`=29036; -- 弗蕾亚的仆从
UPDATE `creature_template` SET `name`='黄蟾蜍', `VerifiedBuild`=25996 WHERE `entry`=3835; -- 黄蟾蜍
UPDATE `creature_template` SET `name`='黄蟾蜍', `movementId`=100, `VerifiedBuild`=25996 WHERE `entry`=62815; -- 黄蟾蜍
UPDATE `creature_template` SET `name`='帝王眼镜蛇', `VerifiedBuild`=25996 WHERE `entry`=28011; -- 帝王眼镜蛇
UPDATE `creature_template` SET `name`='蛮藤谷鳄鱼', `VerifiedBuild`=25996 WHERE `entry`=28002; -- 蛮藤谷鳄鱼
UPDATE `creature_template` SET `name`='硬皮抢夺者', `VerifiedBuild`=25996 WHERE `entry`=28098; -- 硬皮抢夺者
UPDATE `creature_template` SET `VerifiedBuild`=25996 WHERE `entry`=28466; -- Fruit Tosser
UPDATE `creature_template` SET `name`='蛇' WHERE `entry`=61142; -- 蛇
UPDATE `creature_template` SET `KillCredit2`=0, `name`='蓝玉虫巢巨蜂', `family`=44, `VerifiedBuild`=25996 WHERE `entry`=28086; -- 蓝玉虫巢巨蜂
UPDATE `creature_template` SET `name`='蓝玉虫巢雄蜂', `VerifiedBuild`=25996 WHERE `entry`=28085; -- 蓝玉虫巢雄蜂
UPDATE `creature_template` SET `name`='食草长颈鹿', `VerifiedBuild`=25996 WHERE `entry`=28129; -- 食草长颈鹿
UPDATE `creature_template` SET `name`='回收机器人55-D型', `VerifiedBuild`=25996 WHERE `entry`=25793; -- 回收机器人55-D型
UPDATE `creature_template` SET `name`='油坑', `VerifiedBuild`=25996 WHERE `entry`=25781; -- 油坑
UPDATE `creature_template` SET `name`='覆满油污的小鸟', `VerifiedBuild`=25996 WHERE `entry`=25817; -- 覆满油污的小鸟
UPDATE `creature_template` SET `name`='覆满油污的鹰', `type`=1, `VerifiedBuild`=25996 WHERE `entry`=25748; -- 覆满油污的鹰
UPDATE `creature_template` SET `name`='沾满油污的狼', `VerifiedBuild`=25996 WHERE `entry`=25791; -- 沾满油污的狼
UPDATE `creature_template` SET `name`='雄性长毛猛犸象', `VerifiedBuild`=25996 WHERE `entry`=25743; -- 雄性长毛猛犸象
UPDATE `creature_template` SET `name`='米丝蒂·飞晨', `subname`='材料和毒药商', `VerifiedBuild`=25996 WHERE `entry`=26598; -- 米丝蒂·飞晨
UPDATE `creature_template` SET `name`='浸满油污的驯鹿', `family`=151, `type_flags`=1, `VerifiedBuild`=25996 WHERE `entry`=25750; -- 浸满油污的驯鹿
UPDATE `creature_template` SET `name`='猛犸幼崽', `VerifiedBuild`=25996 WHERE `entry`=24613; -- 猛犸幼崽
UPDATE `creature_template` SET `name`='阿布尼·扭矩', `VerifiedBuild`=25996 WHERE `entry`=25780; -- 阿布尼·扭矩
UPDATE `creature_template` SET `name`='长毛猛犸象', `VerifiedBuild`=25996 WHERE `entry`=24614; -- 长毛猛犸象
UPDATE `creature_template` SET `name`='首席技师加尔比·旋链', `subname`='工程学供应商', `VerifiedBuild`=25996 WHERE `entry`=26600; -- 首席技师加尔比·旋链
UPDATE `creature_template` SET `name`='威利斯·转轮', `subname`='铁匠', `VerifiedBuild`=25996 WHERE `entry`=26599; -- 威利斯·转轮
UPDATE `creature_template` SET `VerifiedBuild`=25996 WHERE `entry`=26804; -- Fizzcrank Bomber Invisible Bunny
UPDATE `creature_template` SET `name`='卡拉·芒星', `subname`='空中交通管制员', `HealthScalingExpansion`=-1, `VerifiedBuild`=25996 WHERE `entry`=26602; -- 卡拉·芒星
UPDATE `creature_template` SET `name`='菲兹兰克工程人员', `VerifiedBuild`=25996 WHERE `entry`=26645; -- 菲兹兰克工程人员
UPDATE `creature_template` SET `name`='牵引机器人AC-9型', `VerifiedBuild`=25996 WHERE `entry`=25766; -- 牵引机器人AC-9型
UPDATE `creature_template` SET `name`='“母鹅”托比·铁栓', `subname`='兽栏管理员', `VerifiedBuild`=25996 WHERE `entry`=26597; -- “母鹅”托比·铁栓
UPDATE `creature_template` SET `name`='犸格莫斯碾压者', `VerifiedBuild`=25996 WHERE `entry`=25434; -- 犸格莫斯碾压者
UPDATE `creature_template` SET `name`='菲兹兰克看护者鲁伯特·锐眼', `VerifiedBuild`=25996 WHERE `entry`=26634; -- 菲兹兰克看护者鲁伯特·锐眼
UPDATE `creature_template` SET `name`='查莉·诺斯托', `subname`='旅店老板', `VerifiedBuild`=25996 WHERE `entry`=26596; -- 查莉·诺斯托
UPDATE `creature_template` SET `name`='菲兹兰克飞行员', `femaleName`='菲兹兰克飞行员', `VerifiedBuild`=25996 WHERE `entry`=25767; -- 菲兹兰克飞行员
UPDATE `creature_template` SET `name`='金吉·温纳特', `VerifiedBuild`=25996 WHERE `entry`=25747; -- 金吉·温纳特
UPDATE `creature_template` SET `name`='墨尔杜·旋轮', `VerifiedBuild`=25996 WHERE `entry`=25702; -- 墨尔杜·旋轮
UPDATE `creature_template` SET `name`='菲兹兰克·铁阀', `VerifiedBuild`=25996 WHERE `entry`=25590; -- 菲兹兰克·铁阀
UPDATE `creature_template` SET `name`='犸格莫斯火焰图腾', `HealthScalingExpansion`=2, `VerifiedBuild`=25996 WHERE `entry`=25444; -- 犸格莫斯火焰图腾
UPDATE `creature_template` SET `name`='犸格莫斯萨满祭司', `VerifiedBuild`=25996 WHERE `entry`=25428; -- 犸格莫斯萨满祭司
UPDATE `creature_template` SET `name`='菲兹兰克伞兵', `femaleName`='菲兹兰克伞兵', `VerifiedBuild`=25996 WHERE `entry`=26619; -- 菲兹兰克伞兵
UPDATE `creature_template` SET `name`='菲兹兰克飞行员', `femaleName`='菲兹兰克飞行员', `VerifiedBuild`=25996 WHERE `entry`=26601; -- 菲兹兰克飞行员
UPDATE `creature_template` SET `name`='菲兹兰克轰炸机', `VerifiedBuild`=25996 WHERE `entry`=25765; -- 菲兹兰克轰炸机
UPDATE `creature_template` SET `name`='犸格莫斯劫掠者', `VerifiedBuild`=25996 WHERE `entry`=25429; -- 犸格莫斯劫掠者
UPDATE `creature_template` SET `name`='油腻软泥怪', `movementId`=100, `VerifiedBuild`=25996 WHERE `entry`=62697; -- 油腻软泥怪
UPDATE `creature_template` SET `KillCredit2`=0, `name`='清除机器人004-A8型', `VerifiedBuild`=25996 WHERE `entry`=25752; -- 清除机器人004-A8型
UPDATE `creature_template` SET `name`='大型电荷元素' WHERE `entry`=21757; -- 大型电荷元素
UPDATE `creature_template` SET `HealthScalingExpansion`=0, `VerifiedBuild`=25996 WHERE `entry`=25670; -- ELM General Purpose Bunny (scale x3)
UPDATE `creature_template` SET `name`='诅咒教派药剂师', `femaleName`='诅咒教派药剂师', `subname`='诅咒教派', `VerifiedBuild`=25996 WHERE `entry`=24957; -- 诅咒教派药剂师
UPDATE `creature_template` SET `name`='生疮的食尸鬼', `VerifiedBuild`=25996 WHERE `entry`=25660; -- 生疮的食尸鬼
UPDATE `creature_template` SET `name`='白骨战士', `VerifiedBuild`=25996 WHERE `entry`=26126; -- 白骨战士
UPDATE `creature_template` SET `KillCredit2`=0, `name`='防御坦克66D型', `VerifiedBuild`=25996 WHERE `entry`=25758; -- 防御坦克66D型
UPDATE `creature_template` SET `name`='菲兹兰克机械侏儒', `VerifiedBuild`=25996 WHERE `entry`=25814; -- 菲兹兰克机械侏儒
UPDATE `creature_template` SET `KillCredit2`=0, `name`='警戒机器人57-K型', `VerifiedBuild`=25996 WHERE `entry`=25753; -- 警戒机器人57-K型
UPDATE `creature_template` SET `name`='蒸汽云雾', `HealthScalingExpansion`=2, `VerifiedBuild`=25996 WHERE `entry`=32544; -- 蒸汽云雾
UPDATE `creature_template` SET `name`='北风蛙', `VerifiedBuild`=25996 WHERE `entry`=25677; -- 北风蛙
UPDATE `creature_template` SET `name`='蒸汽喷泉口', `VerifiedBuild`=25996 WHERE `entry`=25739; -- 蒸汽喷泉口
UPDATE `creature_template` SET `name`='驯风者奥里尔', `VerifiedBuild`=25996 WHERE `entry`=26725; -- 驯风者奥里尔
UPDATE `creature_template` SET `KillCredit2`=0, `name`='蒸汽狂怒者', `VerifiedBuild`=25996 WHERE `entry`=24601; -- 蒸汽狂怒者
UPDATE `creature_template` SET `name`='北风土拨鼠', `HealthScalingExpansion`=2, `movementId`=100, `VerifiedBuild`=25996 WHERE `entry`=62695; -- 北风土拨鼠
UPDATE `creature_template` SET `VerifiedBuild`=25996 WHERE `entry`=26041; -- Lightning Target
UPDATE `creature_template` SET `name`='北风土拨鼠', `VerifiedBuild`=25996 WHERE `entry`=31685; -- 北风土拨鼠
UPDATE `creature_template` SET `name`='沼泽驯鹿', `family`=151, `type_flags`=1, `VerifiedBuild`=25996 WHERE `entry`=25680; -- 沼泽驯鹿
UPDATE `creature_template` SET `name`='苔原爬虫', `VerifiedBuild`=25996 WHERE `entry`=25454; -- 苔原爬虫
UPDATE `creature_template` SET `name`='掘泥鳄鱼人', `VerifiedBuild`=25996 WHERE `entry`=25701; -- 掘泥鳄鱼人
UPDATE `creature_template` SET `name`='鳄鱼人猎手', `VerifiedBuild`=25996 WHERE `entry`=25700; -- 鳄鱼人猎手
UPDATE `creature_template` SET `name`='污泥鳄鱼人', `VerifiedBuild`=25996 WHERE `entry`=25699; -- 污泥鳄鱼人
UPDATE `creature_template` SET `name`='蒸汽蛙', `VerifiedBuild`=25996 WHERE `entry`=25679; -- 蒸汽蛙
UPDATE `creature_template` SET `name`='恩其拉憎恶', `VerifiedBuild`=25996 WHERE `entry`=25383; -- 恩其拉憎恶
UPDATE `creature_template` SET `VerifiedBuild`=25996 WHERE `entry`=26094; -- Naxxanar Caster
UPDATE `creature_template` SET `name`='天灾猛犸', `VerifiedBuild`=25996 WHERE `entry`=25452; -- 天灾猛犸
UPDATE `creature_template` SET `modelid1`=30562, `name`='牦牛村科多兽', `VerifiedBuild`=25996 WHERE `entry`=26160; -- 牦牛村科多兽
UPDATE `creature_template` SET `name`='牦牛村撤离者', `femaleName`='牦牛村撤离者', `HealthScalingExpansion`=2, `VerifiedBuild`=25996 WHERE `entry`=26159; -- 牦牛村撤离者
UPDATE `creature_template` SET `name`='复仇的牦牛人之魂', `VerifiedBuild`=25996 WHERE `entry`=25668; -- 复仇的牦牛人之魂
UPDATE `creature_template` SET `name`='食腐秃鹰', `VerifiedBuild`=25996 WHERE `entry`=26174; -- 食腐秃鹰
UPDATE `creature_template` SET `VerifiedBuild`=25996 WHERE `entry`=26162; -- Transborea Generator 001
UPDATE `creature_template` SET `name`='冰冷元素', `VerifiedBuild`=25996 WHERE `entry`=25715; -- 冰冷元素
UPDATE `creature_template` SET `name`='沃图克', `VerifiedBuild`=25996 WHERE `entry`=26156; -- 沃图克
UPDATE `creature_template` SET `name`='牦牛村勇士', `VerifiedBuild`=25996 WHERE `entry`=26157; -- 牦牛村勇士
UPDATE `creature_template` SET `name`='阿努巴尔恐怖编织者', `VerifiedBuild`=25996 WHERE `entry`=26413; -- 阿努巴尔恐怖编织者
UPDATE `creature_template` SET `name`='天灾麋鹿', `family`=151, `type_flags`=1, `VerifiedBuild`=25996 WHERE `entry`=26616; -- 天灾麋鹿
UPDATE `creature_template` SET `name`='阿努巴尔伏击者', `VerifiedBuild`=25996 WHERE `entry`=26402; -- 阿努巴尔伏击者
UPDATE `creature_template` SET `name`='眠月魔犬', `VerifiedBuild`=25996 WHERE `entry`=26281; -- 眠月魔犬
UPDATE `creature_template` SET `name`='死亡的法师猎手', `femaleName`='死亡的法师猎手', `VerifiedBuild`=25996 WHERE `entry`=26477; -- 死亡的法师猎手
UPDATE `creature_template` SET `name`='眠月神殿上层精灵', `VerifiedBuild`=25996 WHERE `entry`=26455; -- 眠月神殿上层精灵
UPDATE `creature_template` SET `name`='萨蕾德亚娜', `VerifiedBuild`=25996 WHERE `entry`=26837; -- 萨蕾德亚娜
UPDATE `creature_template` SET `name`='雪足', `subname`='琪珊·清泉的守护者', `VerifiedBuild`=25996 WHERE `entry`=27119; -- 雪足
UPDATE `creature_template` SET `name`='信使兰森', `VerifiedBuild`=25996 WHERE `entry`=27060; -- 信使兰森
UPDATE `creature_template` SET `name`='哨兵琪珊·清泉', `subname`='兽栏管理员', `VerifiedBuild`=25996 WHERE `entry`=27056; -- 哨兵琪珊·清泉
UPDATE `creature_template` SET `name`='莫度鲁', `subname`='施法和附魔材料商', `VerifiedBuild`=25996 WHERE `entry`=27054; -- 莫度鲁
UPDATE `creature_template` SET `name`='诺哈因', `subname`='旅店老板', `VerifiedBuild`=25996 WHERE `entry`=27052; -- 诺哈因
UPDATE `creature_template` SET `name`='大法师茉德拉的影像', `subname`='肯瑞托', `VerifiedBuild`=25996 WHERE `entry`=26673; -- 大法师茉德拉的影像
UPDATE `creature_template` SET `name`='哨兵蓝塔娜·琥珀', `subname`='弓箭商', `VerifiedBuild`=25996 WHERE `entry`=27055; -- 哨兵蓝塔娜·琥珀
UPDATE `creature_template` SET `name`='典狱官朱蒂·月歌', `VerifiedBuild`=25996 WHERE `entry`=26973; -- 典狱官朱蒂·月歌
UPDATE `creature_template` SET `name`='帕蕾娜·银云', `subname`='角鹰兽管理员', `HealthScalingExpansion`=-1, `VerifiedBuild`=25996 WHERE `entry`=26881; -- 帕蕾娜·银云
UPDATE `creature_template` SET `name`='指挥官塞雅·蓝钢', `VerifiedBuild`=25996 WHERE `entry`=26459; -- 指挥官塞雅·蓝钢
UPDATE `creature_template` SET `name`='魔枢守护者', `VerifiedBuild`=25996 WHERE `entry`=26276; -- 魔枢守护者
UPDATE `creature_template` SET `name`='极地野兔', `HealthScalingExpansion`=2, `movementId`=133, `VerifiedBuild`=25996 WHERE `entry`=62693; -- 极地野兔
UPDATE `creature_template` SET `name`='长者墨尔希', `VerifiedBuild`=25996 WHERE `entry`=30358; -- 长者墨尔希
UPDATE `creature_template` SET `name`='寒冬姐妹', `VerifiedBuild`=25996 WHERE `entry`=26456; -- 寒冬姐妹
UPDATE `creature_template` SET `name`='群星之墓哨兵', `VerifiedBuild`=25996 WHERE `entry`=26448; -- 群星之墓哨兵
UPDATE `creature_template` SET `name`='雪靴野兔' WHERE `entry`=26614; -- 雪靴野兔
UPDATE `creature_template` SET `name`='极地灰熊', `VerifiedBuild`=25996 WHERE `entry`=26482; -- 极地灰熊
UPDATE `creature_template` SET `name`='进攻的冰冷食尸鬼', `VerifiedBuild`=25996 WHERE `entry`=27685; -- 进攻的冰冷食尸鬼
UPDATE `creature_template` SET `name`='瓦加斯塔兹', `VerifiedBuild`=25996 WHERE `entry`=27763; -- 瓦加斯塔兹
UPDATE `creature_template` SET `name`='部落援兵', `femaleName`='部落援兵', `VerifiedBuild`=25996 WHERE `entry`=27749; -- 部落援兵
UPDATE `creature_template` SET `name`='极地野兔', `HealthScalingExpansion`=2, `VerifiedBuild`=25996 WHERE `entry`=29328; -- 极地野兔
UPDATE `creature_template` SET `name`='雪落麋鹿', `family`=151, `type_flags`=1, `VerifiedBuild`=25996 WHERE `entry`=26615; -- 雪落麋鹿
UPDATE `creature_template` SET `name`='恐怖之爪', `VerifiedBuild`=25996 WHERE `entry`=26838; -- 恐怖之爪
UPDATE `creature_template` SET `name`='复活的冰霜巨龙', `VerifiedBuild`=25996 WHERE `entry`=26841; -- 复活的冰霜巨龙
UPDATE `creature_template` SET `name`='冰冷食尸鬼', `VerifiedBuild`=25996 WHERE `entry`=27534; -- 冰冷食尸鬼
UPDATE `creature_template` SET `name`='红玉守护者', `VerifiedBuild`=25996 WHERE `entry`=27725; -- 红玉守护者
UPDATE `creature_template` SET `name`='冰冷恶鬼', `VerifiedBuild`=25996 WHERE `entry`=27533; -- 冰冷恶鬼
UPDATE `creature_template` SET `name`='瓦伦哈尔公爵', `subname`='巫妖王的仆从', `VerifiedBuild`=25996 WHERE `entry`=26926; -- 瓦伦哈尔公爵
UPDATE `creature_template` SET `name`='达莉亚', `type_flags`=2147483648, `HealthModifier`=2, `VerifiedBuild`=25996 WHERE `entry`=27680; -- 达莉亚
UPDATE `creature_template` SET `HealthScalingExpansion`=2, `VerifiedBuild`=25996 WHERE `entry`=27369; -- Necromantic Rune Bunny
UPDATE `creature_template` SET `name`='冰冷通灵师', `femaleName`='冰冷通灵师', `subname`='诅咒教派', `VerifiedBuild`=25996 WHERE `entry`=27539; -- 冰冷通灵师
UPDATE `creature_template` SET `name`='冰冷憎恶', `VerifiedBuild`=25996 WHERE `entry`=33704; -- 冰冷憎恶
UPDATE `creature_template` SET `name`='灰烬之龙', `VerifiedBuild`=25996 WHERE `entry`=26286; -- 灰烬之龙
UPDATE `creature_template` SET `HealthScalingExpansion`=2, `VerifiedBuild`=25996 WHERE `entry`=27572; -- Ruby Controller Bunny
UPDATE `creature_template` SET `name`='进攻的冰冷恶鬼', `VerifiedBuild`=25996 WHERE `entry`=27686; -- 进攻的冰冷恶鬼
UPDATE `creature_template` SET `HealthScalingExpansion`=2, `VerifiedBuild`=25996 WHERE `entry`=27589; -- Ruby Strafe Bunny
UPDATE `creature_template` SET `name`='联盟援兵', `femaleName`='联盟援兵', `VerifiedBuild`=25996 WHERE `entry`=27564; -- 联盟援兵
UPDATE `creature_template` SET `name`='进攻的冰冷憎恶', `type_flags`=2147483648, `VerifiedBuild`=25996 WHERE `entry`=27531; -- 进攻的冰冷憎恶
UPDATE `creature_template` SET `name`='红玉警戒者', `VerifiedBuild`=25996 WHERE `entry`=27542; -- 红玉警戒者
UPDATE `creature_template` SET `name`='红玉看守者', `VerifiedBuild`=25996 WHERE `entry`=27530; -- 红玉看守者
UPDATE `creature_template` SET `name`='裂骨者', `HealthModifier`=2, `VerifiedBuild`=25996 WHERE `entry`=27006; -- 裂骨者
UPDATE `creature_template` SET `name`='飘雪林地掠夺者', `VerifiedBuild`=25996 WHERE `entry`=26197; -- 飘雪林地掠夺者
UPDATE `creature_template` SET `name`='飘雪林地狼獾人', `VerifiedBuild`=25996 WHERE `entry`=26198; -- 飘雪林地狼獾人
UPDATE `creature_template` SET `name`='吉加托尔', `VerifiedBuild`=25996 WHERE `entry`=26836; -- 吉加托尔
UPDATE `creature_template` SET `HealthScalingExpansion`=2, `VerifiedBuild`=25996 WHERE `entry`=26889; -- The End of the Line Area Trigger Kill Credit Bunny
UPDATE `creature_template` SET `HealthScalingExpansion`=2, `VerifiedBuild`=25996 WHERE `entry`=27698; -- Defending Wyrmrest Temple Kill Credit Bunny
UPDATE `creature_template` SET `name`='北极云雾', `HealthScalingExpansion`=2, `VerifiedBuild`=25996 WHERE `entry`=24879; -- 北极云雾
UPDATE `creature_template` SET `name`='魔法焦点巫师', `femaleName`='魔法焦点巫师', `VerifiedBuild`=25996 WHERE `entry`=26816; -- 魔法焦点巫师
UPDATE `creature_template` SET `name`='龙骨荒野法师猎手', `femaleName`='龙骨荒野法师猎手', `VerifiedBuild`=25996 WHERE `entry`=32572; -- 龙骨荒野法师猎手
UPDATE `creature_template` SET `name`='雪原萨满祭司', `VerifiedBuild`=25996 WHERE `entry`=27279; -- 雪原萨满祭司
UPDATE `creature_template` SET `name`='雪原狂战士', `VerifiedBuild`=25996 WHERE `entry`=27278; -- 雪原狂战士
UPDATE `creature_template` SET `name`='龙骨荒野法师猎手', `femaleName`='龙骨荒野法师猎手', `VerifiedBuild`=25996 WHERE `entry`=26280; -- 龙骨荒野法师猎手
UPDATE `creature_template` SET `name`='猛犸人幼体', `VerifiedBuild`=25996 WHERE `entry`=26480; -- 猛犸人幼体
UPDATE `creature_template` SET `name`='猛犸人族长', `VerifiedBuild`=25996 WHERE `entry`=26295; -- 猛犸人族长
UPDATE `creature_template` SET `name`='苔原食腐豺狼', `VerifiedBuild`=25996 WHERE `entry`=27294; -- 苔原食腐豺狼
UPDATE `creature_template` SET `name`='塔里奥斯塔兹', `subname`='龙眠神殿执事', `VerifiedBuild`=25996 WHERE `entry`=26443; -- 塔里奥斯塔兹
UPDATE `creature_template` SET `name`='受伤的猛犸象', `VerifiedBuild`=25996 WHERE `entry`=26711; -- 受伤的猛犸象
UPDATE `creature_template` SET `name`='雪原徒工', `VerifiedBuild`=25996 WHERE `entry`=26705; -- 雪原徒工
UPDATE `creature_template` SET `name`='猛犸人突击者', `VerifiedBuild`=25996 WHERE `entry`=26481; -- 猛犸人突击者
UPDATE `creature_template` SET `name`='衰弱的雄性猛犸象', `VerifiedBuild`=25996 WHERE `entry`=26271; -- 衰弱的雄性猛犸象
UPDATE `creature_template` SET `name`='瘦弱的猛犸象', `VerifiedBuild`=25996 WHERE `entry`=26272; -- 瘦弱的猛犸象
UPDATE `creature_template` SET `name`='龙骨幼鸟', `movementId`=100, `VerifiedBuild`=25996 WHERE `entry`=62852; -- 龙骨幼鸟
UPDATE `creature_template` SET `name`='衰弱的猛犸象幼崽', `VerifiedBuild`=25996 WHERE `entry`=26273; -- 衰弱的猛犸象幼崽
UPDATE `creature_template` SET `name`='药剂师蒂林丝', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=70, `VerifiedBuild`=25996 WHERE `entry`=124100; -- 药剂师蒂林丝
UPDATE `creature_template` SET `name`='塔乐莎·韧皮', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=70, `VerifiedBuild`=25996 WHERE `entry`=124103; -- 塔乐莎·韧皮
UPDATE `creature_template` SET `name`='妖术师贾昆达', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=70, `VerifiedBuild`=25996 WHERE `entry`=124104; -- 妖术师贾昆达
UPDATE `creature_template` SET `name`='萝比·电压', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=70, `VerifiedBuild`=25996 WHERE `entry`=124101; -- 萝比·电压
UPDATE `creature_template` SET `name`='格罗索格', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=70, `VerifiedBuild`=25996 WHERE `entry`=124102; -- 格罗索格
UPDATE `creature_template` SET `name`='亡灵卫兵战地队长', `HealthScalingExpansion`=6, `type`=7, `HealthModifier`=30, `VerifiedBuild`=25996 WHERE `entry`=124074; -- 亡灵卫兵战地队长
UPDATE `creature_template` SET `name`='联盟攻城火炮', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `HealthModifier`=300, `VerifiedBuild`=25996 WHERE `entry`=124053; -- 联盟攻城火炮
UPDATE `creature_template` SET `name`='部落攻城火炮', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `HealthModifier`=300, `VerifiedBuild`=25996 WHERE `entry`=124052; -- 部落攻城火炮
UPDATE `creature_template` SET `name`='阿德林·韧皮', `HealthScalingExpansion`=6, `type`=7, `VerifiedBuild`=25996 WHERE `entry`=124379; -- 阿德林·韧皮
UPDATE `creature_template` SET `name`='龙眠神殿', `HealthScalingExpansion`=2, `rank`=1, `type`=10, `type_flags`=1611661392, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=123662; -- 龙眠神殿
UPDATE `creature_template` SET `name`='布里格斯', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=70, `VerifiedBuild`=25996 WHERE `entry`=124096; -- 布里格斯
UPDATE `creature_template` SET `name`='联盟战地指挥官', `HealthScalingExpansion`=6, `type`=7, `HealthModifier`=30, `VerifiedBuild`=25996 WHERE `entry`=124072; -- 联盟战地指挥官
UPDATE `creature_template` SET `name`='克罗米', `HealthScalingExpansion`=6, `rank`=1, `type`=2, `HealthModifier`=10, `ManaModifier`=10, `VerifiedBuild`=25996 WHERE `entry`=124154; -- 克罗米
UPDATE `creature_template` SET `name`='亡灵卫兵', `femaleName`='亡灵卫兵', `HealthScalingExpansion`=6, `type`=7, `HealthModifier`=5, `VerifiedBuild`=25996 WHERE `entry`=124073; -- 亡灵卫兵
UPDATE `creature_template` SET `name`='联盟防御者', `femaleName`='联盟防御者', `HealthScalingExpansion`=6, `type`=7, `HealthModifier`=5, `VerifiedBuild`=25996 WHERE `entry`=124071; -- 联盟防御者
UPDATE `creature_template` SET `name`='末日守卫歼灭者', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `HealthModifier`=12, `movementId`=113, `VerifiedBuild`=25996 WHERE `entry`=123101; -- 末日守卫歼灭者
UPDATE `creature_template` SET `name`='萨拉斯·维索恩', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `HealthModifier`=80, `VerifiedBuild`=25996 WHERE `entry`=122875; -- 萨拉斯·维索恩
UPDATE `creature_template` SET `name`='萨库尔', `VerifiedBuild`=25996 WHERE `entry`=118016; -- 萨库尔
UPDATE `creature_template` SET `name`='纳兹瓦尔', `VerifiedBuild`=25996 WHERE `entry`=117069; -- 纳兹瓦尔
UPDATE `creature_template` SET `name`='多尔玛兹', `VerifiedBuild`=25996 WHERE `entry`=120304; -- 多尔玛兹
UPDATE `creature_template` SET `name`='减速沙尘', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1074791424, `HealthModifier`=15, `VerifiedBuild`=25996 WHERE `entry`=122786; -- 减速沙尘
UPDATE `creature_template` SET `name`='奥德拉长老', `HealthScalingExpansion`=6, `rank`=1, `type`=4, `HealthModifier`=8, `ManaModifier`=8, `VerifiedBuild`=25996 WHERE `entry`=122545; -- 奥德拉长老
UPDATE `creature_template` SET `name`='巴克隆', `HealthScalingExpansion`=6, `rank`=1, `type`=4, `HealthModifier`=8, `ManaModifier`=8, `VerifiedBuild`=25996 WHERE `entry`=122547; -- 巴克隆
UPDATE `creature_template` SET `name`='梦境折磨者', `HealthScalingExpansion`=6, `type`=15, `HealthModifier`=25, `VerifiedBuild`=25996 WHERE `entry`=123458; -- 梦境折磨者
UPDATE `creature_template` SET `name`='布鲁彼得', `HealthScalingExpansion`=6, `rank`=1, `type`=4, `HealthModifier`=8, `ManaModifier`=8, `VerifiedBuild`=25996 WHERE `entry`=122546; -- 布鲁彼得
UPDATE `creature_template` SET `name`='护园者尼瑟拉', `HealthScalingExpansion`=6, `rank`=1, `type`=2, `HealthModifier`=8, `ManaModifier`=8, `VerifiedBuild`=25996 WHERE `entry`=122544; -- 护园者尼瑟拉
UPDATE `creature_template` SET `name`='翡翠鞭笞者', `HealthScalingExpansion`=6, `type`=4, `type_flags`=256, `HealthModifier`=5, `VerifiedBuild`=25996 WHERE `entry`=122549; -- 翡翠鞭笞者
UPDATE `creature_template` SET `name`='翡翠天爪枭', `HealthScalingExpansion`=6, `family`=26, `type`=1, `type_flags`=1, `HealthModifier`=5, `movementId`=151, `VerifiedBuild`=25996 WHERE `entry`=122548; -- 翡翠天爪枭
UPDATE `creature_template` SET `name`='破冰者', `HealthScalingExpansion`=6, `rank`=2, `type`=7, `HealthModifier`=20, `movementId`=150, `VerifiedBuild`=25996 WHERE `entry`=122522; -- 破冰者
UPDATE `creature_template` SET `name`='魔网元素', `HealthScalingExpansion`=6, `type`=15, `HealthModifier`=12, `VerifiedBuild`=25996 WHERE `entry`=122552; -- 魔网元素
UPDATE `creature_template` SET `name`='魔网浮龙', `HealthScalingExpansion`=6, `type`=15, `HealthModifier`=4, `VerifiedBuild`=25996 WHERE `entry`=122551; -- 魔网浮龙
UPDATE `creature_template` SET `name`='克雷苟斯', `HealthScalingExpansion`=6, `rank`=1, `type`=2, `HealthModifier`=8, `ManaModifier`=8, `VerifiedBuild`=25996 WHERE `entry`=122550; -- 克雷苟斯
UPDATE `creature_template` SET `name`='食血者', `HealthScalingExpansion`=6, `rank`=2, `type`=7, `HealthModifier`=20, `movementId`=150, `VerifiedBuild`=25996 WHERE `entry`=122524; -- 食血者
UPDATE `creature_template` SET `name`='古拉克·石拳', `subname`='部落大使', `VerifiedBuild`=25996 WHERE `entry`=27804; -- 古拉克·石拳
UPDATE `creature_template` SET `name`='龙骨秃鹫', `VerifiedBuild`=25996 WHERE `entry`=26483; -- 龙骨秃鹫
UPDATE `creature_template` SET `name`='返回现在', `HealthScalingExpansion`=2, `rank`=1, `type`=10, `type_flags`=1611661392, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=125249; -- 返回现在
UPDATE `creature_template` SET `name`='阿莱克丝塔萨，生命的缚誓者', `subname`='巨龙的女王', `HealthScalingExpansion`=6, `rank`=1, `type`=2, `type_flags`=36, `HealthModifier`=1000, `ManaModifier`=1000, `VerifiedBuild`=25996 WHERE `entry`=122511; -- 阿莱克丝塔萨，生命的缚誓者
UPDATE `creature_template` SET `name`='克罗米', `subname`='青铜龙军团大使', `HealthScalingExpansion`=6, `rank`=1, `type`=2, `HealthModifier`=10, `ManaModifier`=10, `VerifiedBuild`=25996 WHERE `entry`=122510; -- 克罗米
UPDATE `creature_template` SET `name`='伊萨里奥斯勋爵', `subname`='绿龙军团大使', `HealthScalingExpansion`=6, `rank`=1, `type`=2, `HealthModifier`=10, `ManaModifier`=10, `VerifiedBuild`=25996 WHERE `entry`=122513; -- 伊萨里奥斯勋爵
UPDATE `creature_template` SET `name`='卡雷苟斯', `subname`='蓝龙军团大使', `HealthScalingExpansion`=6, `rank`=1, `type`=2, `HealthModifier`=667, `VerifiedBuild`=25996 WHERE `entry`=122514; -- 卡雷苟斯
UPDATE `creature_template` SET `name`='克罗米', `subname`='时光旅行者', `HealthScalingExpansion`=6, `rank`=1, `type`=2, `type_flags`=8654848, `HealthModifier`=23, `ManaModifier`=2, `VerifiedBuild`=25996 WHERE `entry`=122663; -- 克罗米
UPDATE `creature_template` SET `VerifiedBuild`=25996 WHERE `entry`=23155; -- Invisible Stalker (Scale x3)
UPDATE `creature_template` SET `name`='大厅守卫者', `HealthScalingExpansion`=0, `VerifiedBuild`=25996 WHERE `entry`=30058; -- 大厅守卫者
UPDATE `creature_template` SET `HealthScalingExpansion`=0, `VerifiedBuild`=25996 WHERE `entry`=30078; -- [DND]Wyrmrest Temple Beam Target
UPDATE `creature_template` SET `name`='奥拉斯塔萨', `VerifiedBuild`=25996 WHERE `entry`=26983; -- 奥拉斯塔萨
UPDATE `creature_template` SET `name`='劳莉耶尔·图布雷', `subname`='联盟大使', `VerifiedBuild`=25996 WHERE `entry`=27803; -- 劳莉耶尔·图布雷
UPDATE `creature_template` SET `name`='莉塞拉', `subname`='兽栏管理员', `VerifiedBuild`=25996 WHERE `entry`=27948; -- 莉塞拉
UPDATE `creature_template` SET `name`='特利索尔姆', `subname`='商人', `VerifiedBuild`=25996 WHERE `entry`=27938; -- 特利索尔姆
UPDATE `creature_template` SET `name`='达尔洛米', `subname`='魔杖', `VerifiedBuild`=25996 WHERE `entry`=27943; -- 达尔洛米
UPDATE `creature_template` SET `name`='德米斯塔兹', `subname`='旅店老板', `VerifiedBuild`=25996 WHERE `entry`=27950; -- 德米斯塔兹
UPDATE `creature_template` SET `name`='费里索斯', `subname`='材料供应商', `VerifiedBuild`=25996 WHERE `entry`=27935; -- 费里索斯
UPDATE `creature_template` SET `name`='莱瑟库斯', `subname`='杂货商', `VerifiedBuild`=25996 WHERE `entry`=27940; -- 莱瑟库斯
UPDATE `creature_template` SET `name`='奈瑟斯塔兹', `subname`='飞行管理员', `HealthScalingExpansion`=-1, `VerifiedBuild`=25996 WHERE `entry`=26851; -- 奈瑟斯塔兹
UPDATE `creature_template` SET `name`='龙眠神殿保卫者', `femaleName`='龙眠神殿保卫者', `HealthScalingExpansion`=-1, `HealthModifier`=200, `VerifiedBuild`=25996 WHERE `entry`=27953; -- 龙眠神殿保卫者
UPDATE `creature_template` SET `name`='阿弗拉沙斯塔兹', `subname`='龙眠神殿防御部队指挥官', `VerifiedBuild`=25996 WHERE `entry`=27575; -- 阿弗拉沙斯塔兹
UPDATE `creature_template` SET `name`='龙眠神殿防御者', `VerifiedBuild`=25996 WHERE `entry`=27629; -- 龙眠神殿防御者
UPDATE `creature_template` SET `name`='碧蓝巨龙', `VerifiedBuild`=25996 WHERE `entry`=27608; -- 碧蓝巨龙
UPDATE `creature_template` SET `HealthScalingExpansion`=1, `VerifiedBuild`=25996 WHERE `entry`=34381; -- [DND]Northrend Children's Week Trigger
UPDATE `creature_template` SET `name`='克拉苏斯', `subname`='女王的伴侣', `VerifiedBuild`=25996 WHERE `entry`=27990; -- 克拉苏斯
UPDATE `creature_template` SET `name`='阿莱克丝塔萨，生命的缚誓者', `subname`='巨龙的女王', `VerifiedBuild`=25996 WHERE `entry`=26917; -- 阿莱克丝塔萨，生命的缚誓者
UPDATE `creature_template` SET `name`='克罗米', `subname`='青铜龙军团大使', `type_flags2`=16384, `VerifiedBuild`=25996 WHERE `entry`=27856; -- 克罗米
UPDATE `creature_template` SET `name`='伊萨里奥斯勋爵', `subname`='绿龙军团大使', `VerifiedBuild`=25996 WHERE `entry`=27785; -- 伊萨里奥斯勋爵
UPDATE `creature_template` SET `name`='纳莉丝', `subname`='黑龙军团大使', `VerifiedBuild`=25996 WHERE `entry`=27765; -- 纳莉丝
UPDATE `creature_template` SET `name`='碧蓝幼龙', `VerifiedBuild`=25996 WHERE `entry`=27682; -- 碧蓝幼龙
UPDATE `creature_template` SET `name`='卡雷苟斯', `subname`='蓝龙军团大使', `VerifiedBuild`=25996 WHERE `entry`=38017; -- 卡雷苟斯
UPDATE `creature_template` SET `VerifiedBuild`=25996 WHERE `entry`=23837; -- ELM General Purpose Bunny
UPDATE `creature_template` SET `name`='龙眠神殿守护者', `VerifiedBuild`=25996 WHERE `entry`=26933; -- 龙眠神殿守护者
UPDATE `creature_template` SET `name`='托拉斯塔萨', `subname`='巨龙议会的管家', `VerifiedBuild`=25996 WHERE `entry`=26949; -- 托拉斯塔萨
UPDATE `creature_template` SET `name`='希尔丝塔萨', `subname`='龙眠联军军需官', `VerifiedBuild`=25996 WHERE `entry`=32533; -- 希尔丝塔萨
UPDATE `creature_template` SET `name`='龙眠神殿幼龙', `VerifiedBuild`=25996 WHERE `entry`=26925; -- 龙眠神殿幼龙
UPDATE `creature_template` SET `name`='阿努比萨斯人偶', `type`=12, `VerifiedBuild`=25996 WHERE `entry`=68659; -- 阿努比萨斯人偶
UPDATE `creature_template` SET `name`='恶魔卫士', `VerifiedBuild`=25996 WHERE `entry`=109725; -- 恶魔卫士
UPDATE `creature_template` SET `name`='加莫里塔', `VerifiedBuild`=25996 WHERE `entry`=7977; -- 加莫里塔
UPDATE `creature_template` SET `name`='紫罗兰监狱卫兵', `VerifiedBuild`=25996 WHERE `entry`=96444; -- 紫罗兰监狱卫兵
UPDATE `creature_template` SET `name`='癞皮银鬃狼', `VerifiedBuild`=25996 WHERE `entry`=2923; -- 癞皮银鬃狼
UPDATE `creature_template` SET `name`='德古', `HealthScalingExpansion`=4, `VerifiedBuild`=25996 WHERE `entry`=69947; -- 德古
UPDATE `creature_template` SET `name`='影月追猎者', `femaleName`='影月追猎者', `type_flags`=1, `VerifiedBuild`=25996 WHERE `entry`=82308; -- 影月追猎者
UPDATE `creature_template` SET `name`='梦魇之门', `VerifiedBuild`=25996 WHERE `entry`=113865; -- 梦魇之门
UPDATE `creature_template` SET `name`='索罗·白蹄', `VerifiedBuild`=25996 WHERE `entry`=40278; -- 索罗·白蹄
UPDATE `creature_template` SET `name`='安伦·觅影者', `VerifiedBuild`=25996 WHERE `entry`=39925; -- 安伦·觅影者
UPDATE `creature_template` SET `name`='塞贝莉亚', `subname`='旅店老板', `VerifiedBuild`=25996 WHERE `entry`=40843; -- 塞贝莉亚
UPDATE `creature_template` SET `name`='艾丽·绿柳', `subname`='兽栏管理员', `VerifiedBuild`=25996 WHERE `entry`=43408; -- 艾丽·绿柳
UPDATE `creature_template` SET `name`='蒂亚拉·白鬃', `VerifiedBuild`=25996 WHERE `entry`=40833; -- 蒂亚拉·白鬃
UPDATE `creature_template` SET `name`='受伤的德鲁伊', `femaleName`='受伤的德鲁伊', `VerifiedBuild`=25996 WHERE `entry`=40254; -- 受伤的德鲁伊
UPDATE `creature_template` SET `name`='托隆·石蹄', `subname`='锻造供应商', `VerifiedBuild`=25996 WHERE `entry`=43410; -- 托隆·石蹄
UPDATE `creature_template` SET `name`='供给官白云', `subname`='海加尔守护者军需官', `HealthScalingExpansion`=0, `VerifiedBuild`=25996 WHERE `entry`=50314; -- 供给官白云
UPDATE `creature_template` SET `name`='利尼迪尔·月翼', `subname`='杂货商', `VerifiedBuild`=25996 WHERE `entry`=43411; -- 利尼迪尔·月翼
UPDATE `creature_template` SET `name`='爱莉丝·月梦', `subname`='军需官', `VerifiedBuild`=25996 WHERE `entry`=71304; -- 爱莉丝·月梦
UPDATE `creature_template` SET `name`='泰兰德·语风', `HealthScalingExpansion`=6, `type`=7, `VerifiedBuild`=25996 WHERE `entry`=129211; -- 泰兰德·语风
UPDATE `creature_template` SET `name`='玛法里奥·怒风', `HealthScalingExpansion`=6, `type`=7, `VerifiedBuild`=25996 WHERE `entry`=129210; -- 玛法里奥·怒风
UPDATE `creature_template` SET `name`='伊利丹·怒风', `HealthScalingExpansion`=6, `type`=7, `VerifiedBuild`=25996 WHERE `entry`=129209; -- 伊利丹·怒风
UPDATE `creature_template` SET `name`='蓟叶无赖', `VerifiedBuild`=25996 WHERE `entry`=92104; -- 蓟叶无赖
UPDATE `creature_template` SET `name`='黑暗收割祈祷者' WHERE `entry`=108799; -- 黑暗收割祈祷者
UPDATE `creature_template` SET `name`='玛法里奥·怒风' WHERE `entry`=91462; -- 玛法里奥·怒风
UPDATE `creature_template` SET `name`='洛拉希尔哨兵', `femaleName`='洛拉希尔哨兵', `VerifiedBuild`=25996 WHERE `entry`=118003; -- 洛拉希尔哨兵
UPDATE `creature_template` SET `name`='梦魇蛇藤', `VerifiedBuild`=25996 WHERE `entry`=98234; -- 梦魇蛇藤
UPDATE `creature_template` SET `name`='伦萨·巨蹄', `subname`='梦境林地大德鲁伊', `rank`=1, `VerifiedBuild`=25996 WHERE `entry`=97923; -- 伦萨·巨蹄
UPDATE `creature_template` SET `name`='幽影梦魇', `VerifiedBuild`=25996 WHERE `entry`=105902; -- 幽影梦魇
UPDATE `creature_template` SET `name`='伊塞拉修女', `subname`='神殿女祭司', `VerifiedBuild`=25996 WHERE `entry`=98638; -- 伊塞拉修女
UPDATE `creature_template` SET `name`='莱妮丝·坠月', `subname`='神殿女祭司', `VerifiedBuild`=25996 WHERE `entry`=92680; -- 莱妮丝·坠月
UPDATE `creature_template` SET `name`='艾露恩之光', `VerifiedBuild`=25996 WHERE `entry`=105101; -- 艾露恩之光
UPDATE `creature_template` SET `name`='泰兰德·语风', `VerifiedBuild`=25996 WHERE `entry`=104921; -- 泰兰德·语风
UPDATE `creature_template` SET `name`='伊索莱·夜星', `VerifiedBuild`=25996 WHERE `entry`=92697; -- 伊索莱·夜星
UPDATE `creature_template` SET `name`='艾斯特·坠枝', `VerifiedBuild`=25996 WHERE `entry`=108978; -- 艾斯特·坠枝
UPDATE `creature_template` SET `name`='鲑鱼溪村民', `VerifiedBuild`=25996 WHERE `entry`=92617; -- 鲑鱼溪村民
UPDATE `creature_template` SET `name`='复活的先锋', `VerifiedBuild`=25996 WHERE `entry`=114676; -- 复活的先锋
UPDATE `creature_template` SET `name`='迪娜', `VerifiedBuild`=25996 WHERE `entry`=95224; -- 迪娜
UPDATE `creature_template` SET `name`='卡多雷风鹫', `VerifiedBuild`=25996 WHERE `entry`=91839; -- 卡多雷风鹫
UPDATE `creature_template` SET `name`='复生的弓箭手', `VerifiedBuild`=25996 WHERE `entry`=91860; -- 复生的弓箭手
UPDATE `creature_template` SET `name`='复生的潜伏者' WHERE `entry`=99541; -- 复生的潜伏者
UPDATE `creature_template` SET `name`='大法师瓦格斯的影像', `VerifiedBuild`=25996 WHERE `entry`=19644; -- 大法师瓦格斯的影像
UPDATE `creature_template` SET `name`='皮埃尔', `type`=12, `movementId`=121, `VerifiedBuild`=25996 WHERE `entry`=70082; -- 皮埃尔
UPDATE `creature_template` SET `name`='塞纳里奥角鹰兽宝宝', `type`=12, `movementId`=121, `VerifiedBuild`=25996 WHERE `entry`=53623; -- 塞纳里奥角鹰兽宝宝
UPDATE `creature_template` SET `name`='扭扭先生', `type`=12, `movementId`=121, `VerifiedBuild`=25996 WHERE `entry`=16548; -- 扭扭先生
UPDATE `creature_template` SET `name`='灵魂商人', `type`=12, `movementId`=121, `VerifiedBuild`=25996 WHERE `entry`=27914; -- 灵魂商人
UPDATE `creature_template` SET `name`='伊利丹·怒风', `HealthScalingExpansion`=6, `type`=3, `VerifiedBuild`=25996 WHERE `entry`=129114; -- 伊利丹·怒风
UPDATE `creature_template` SET `name`='光铸技师', `femaleName`='光铸技师', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=2, `VerifiedBuild`=25996 WHERE `entry`=126070; -- 光铸技师
UPDATE `creature_template` SET `name`='光铸百夫长', `femaleName`='光铸百夫长', `HealthScalingExpansion`=6, `type`=7, `VerifiedBuild`=25996 WHERE `entry`=129896; -- 光铸百夫长
UPDATE `creature_template` SET `name`='侦察地图', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=129793; -- 侦察地图
UPDATE `creature_template` SET `name`='光铸牧师', `femaleName`='光铸牧师', `HealthScalingExpansion`=6, `type`=7, `VerifiedBuild`=25996 WHERE `entry`=129897; -- 光铸牧师
UPDATE `creature_template` SET `name`='艾洛达尔水晶', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=129429; -- 艾洛达尔水晶
UPDATE `creature_template` SET `name`='温蕾萨·风行者', `subname`='银色盟约的游侠将军', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=15, `VerifiedBuild`=25996 WHERE `entry`=129872; -- 温蕾萨·风行者
UPDATE `creature_template` SET `name`='救赎者阿拉托尔', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=15, `VerifiedBuild`=25996 WHERE `entry`=129871; -- 救赎者阿拉托尔
UPDATE `creature_template` SET `name`='高阶女祭司伊莎娜', `subname`='旅店老板', `HealthScalingExpansion`=6, `type`=7, `type_flags`=134217728, `VerifiedBuild`=25996 WHERE `entry`=129829; -- 高阶女祭司伊莎娜
UPDATE `creature_template` SET `name`='先知维伦', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=10, `ManaModifier`=15, `VerifiedBuild`=25996 WHERE `entry`=128949; -- 先知维伦
UPDATE `creature_template` SET `name`='泰坦能量微粒', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1074790418, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=129722; -- 泰坦能量微粒
UPDATE `creature_template` SET `name`='起源重组模块', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=2097256, `type_flags2`=128, `HealthModifier`=10, `VerifiedBuild`=25996 WHERE `entry`=127809; -- 起源重组模块
UPDATE `creature_template` SET `name`='饥饿灵魂', `HealthScalingExpansion`=6, `type`=15, `type_flags`=1048578, `VerifiedBuild`=25996 WHERE `entry`=129635; -- 饥饿灵魂
UPDATE `creature_template` SET `name`='生命缚誓者的恩赐', `HealthScalingExpansion`=6, `type`=10, `type_flags`=2101356, `type_flags2`=128, `HealthModifier`=10, `VerifiedBuild`=25996 WHERE `entry`=129386; -- 生命缚誓者的恩赐
UPDATE `creature_template` SET `name`='向日葵', `HealthScalingExpansion`=0, `VerifiedBuild`=25996 WHERE `entry`=60484; -- 向日葵
UPDATE `creature_template` SET `name`='星圣管理官', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=2097260, `HealthModifier`=195, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=127192; -- 星圣管理官
UPDATE `creature_template` SET `name`='湮灭刀锋', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=126828; -- 湮灭刀锋
UPDATE `creature_template` SET `name`='裂齿', `VignetteID`=34, `type_flags`=2097225, `VerifiedBuild`=25996 WHERE `entry`=58768; -- 裂齿
UPDATE `creature_template` SET `name`='寂灭者阿古斯', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=2097260, `type_flags2`=128, `HealthModifier`=3567.443, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=124828; -- 寂灭者阿古斯
UPDATE `creature_template` SET `name`='高戈奈斯', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=4, `HealthModifier`=10000, `VerifiedBuild`=25996 WHERE `entry`=126268; -- 高戈奈斯
UPDATE `creature_template` SET `name`='艾欧娜尔', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=4, `HealthModifier`=10000, `VerifiedBuild`=25996 WHERE `entry`=126267; -- 艾欧娜尔
UPDATE `creature_template` SET `name`='卡兹格罗斯', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=4, `type_flags2`=128, `HealthModifier`=10000, `VerifiedBuild`=25996 WHERE `entry`=125886; -- 卡兹格罗斯
UPDATE `creature_template` SET `name`='阿曼苏尔', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=4, `type_flags2`=128, `HealthModifier`=10000, `VerifiedBuild`=25996 WHERE `entry`=125885; -- 阿曼苏尔
UPDATE `creature_template` SET `name`='艾露尼斯', `femaleName`='艾露尼斯', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=128466; -- 艾露尼斯
UPDATE `creature_template` SET `name`='萨拉塔斯', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=127473; -- 萨拉塔斯
UPDATE `creature_template` SET `name`='萨奇尔', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=127458; -- 萨奇尔
UPDATE `creature_template` SET `name`='诺甘农', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=4, `HealthModifier`=10000, `VerifiedBuild`=25996 WHERE `entry`=126266; -- 诺甘农
UPDATE `creature_template` SET `name`='阿格拉玛', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=4, `HealthModifier`=10000, `VerifiedBuild`=25996 WHERE `entry`=125893; -- 阿格拉玛
UPDATE `creature_template` SET `name`='麦格尼·铜须', `IconName`='speak', `HealthScalingExpansion`=6, `RequiredExpansion`=6, `rank`=1, `type`=7, `type_flags`=72, `HealthModifier`=2000, `VerifiedBuild`=25996 WHERE `entry`=128169; -- 麦格尼·铜须
UPDATE `creature_template` SET `name`='烈焰之迹', `HealthScalingExpansion`=6, `type`=10, `VerifiedBuild`=25996 WHERE `entry`=122581; -- 烈焰之迹
UPDATE `creature_template` SET `name`='泰沙拉克的余烬', `HealthScalingExpansion`=6, `type`=4, `type_flags`=2097224, `type_flags2`=128, `HealthModifier`=9, `movementId`=72, `VerifiedBuild`=25996 WHERE `entry`=122532; -- 泰沙拉克的余烬
UPDATE `creature_template` SET `name`='泰沙拉克之焰', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=2097224, `type_flags2`=128, `HealthModifier`=76.5, `movementId`=963, `VerifiedBuild`=25996 WHERE `entry`=121985; -- 泰沙拉克之焰
UPDATE `creature_template` SET `name`='酒灵臭臭', `HealthScalingExpansion`=4, `type`=12, `movementId`=100, `VerifiedBuild`=25996 WHERE `entry`=73367; -- 酒灵臭臭
UPDATE `creature_template` SET `name`='猎风者', `HealthScalingExpansion`=6, `type`=10, `movementId`=72, `VerifiedBuild`=25996 WHERE `entry`=123719; -- 猎风者
UPDATE `creature_template` SET `name`='血虫', `VerifiedBuild`=25996 WHERE `entry`=99773; -- 血虫
UPDATE `creature_template` SET `name`='阿格拉玛', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=2097260, `type_flags2`=128, `HealthModifier`=3000, `movementId`=197, `VerifiedBuild`=25996 WHERE `entry`=121975; -- 阿格拉玛
UPDATE `creature_template` SET `name`='黑暗守护者艾迪斯', `femaleName`='Herald of the Dark Titan', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=2097256, `type_flags2`=65536, `HealthModifier`=120, `movementId`=197, `VerifiedBuild`=25996 WHERE `entry`=123680; -- 黑暗守护者艾迪斯
UPDATE `creature_template` SET `name`='艾露尼斯', `femaleName`='艾露尼斯', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=128464; -- 艾露尼斯
UPDATE `creature_template` SET `name`='萨奇尔', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=127455; -- 萨奇尔
UPDATE `creature_template` SET `name`='萨拉塔斯', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=127470; -- 萨拉塔斯
UPDATE `creature_template` SET `name`='里弗斯', `VerifiedBuild`=25996 WHERE `entry`=101462; -- 里弗斯
UPDATE `creature_template` SET `name`='小拆', `HealthScalingExpansion`=0, `type`=12, `movementId`=121, `VerifiedBuild`=25996 WHERE `entry`=40703; -- 小拆
UPDATE `creature_template` SET `name`='嗜血沼牙鳐' WHERE `entry`=20196; -- 嗜血沼牙鳐
UPDATE `creature_template` SET `name`='化石幼兽', `type`=12, `movementId`=121, `VerifiedBuild`=25996 WHERE `entry`=45340; -- 化石幼兽
UPDATE `creature_template` SET `name`='杰德尼勇士沃鲁斯克', `VerifiedBuild`=25996 WHERE `entry`=126899; -- 杰德尼勇士沃鲁斯克
UPDATE `creature_template` SET `name`='牧羊人卡沃斯', `HealthScalingExpansion`=6, `VignetteID`=2231, `rank`=2, `type`=7, `type_flags`=270534728, `HealthModifier`=60, `VerifiedBuild`=25996 WHERE `entry`=126852; -- 牧羊人卡沃斯
UPDATE `creature_template` SET `name`='暗影法师沃伦', `HealthScalingExpansion`=6, `VignetteID`=2230, `rank`=2, `type`=7, `type_flags`=2097224, `HealthModifier`=63, `VerifiedBuild`=25996 WHERE `entry`=122838; -- 暗影法师沃伦
UPDATE `creature_template` SET `name`='愤怒领主亚雷兹' WHERE `entry`=126338; -- 愤怒领主亚雷兹
UPDATE `creature_template` SET `name`='普希拉', `HealthScalingExpansion`=6, `VignetteID`=2265, `rank`=2, `type`=3, `type_flags`=2097224, `HealthModifier`=76, `VerifiedBuild`=25996 WHERE `entry`=126040; -- 普希拉
UPDATE `creature_template` SET `name`='永燃末日使者' WHERE `entry`=127097; -- 永燃末日使者
UPDATE `creature_template` SET `name`='瓦罗德尼尔', `family`=160, `VerifiedBuild`=25996 WHERE `entry`=121623; -- 瓦罗德尼尔
UPDATE `creature_template` SET `name`='幽爪前锋' WHERE `entry`=3825; -- 幽爪前锋
UPDATE `creature_template` SET `name`='鲤鱼猎手', `VerifiedBuild`=25996 WHERE `entry`=58116; -- 鲤鱼猎手
UPDATE `creature_template` SET `name`='任性的幽魂', `VerifiedBuild`=25996 WHERE `entry`=71431; -- 任性的幽魂
UPDATE `creature_template` SET `name`='小型虚空召唤者', `type`=12, `VerifiedBuild`=25996 WHERE `entry`=71021; -- 小型虚空召唤者
UPDATE `creature_template` SET `name`='卡兹格罗斯的痛苦', `HealthScalingExpansion`=6, `rank`=1, `type`=4, `HealthModifier`=23, `movementId`=961, `VerifiedBuild`=25996 WHERE `entry`=124166; -- 卡兹格罗斯的痛苦
UPDATE `creature_template` SET `name`='卡兹格罗斯', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1048576, `HealthModifier`=70, `ManaModifier`=0, `movementId`=80, `VerifiedBuild`=25996 WHERE `entry`=127930; -- 卡兹格罗斯
UPDATE `creature_template` SET `name`='阿曼苏尔的痛苦', `HealthScalingExpansion`=6, `rank`=1, `type`=4, `HealthModifier`=58, `movementId`=961, `VerifiedBuild`=25996 WHERE `entry`=125837; -- 阿曼苏尔的痛苦
UPDATE `creature_template` SET `name`='阿曼苏尔', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1048576, `HealthModifier`=70, `ManaModifier`=0, `movementId`=80, `VerifiedBuild`=25996 WHERE `entry`=127936; -- 阿曼苏尔
UPDATE `creature_template` SET `name`='高戈奈斯的痛苦', `HealthScalingExpansion`=6, `rank`=1, `type`=4, `HealthModifier`=60, `movementId`=961, `VerifiedBuild`=25996 WHERE `entry`=124164; -- 高戈奈斯的痛苦
UPDATE `creature_template` SET `name`='高戈奈斯', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1048576, `HealthModifier`=70, `ManaModifier`=0, `movementId`=80, `VerifiedBuild`=25996 WHERE `entry`=127937; -- 高戈奈斯
UPDATE `creature_template` SET `name`='诺甘农的痛苦', `HealthScalingExpansion`=6, `rank`=6, `type`=4, `HealthModifier`=0.0000009622159, `movementId`=961, `VerifiedBuild`=25996 WHERE `entry`=123503; -- 诺甘农的痛苦
UPDATE `creature_template` SET `name`='诺甘农', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1048576, `HealthModifier`=70, `ManaModifier`=0, `movementId`=80, `VerifiedBuild`=25996 WHERE `entry`=127938; -- 诺甘农
UPDATE `creature_template` SET `name`='暗影之刃', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `VerifiedBuild`=25996 WHERE `entry`=123086; -- 暗影之刃
UPDATE `creature_template` SET `name`='飞旋的军刀', `HealthScalingExpansion`=6, `type`=10, `type_flags`=269484040, `HealthModifier`=0.01, `movementId`=945, `VerifiedBuild`=25996 WHERE `entry`=123348; -- 飞旋的军刀
UPDATE `creature_template` SET `name`='瓦里玛萨斯之影', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=16778240, `type_flags2`=16, `movementId`=912, `VerifiedBuild`=25996 WHERE `entry`=122643; -- 瓦里玛萨斯之影
UPDATE `creature_template` SET `name`='瓦里玛萨斯之影', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=16778240, `type_flags2`=16, `VerifiedBuild`=25996 WHERE `entry`=122590; -- 瓦里玛萨斯之影
UPDATE `creature_template` SET `name`='诺甘农之魂', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1048576, `HealthModifier`=70, `ManaModifier`=0, `movementId`=80, `VerifiedBuild`=25996 WHERE `entry`=122809; -- 诺甘农之魂
UPDATE `creature_template` SET `name`='卡兹格罗斯之魂', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1048576, `HealthModifier`=70, `ManaModifier`=0, `movementId`=80, `VerifiedBuild`=25996 WHERE `entry`=122781; -- 卡兹格罗斯之魂
UPDATE `creature_template` SET `name`='破坏魔女巫会', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1048576, `HealthModifier`=70, `ManaModifier`=0, `movementId`=80, `VerifiedBuild`=25996 WHERE `entry`=128311; -- 破坏魔女巫会
UPDATE `creature_template` SET `name`='萨拉塔斯', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=127472; -- 萨拉塔斯
UPDATE `creature_template` SET `name`='高戈奈斯之魂', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1048576, `HealthModifier`=70, `ManaModifier`=0, `movementId`=80, `VerifiedBuild`=25996 WHERE `entry`=122814; -- 高戈奈斯之魂
UPDATE `creature_template` SET `name`='阿曼苏尔之魂', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1048576, `HealthModifier`=70, `ManaModifier`=0, `movementId`=80, `VerifiedBuild`=25996 WHERE `entry`=126084; -- 阿曼苏尔之魂
UPDATE `creature_template` SET `name`='萨奇尔', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=127457; -- 萨奇尔
UPDATE `creature_template` SET `name`='鞭笞姐妹', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097224, `HealthModifier`=70, `movementId`=144, `VerifiedBuild`=25996 WHERE `entry`=128095; -- 鞭笞姐妹
UPDATE `creature_template` SET `name`='奥萨拉，黑夜之母', `subname`='破坏魔女巫会', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097260, `type_flags2`=128, `HealthModifier`=3150, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=122467; -- 奥萨拉，黑夜之母
UPDATE `creature_template` SET `name`='狂乱的女祭司', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097224, `HealthModifier`=90, `movementId`=151, `VerifiedBuild`=25996 WHERE `entry`=128060; -- 狂乱的女祭司
UPDATE `creature_template` SET `name`='诺拉，烈焰之母', `subname`='破坏魔女巫会', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097260, `type_flags2`=128, `HealthModifier`=3150, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=122468; -- 诺拉，烈焰之母
UPDATE `creature_template` SET `name`='瓦里玛萨斯', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097260, `type_flags2`=128, `HealthModifier`=3400, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=122366; -- 瓦里玛萨斯
UPDATE `creature_template` SET `name`='蒂玛，幽影之母', `subname`='破坏魔女巫会', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097260, `type_flags2`=128, `HealthModifier`=3150, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=122469; -- 蒂玛，幽影之母
UPDATE `creature_template` SET `name`='萨拉塔斯', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=127471; -- 萨拉塔斯
UPDATE `creature_template` SET `name`='艾露尼斯', `femaleName`='艾露尼斯', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=128465; -- 艾露尼斯
UPDATE `creature_template` SET `name`='萨奇尔', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=127456; -- 萨奇尔
UPDATE `creature_template` SET `name`='光铸战争机甲', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=1075839048, `HealthModifier`=25, `movementId`=169, `VerifiedBuild`=25996 WHERE `entry`=126830; -- 光铸战争机甲
UPDATE `creature_template` SET `name`='麦格尼·铜须', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=72, `HealthModifier`=10, `ManaModifier`=15, `VerifiedBuild`=25996 WHERE `entry`=124913; -- 麦格尼·铜须
UPDATE `creature_template` SET `name`='塔尼斯', `subname`='烈焰守护者', `HealthScalingExpansion`=6, `rank`=1, `type`=5, `type_flags`=2097224, `HealthModifier`=180, `movementId`=158, `VerifiedBuild`=25996 WHERE `entry`=123533; -- 塔尼斯
UPDATE `creature_template` SET `name`='黑暗卫士', `femaleName`='黑暗卫士', `HealthScalingExpansion`=6, `rank`=1, `type`=5, `type_flags`=2097224, `HealthModifier`=90, `movementId`=158, `VerifiedBuild`=25996 WHERE `entry`=123532; -- 黑暗卫士
UPDATE `creature_template` SET `name`='光铸道标', `IconName`='argusteleporter', `HealthScalingExpansion`=6, `RequiredExpansion`=6, `rank`=1, `type`=9, `type_flags`=1076887624, `VerifiedBuild`=25996 WHERE `entry`=128304; -- 光铸道标
UPDATE `creature_template` SET `name`='雪羽龙王', `family`=11, `type_flags`=1, `VerifiedBuild`=25996 WHERE `entry`=115669; -- 雪羽龙王
UPDATE `creature_template` SET `name`='加洛西破坏者', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=270532712, `type_flags2`=128, `HealthModifier`=159.4747, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=123929; -- 加洛西破坏者
UPDATE `creature_template` SET `name`='加洛西歼灭者', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=270532712, `type_flags2`=128, `HealthModifier`=159.4747, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=123906; -- 加洛西歼灭者
UPDATE `creature_template` SET `name`='加洛西屠戮者', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=270532712, `type_flags2`=128, `HealthModifier`=159.4747, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=123921; -- 加洛西屠戮者
UPDATE `creature_template` SET `name`='毁灭者', `HealthScalingExpansion`=6, `type`=10, `type_flags`=17826816, `type_flags2`=16, `VerifiedBuild`=25996 WHERE `entry`=124230; -- 毁灭者
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1076887628, `type_flags2`=128, `VerifiedBuild`=25996 WHERE `entry`=125462; -- Apocalypse Blast Stalker
UPDATE `creature_template` SET `name`='焚化追猎者', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1076887628, `type_flags2`=128, `VerifiedBuild`=25996 WHERE `entry`=124879; -- 焚化追猎者
UPDATE `creature_template` SET `name`='歼灭', `HealthScalingExpansion`=6, `type`=10, `type_flags`=17826816, `type_flags2`=16, `VerifiedBuild`=25996 WHERE `entry`=124160; -- 歼灭
UPDATE `creature_template` SET `name`='桑巴斯', `VerifiedBuild`=25996 WHERE `entry`=50159; -- 桑巴斯
UPDATE `creature_template` SET `name`='地狱塔楼', `HealthScalingExpansion`=6, `rank`=1, `type`=10, `type_flags`=1076887628, `VerifiedBuild`=25996 WHERE `entry`=122634; -- 地狱塔楼
UPDATE `creature_template` SET `name`='拉克西里', `VerifiedBuild`=25996 WHERE `entry`=10200; -- 拉克西里
UPDATE `creature_template` SET `name`='金加洛斯', `subname`='天启工程师', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097260, `type_flags2`=128, `HealthModifier`=3000, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=122578; -- 金加洛斯
UPDATE `creature_template` SET `name`='加洛西破坏者', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=270532712, `HealthModifier`=110, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=127235; -- 加洛西破坏者
UPDATE `creature_template` SET `name`='加洛西歼灭者', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=270532712, `HealthModifier`=110, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=127230; -- 加洛西歼灭者
UPDATE `creature_template` SET `name`='加洛西屠戮者', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=270532712, `HealthModifier`=110, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=127231; -- 加洛西屠戮者
UPDATE `creature_template` SET `name`='火炮轰击', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=124889; -- 火炮轰击
UPDATE `creature_template` SET `name`='霰弹爆破', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=124776; -- 霰弹爆破
UPDATE `creature_template` SET `name`='轰炸', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=124704; -- 轰炸
UPDATE `creature_template` SET `name`='艾露尼斯', `femaleName`='艾露尼斯', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=128463; -- 艾露尼斯
UPDATE `creature_template` SET `name`='萨拉塔斯', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=127469; -- 萨拉塔斯
UPDATE `creature_template` SET `name`='萨奇尔', `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=127454; -- 萨奇尔
UPDATE `creature_template` SET `name`='脉冲手雷', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=124928; -- 脉冲手雷
UPDATE `creature_template` SET `name`='维迪卡尔火炮', `HealthScalingExpansion`=6, `type`=10, `type_flags`=17826816, `type_flags2`=16, `VerifiedBuild`=25996 WHERE `entry`=126678; -- 维迪卡尔火炮
UPDATE `creature_template` SET `name`='码头卫兵', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=1611661328, `type_flags2`=6, `movementId`=144, `VerifiedBuild`=25996 WHERE `entry`=125717; -- 码头卫兵
UPDATE `creature_template` SET `name`='猎魂者伊墨纳尔', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=125692; -- 猎魂者伊墨纳尔
UPDATE `creature_template` SET `name`='陷阱！', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=124686; -- 陷阱！
UPDATE `creature_template` SET `name`='猎魂者伊墨纳尔', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097260, `type_flags2`=128, `HealthModifier`=2314.345, `movementId`=171, `VerifiedBuild`=25996 WHERE `entry`=124158; -- 猎魂者伊墨纳尔
UPDATE `creature_template` SET `name`='加洛西灭世者', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=128154; -- 加洛西灭世者
UPDATE `creature_template` SET `name`='烈火', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=124550; -- 烈火
UPDATE `creature_template` SET `name`='光铸道标', `IconName`='argusteleporter', `HealthScalingExpansion`=6, `RequiredExpansion`=6, `rank`=1, `type`=9, `type_flags`=1076887624, `VerifiedBuild`=25996 WHERE `entry`=128303; -- 光铸道标
UPDATE `creature_template` SET `name`='大技师罗姆尔', `HealthScalingExpansion`=6, `type`=7, `HealthModifier`=3, `VerifiedBuild`=25996 WHERE `entry`=129876; -- 大技师罗姆尔
UPDATE `creature_template` SET `name`='光铸道标', `IconName`='argusteleporter', `HealthScalingExpansion`=6, `RequiredExpansion`=6, `rank`=1, `type`=9, `type_flags`=1076887624, `VerifiedBuild`=25996 WHERE `entry`=125720; -- 光铸道标
UPDATE `creature_template` SET `name`='大法师卡德加', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=2097228, `HealthModifier`=10, `movementId`=113, `VerifiedBuild`=25996 WHERE `entry`=125691; -- 大法师卡德加
UPDATE `creature_template` SET `name`='伊利丹·怒风', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097228, `HealthModifier`=2500, `movementId`=144, `VerifiedBuild`=25996 WHERE `entry`=125683; -- 伊利丹·怒风
UPDATE `creature_template` SET `name`='先知维伦', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `HealthModifier`=2500, `VerifiedBuild`=25996 WHERE `entry`=125682; -- 先知维伦
UPDATE `creature_template` SET `name`='奥蕾莉亚·风行者', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=4, `HealthModifier`=15, `ManaModifier`=80, `VerifiedBuild`=25996 WHERE `entry`=125689; -- 奥蕾莉亚·风行者
UPDATE `creature_template` SET `name`='维迪卡尔', `HealthScalingExpansion`=6, `type`=10, `type_flags`=17826816, `type_flags2`=16, `VerifiedBuild`=25996 WHERE `entry`=126426; -- 维迪卡尔
UPDATE `creature_template` SET `name`='光铸战争机甲', `IconName`='interact', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=1611661328, `type_flags2`=6, `HealthModifier`=7, `VerifiedBuild`=25996 WHERE `entry`=127856; -- 光铸战争机甲
UPDATE `creature_template` SET `name`='光铸战争机甲', `IconName`='interact', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=1611661328, `type_flags2`=6, `HealthModifier`=7, `VerifiedBuild`=25996 WHERE `entry`=127963; -- 光铸战争机甲
UPDATE `creature_template` SET `name`='大法师卡德加', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=4, `HealthModifier`=200, `ManaModifier`=80, `VerifiedBuild`=25996 WHERE `entry`=120224; -- 大法师卡德加
UPDATE `creature_template` SET `name`='领主埃尔加', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097256, `type_flags2`=128, `HealthModifier`=127.98, `movementId`=171, `VerifiedBuild`=25996 WHERE `entry`=122213; -- 领主埃尔加
UPDATE `creature_template` SET `name`='邪丝蛛网', `HealthScalingExpansion`=6, `type`=10, `type_flags`=2097256, `type_flags2`=128, `HealthModifier`=4.05, `VerifiedBuild`=25996 WHERE `entry`=122897; -- 邪丝蛛网
UPDATE `creature_template` SET `name`='达西迪奥夫人', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097256, `type_flags2`=128, `HealthModifier`=127.98, `movementId`=171, `VerifiedBuild`=25996 WHERE `entry`=122212; -- 达西迪奥夫人
UPDATE `creature_template` SET `name`='炽燃小鬼', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097256, `type_flags2`=128, `HealthModifier`=4.25, `movementId`=171, `VerifiedBuild`=25996 WHERE `entry`=122783; -- 炽燃小鬼
UPDATE `creature_template` SET `name`='传送门', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122761; -- 传送门
UPDATE `creature_template` SET `name`='乌坎纳', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097256, `type_flags2`=128, `HealthModifier`=127.98, `movementId`=171, `VerifiedBuild`=25996 WHERE `entry`=122211; -- 乌坎纳
UPDATE `creature_template` SET `name`='邪破传送门', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122438; -- 邪破传送门
UPDATE `creature_template` SET `name`='崩塌的世界', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122425; -- 崩塌的世界
UPDATE `creature_template` SET `name`='生命宝珠', `HealthScalingExpansion`=6, `rank`=1, `type`=4, `type_flags`=1074790416, `type_flags2`=6, `HealthModifier`=200, `VerifiedBuild`=25996 WHERE `entry`=128088; -- 生命宝珠
UPDATE `creature_template` SET `name`='艾欧娜尔', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=72, `HealthModifier`=10, `ManaModifier`=15, `VerifiedBuild`=25996 WHERE `entry`=125604; -- 艾欧娜尔
UPDATE `creature_template` SET `name`='艾欧娜尔的精华', `VerifiedBuild`=25996 WHERE `entry`=131561; -- 艾欧娜尔的精华
UPDATE `creature_template` SET `name`='帕拉克希斯号', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=1074790400, `HealthModifier`=200, `VerifiedBuild`=25996 WHERE `entry`=125364; -- 帕拉克希斯号
UPDATE `creature_template` SET `name`='邪能领主', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=8, `type_flags2`=128, `HealthModifier`=52.25, `movementId`=992, `VerifiedBuild`=25996 WHERE `entry`=123452; -- 邪能领主
UPDATE `creature_template` SET `name`='恶魔犬', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=8, `type_flags2`=128, `HealthModifier`=7.8375, `movementId`=990, `VerifiedBuild`=25996 WHERE `entry`=123191; -- 恶魔犬
UPDATE `creature_template` SET `name`='隐形人', `VerifiedBuild`=25996 WHERE `entry`=100463; -- 隐形人
UPDATE `creature_template` SET `name`='注邪毁灭者', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags2`=128, `HealthModifier`=71.29456, `VerifiedBuild`=25996 WHERE `entry`=123760; -- 注邪毁灭者
UPDATE `creature_template` SET `name`='恶魔卫士', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=8, `type_flags2`=128, `HealthModifier`=26.125, `movementId`=991, `VerifiedBuild`=25996 WHERE `entry`=123451; -- 恶魔卫士
UPDATE `creature_template` SET `name`='侵入点', `HealthScalingExpansion`=6, `VignetteID`=2433, `rank`=1, `type`=9, `type_flags`=1074790416, `type_flags2`=134, `HealthModifier`=200, `VerifiedBuild`=25996 WHERE `entry`=130000; -- 侵入点
UPDATE `creature_template` SET `name`='军团战舰', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=1074790416, `type_flags2`=134, `HealthModifier`=200, `VerifiedBuild`=25996 WHERE `entry`=124298; -- 军团战舰
UPDATE `creature_template` SET `name`='军团战舰', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=1074790416, `type_flags2`=134, `HealthModifier`=200, `VerifiedBuild`=25996 WHERE `entry`=124288; -- 军团战舰
UPDATE `creature_template` SET `name`='青龙雕像', `VerifiedBuild`=25996 WHERE `entry`=60849; -- 青龙雕像
UPDATE `creature_template` SET `name`='帕拉克希斯号', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=1074790400, `type_flags2`=1152, `HealthModifier`=200, `VerifiedBuild`=25996 WHERE `entry`=124445; -- 帕拉克希斯号
UPDATE `creature_template` SET `name`='跳板', `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=1074790416, `type_flags2`=134, `HealthModifier`=200, `VerifiedBuild`=25996 WHERE `entry`=124962; -- 跳板
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `rank`=1, `type`=9, `type_flags`=1074790416, `type_flags2`=134, `HealthModifier`=200, `VerifiedBuild`=25996 WHERE `entry`=124963; -- Jump Dest
UPDATE `creature_template` SET `name`='生命的缚誓者构造体', `HealthScalingExpansion`=6, `rank`=1, `type`=5, `HealthModifier`=20, `VerifiedBuild`=25996 WHERE `entry`=127681; -- 生命的缚誓者构造体
UPDATE `creature_template` SET `name`='艾欧娜尔原祖荆兽', `HealthScalingExpansion`=6, `type`=5, `VerifiedBuild`=25996 WHERE `entry`=127754; -- 艾欧娜尔原祖荆兽
UPDATE `creature_template` SET `name`='艾欧娜尔的精华', `HealthScalingExpansion`=6, `rank`=1, `type`=4, `type_flags`=1074790420, `type_flags2`=1158, `HealthModifier`=1500, `VerifiedBuild`=25996 WHERE `entry`=122500; -- 艾欧娜尔的精华
UPDATE `creature_template` SET `name`='艾欧娜尔幼龙', `HealthScalingExpansion`=6, `family`=26, `type`=1, `type_flags`=1048576, `movementId`=118, `VerifiedBuild`=25996 WHERE `entry`=127763; -- 艾欧娜尔幼龙
UPDATE `creature_template` SET `name`='艾欧娜尔泰坦宝珠', `HealthScalingExpansion`=6, `family`=26, `type`=1, `type_flags`=1048576, `movementId`=118, `VerifiedBuild`=25996 WHERE `entry`=127717; -- 艾欧娜尔泰坦宝珠
UPDATE `creature_template` SET `name`='艾欧娜尔黄蜂', `HealthScalingExpansion`=6, `family`=44, `type`=1, `type_flags`=1048576, `movementId`=118, `VerifiedBuild`=25996 WHERE `entry`=127213; -- 艾欧娜尔黄蜂
UPDATE `creature_template` SET `name`='追猎者', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=126937; -- 追猎者
UPDATE `creature_template` SET `name`='艾欧娜尔飞鸟', `HealthScalingExpansion`=6, `family`=26, `type`=1, `type_flags`=1048576, `movementId`=118, `VerifiedBuild`=25996 WHERE `entry`=126989; -- 艾欧娜尔飞鸟
UPDATE `creature_template` SET `name`='艾欧娜尔之女', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `movementId`=118, `VerifiedBuild`=25996 WHERE `entry`=126982; -- 艾欧娜尔之女
UPDATE `creature_template` SET `HealthScalingExpansion`=6, `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=127694; -- Eonar Beam Stalker
UPDATE `creature_template` SET `name`='追猎者', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1048576, `VerifiedBuild`=25996 WHERE `entry`=126980; -- 追猎者
UPDATE `creature_template` SET `name`='传送门：拉恩科纳', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122587; -- 传送门：拉恩科纳
UPDATE `creature_template` SET `name`='拉恩科纳酸液', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122647; -- 拉恩科纳酸液
UPDATE `creature_template` SET `name`='传送通路：拉恩科纳', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122555; -- 传送通路：拉恩科纳
UPDATE `creature_template` SET `name`='传送通路：拉恩科纳', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122543; -- 传送通路：拉恩科纳
UPDATE `creature_template` SET `name`='传送门守护者哈萨贝尔', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097260, `type_flags2`=128, `HealthModifier`=2183.711, `movementId`=171, `VerifiedBuild`=25996 WHERE `entry`=122104; -- 传送门守护者哈萨贝尔
UPDATE `creature_template` SET `name`='传送通路：纳斯雷萨', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122558; -- 传送通路：纳斯雷萨
UPDATE `creature_template` SET `name`='传送通路：克索诺斯', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122494; -- 传送通路：克索诺斯
UPDATE `creature_template` SET `name`='传送通路：纳斯雷萨', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122559; -- 传送通路：纳斯雷萨
UPDATE `creature_template` SET `name`='传送通路：克索诺斯', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122533; -- 传送通路：克索诺斯
UPDATE `creature_template` SET `name`='纳斯雷萨之影', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122953; -- 纳斯雷萨之影
UPDATE `creature_template` SET `name`='克索诺斯之焰', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122628; -- 克索诺斯之焰
UPDATE `creature_template` SET `name`='传送门：纳斯雷萨', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122588; -- 传送门：纳斯雷萨
UPDATE `creature_template` SET `name`='传送门', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=128293; -- 传送门
UPDATE `creature_template` SET `name`='传送门：克索诺斯', `HealthScalingExpansion`=6, `type`=10, `type_flags`=1611661328, `type_flags2`=6, `VerifiedBuild`=25996 WHERE `entry`=122586; -- 传送门：克索诺斯
UPDATE `creature_template` SET `name`='光铸百夫长', `femaleName`='光铸百夫长', `HealthScalingExpansion`=6, `type`=7, `type_flags`=4096, `VerifiedBuild`=25996 WHERE `entry`=129051; -- 光铸百夫长
UPDATE `creature_template` SET `name`='饥饿的猎犬', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `HealthModifier`=8, `movementId`=171, `VerifiedBuild`=25996 WHERE `entry`=125549; -- 饥饿的猎犬
UPDATE `creature_template` SET `modelid1`=0, `modelid2`=27824, `name`='艾欧娜尔的影像', `HealthScalingExpansion`=6, `type`=10, `type_flags`=17826816, `type_flags2`=16, `VerifiedBuild`=25996 WHERE `entry`=128352; -- 艾欧娜尔的影像
UPDATE `creature_template` SET `name`='裂隙世界助手', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097224, `HealthModifier`=205, `movementId`=144, `VerifiedBuild`=25996 WHERE `entry`=125570; -- 裂隙世界助手
UPDATE `creature_template` SET `name`='麦格尼·铜须', `HealthScalingExpansion`=6, `rank`=1, `type`=7, `type_flags`=72, `HealthModifier`=10, `ManaModifier`=15, `VerifiedBuild`=25996 WHERE `entry`=125584; -- 麦格尼·铜须
UPDATE `creature_template` SET `name`='安托兰恶魔卫士', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097224, `HealthModifier`=120, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=125590; -- 安托兰恶魔卫士
UPDATE `creature_template` SET `name`='安托兰恶魔卫士', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097224, `HealthModifier`=120, `movementId`=186, `VerifiedBuild`=25996 WHERE `entry`=129050; -- 安托兰恶魔卫士
UPDATE `creature_template` SET `name`='炽燃小鬼', `HealthScalingExpansion`=6, `type`=3, `HealthModifier`=2.5, `movementId`=171, `VerifiedBuild`=25996 WHERE `entry`=125545; -- 炽燃小鬼
UPDATE `creature_template` SET `name`='裂隙世界助手', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097224, `HealthModifier`=205, `movementId`=144, `VerifiedBuild`=25996 WHERE `entry`=125535; -- 裂隙世界助手
UPDATE `creature_template` SET `name`='魔触掠行蛛', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `HealthModifier`=5.5, `movementId`=171, `VerifiedBuild`=25996 WHERE `entry`=125547; -- 魔触掠行蛛
UPDATE `creature_template` SET `name`='裂隙世界助手', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097224, `HealthModifier`=205, `movementId`=144, `VerifiedBuild`=25996 WHERE `entry`=125569; -- 裂隙世界助手
UPDATE `creature_template` SET `name`='导邪祭师', `HealthScalingExpansion`=6, `rank`=1, `type`=3, `type_flags`=2097256, `HealthModifier`=90, `ManaModifier`=45, `movementId`=157, `VerifiedBuild`=25996 WHERE `entry`=126333; -- 导邪祭师
UPDATE `creature_template` SET `name`='狡猾的灌尾狐' WHERE `entry`=113184; -- 狡猾的灌尾狐
UPDATE `creature_template` SET `modelid1`=39729, `name`='帕特兰纳克', `HealthScalingExpansion`=4, `rank`=1, `family`=125, `type_flags`=1, `HealthModifier`=5, `VerifiedBuild`=25996 WHERE `entry`=50885; -- 帕特兰纳克
UPDATE `creature_template` SET `name`='永恒怨灵' WHERE `entry`=103130; -- 永恒怨灵
UPDATE `creature_template` SET `name`='时光碎片' WHERE `entry`=102849; -- 时光碎片
UPDATE `creature_template` SET `name`='时光碎片' WHERE `entry`=103109; -- 时光碎片
UPDATE `creature_template` SET `name`='顾问凡多斯' WHERE `entry`=98208; -- 顾问凡多斯
UPDATE `creature_template` SET `name`='恐惧魔蝠' WHERE `entry`=100393; -- 恐惧魔蝠
UPDATE `creature_template` SET `name`='裂隙' WHERE `entry`=100342; -- 裂隙
UPDATE `creature_template` SET `name`='邪群小鬼' WHERE `entry`=98776; -- 邪群小鬼
UPDATE `creature_template` SET `name`='传送门：阿古斯' WHERE `entry`=106754; -- 传送门：阿古斯
UPDATE `creature_template` SET `name`='比斯巨兽之眼' WHERE `entry`=106757; -- 比斯巨兽之眼
UPDATE `creature_template` SET `name`='邪恶的魔牙蛛', `VerifiedBuild`=25996 WHERE `entry`=110966; -- 邪恶的魔牙蛛
UPDATE `creature_template` SET `name`='隔离区', `VerifiedBuild`=25996 WHERE `entry`=99560; -- 隔离区
UPDATE `creature_template` SET `name`='镇压协议' WHERE `entry`=99628; -- 镇压协议
UPDATE `creature_template` SET `name`='虚空链接', `VerifiedBuild`=25996 WHERE `entry`=103024; -- 虚空链接
UPDATE `creature_template` SET `name`='魔网追猎者', `VerifiedBuild`=25996 WHERE `entry`=106567; -- 魔网追猎者
UPDATE `creature_template` SET `name`='星界火花' WHERE `entry`=106546; -- 星界火花
UPDATE `creature_template` SET `name`='暗夜水晶' WHERE `entry`=98734; -- 暗夜水晶
UPDATE `creature_template` SET `name`='荧光小蜘蛛' WHERE `entry`=105845; -- 荧光小蜘蛛
UPDATE `creature_template` SET `name`='不稳定的小软泥怪' WHERE `entry`=98435; -- 不稳定的小软泥怪
UPDATE `creature_template` SET `name`='不稳定的软泥怪' WHERE `entry`=98426; -- 不稳定的软泥怪
UPDATE `creature_template` SET `name`='管道阔步者' WHERE `entry`=99446; -- 管道阔步者
UPDATE `creature_template` SET `name`='科蒂拉克斯' WHERE `entry`=98205; -- 科蒂拉克斯
UPDATE `creature_template` SET `name`='首席奥术师塔莉萨' WHERE `entry`=97140; -- 首席奥术师塔莉萨
UPDATE `creature_template` SET `name`='伊凡尔' WHERE `entry`=98203; -- 伊凡尔
UPDATE `creature_template` SET `name`='地狱火' WHERE `entry`=110833; -- 地狱火
UPDATE `creature_template` SET `name`='纳尔提拉' WHERE `entry`=98207; -- 纳尔提拉
UPDATE `creature_template` SET `name`='邪恶的魔牙蛛' WHERE `entry`=98759; -- 邪恶的魔牙蛛
UPDATE `creature_template` SET `name`='魔化巢蛛' WHERE `entry`=105876; -- 魔化巢蛛
UPDATE `creature_template` SET `name`='萨卡尔将军' WHERE `entry`=98206; -- 萨卡尔将军
UPDATE `creature_template` SET `name`='夜之子复国者', `femaleName`='夜之子复国者' WHERE `entry`=105915; -- 夜之子复国者
UPDATE `creature_template` SET `name`='夜之子魔剑士', `femaleName`='夜之子魔剑士' WHERE `entry`=105921; -- 夜之子魔剑士
UPDATE `creature_template` SET `name`='法力浮龙' WHERE `entry`=102351; -- 法力浮龙
UPDATE `creature_template` SET `name`='奥术畸体' WHERE `entry`=98756; -- 奥术畸体
UPDATE `creature_template` SET `name`='迁跃之影' WHERE `entry`=106059; -- 迁跃之影
UPDATE `creature_template` SET `name`='奥术师纳兰', `VerifiedBuild`=25996 WHERE `entry`=111060; -- 奥术师纳兰
UPDATE `creature_template` SET `name`='枯法者尸体' WHERE `entry`=105493; -- 枯法者尸体
UPDATE `creature_template` SET `name`='恐裔先知' WHERE `entry`=105651; -- 恐裔先知
UPDATE `creature_template` SET `name`='不稳定的融合怪尸体' WHERE `entry`=106013; -- 不稳定的融合怪尸体
UPDATE `creature_template` SET `name`='浮龙尸体' WHERE `entry`=105848; -- 浮龙尸体
UPDATE `creature_template` SET `name`='痛苦女祭司' WHERE `entry`=105706; -- 痛苦女祭司
UPDATE `creature_template` SET `name`='恶魔卫士毁灭者' WHERE `entry`=105682; -- 恶魔卫士毁灭者
UPDATE `creature_template` SET `name`='枯法法力怨灵' WHERE `entry`=105952; -- 枯法法力怨灵
UPDATE `creature_template` SET `name`='恐惧魔蝠' WHERE `entry`=98772; -- 恐惧魔蝠
UPDATE `creature_template` SET `name`='虫语清道夫' WHERE `entry`=105629; -- 虫语清道夫
UPDATE `creature_template` SET `name`='艾瑞达混沌使者', `femaleName`='艾瑞达混沌使者' WHERE `entry`=105617; -- 艾瑞达混沌使者
UPDATE `creature_template` SET `name`='愤怒卫士邪刃者' WHERE `entry`=98770; -- 愤怒卫士邪刃者
UPDATE `creature_template` SET `name`='天灾鼠' WHERE `entry`=98732; -- 天灾鼠
UPDATE `creature_template` SET `name`='艾露尼斯' WHERE `entry`=111639; -- 艾露尼斯
UPDATE `creature_template` SET `name`='枯法魔' WHERE `entry`=98733; -- 枯法魔
UPDATE `creature_template` SET `name`='酸蚀胆汁' WHERE `entry`=98728; -- 酸蚀胆汁
UPDATE `creature_template` SET `name`='不稳定的融合怪' WHERE `entry`=98425; -- 不稳定的融合怪
UPDATE `creature_template` SET `name`='天界河马幼崽', `VerifiedBuild`=25996 WHERE `entry`=106270; -- 天界河马幼崽
UPDATE `creature_template` SET `name`='迷你岩浆暴怒者', `VerifiedBuild`=25996 WHERE `entry`=115138; -- 迷你岩浆暴怒者
UPDATE `creature_template` SET `name`='海加尔小吵闹', `VerifiedBuild`=25996 WHERE `entry`=53692; -- 海加尔小吵闹
UPDATE `creature_template` SET `name`='魁麟守护者', `VerifiedBuild`=25996 WHERE `entry`=61387; -- 魁麟守护者
UPDATE `creature_template` SET `name`='咔哒颌骨', `type`=12, `VerifiedBuild`=25996 WHERE `entry`=127853; -- 咔哒颌骨
UPDATE `creature_template` SET `name`='泽地歌唱者', `VerifiedBuild`=25996 WHERE `entry`=58766; -- 泽地歌唱者
UPDATE `creature_template` SET `name`='沙兰', `subname`='12号' WHERE `entry`=109054; -- 沙兰
UPDATE `creature_template` SET `name`='暮色骑士希莱林', `HealthModifier`=3, `VerifiedBuild`=25996 WHERE `entry`=117155; -- 暮色骑士希莱林
UPDATE `creature_template` SET `name`='凶猛的食岩元素', `VerifiedBuild`=25996 WHERE `entry`=95916; -- 凶猛的食岩元素
UPDATE `creature_template` SET `name`='石化的嚼骨者', `family`=130, `VerifiedBuild`=25996 WHERE `entry`=120968; -- 石化的嚼骨者
UPDATE `creature_template` SET `name`='萨萨拉夫人', `VerifiedBuild`=25996 WHERE `entry`=120938; -- 萨萨拉夫人
UPDATE `creature_template` SET `name`='痛苦的腐蚀者', `VerifiedBuild`=25996 WHERE `entry`=120945; -- 痛苦的腐蚀者
UPDATE `creature_template` SET `name`='女巫格蕾尔达' WHERE `entry`=95123; -- 女巫格蕾尔达
UPDATE `creature_template` SET `name`='银色角鹰兽', `family`=160, `type`=1, `VerifiedBuild`=25996 WHERE `entry`=105886; -- 银色角鹰兽
UPDATE `creature_template` SET `name`='利爪雏龙' WHERE `entry`=115786; -- 利爪雏龙
UPDATE `creature_template` SET `name`='邪能尖刺', `VerifiedBuild`=25996 WHERE `entry`=117124; -- 邪能尖刺
UPDATE `creature_template` SET `name`='阿格拉玛之盾', `VerifiedBuild`=25996 WHERE `entry`=119146; -- 阿格拉玛之盾
UPDATE `creature_template` SET `name`='艾格文的影像', `VerifiedBuild`=25996 WHERE `entry`=121234; -- 艾格文的影像
UPDATE `creature_template` SET `name`='萨奇尔', `VerifiedBuild`=25996 WHERE `entry`=120241; -- 萨奇尔
UPDATE `creature_template` SET `name`='孟菲斯托斯', `VerifiedBuild`=25996 WHERE `entry`=116944; -- 孟菲斯托斯
UPDATE `creature_template` SET `name`='伊利丹·怒风', `VerifiedBuild`=25996 WHERE `entry`=121982; -- 伊利丹·怒风
UPDATE `creature_template` SET `name`='恐翼蝠', `VerifiedBuild`=25996 WHERE `entry`=118642; -- 恐翼蝠
UPDATE `creature_template` SET `name`='恐惧魔王蝙蝠追猎者', `VerifiedBuild`=25996 WHERE `entry`=120207; -- 恐惧魔王蝙蝠追猎者
UPDATE `creature_template` SET `name`='阿格拉玛之盾', `VerifiedBuild`=25996 WHERE `entry`=118418; -- 阿格拉玛之盾
UPDATE `creature_template` SET `name`='恐翼蝠', `VerifiedBuild`=25996 WHERE `entry`=120405; -- 恐翼蝠
UPDATE `creature_template` SET `name`='恶魔卫士', `VerifiedBuild`=25996 WHERE `entry`=119157; -- 恶魔卫士
UPDATE `creature_template` SET `name`='小鬼', `VerifiedBuild`=25996 WHERE `entry`=118801; -- 小鬼
UPDATE `creature_template` SET `name`='多玛塔克斯', `VerifiedBuild`=25996 WHERE `entry`=118804; -- 多玛塔克斯
UPDATE `creature_template` SET `name`='大法师卡德加', `subname`='洛萨之子', `VerifiedBuild`=25996 WHERE `entry`=118797; -- 大法师卡德加
UPDATE `creature_template` SET `name`='脉动的卵囊', `VerifiedBuild`=25996 WHERE `entry`=122085; -- 脉动的卵囊
UPDATE `creature_template` SET `name`='死疽小蜘蛛', `VerifiedBuild`=25996 WHERE `entry`=120016; -- 死疽小蜘蛛
UPDATE `creature_template` SET `name`='蛛网', `VerifiedBuild`=25996 WHERE `entry`=120015; -- 蛛网
UPDATE `creature_template` SET `name`='邪脉植物学家', `VerifiedBuild`=25996 WHERE `entry`=120373; -- 邪脉植物学家
UPDATE `creature_template` SET `name`='邪足执行者', `VerifiedBuild`=25996 WHERE `entry`=118712; -- 邪足执行者
UPDATE `creature_template` SET `name`='邪足晶球法师', `VerifiedBuild`=25996 WHERE `entry`=118713; -- 邪足晶球法师
UPDATE `creature_template` SET `name`='纳尔莎', `VerifiedBuild`=25996 WHERE `entry`=118705; -- 纳尔莎
UPDATE `creature_template` SET `name`='死疽小蜘蛛', `VerifiedBuild`=25996 WHERE `entry`=118706; -- 死疽小蜘蛛
UPDATE `creature_template` SET `name`='轻蔑的萨什比特', `VerifiedBuild`=25996 WHERE `entry`=117194; -- 轻蔑的萨什比特
UPDATE `creature_template` SET `name`='阿格拉玛之盾', `IconName`='openhandglow', `VerifiedBuild`=25996 WHERE `entry`=118884; -- 阿格拉玛之盾
UPDATE `creature_template` SET `VerifiedBuild`=25996 WHERE `entry`=121102; -- Aegis RP Finale Stalker
UPDATE `creature_template` SET `name`='邪能传送门守卫', `HealthModifier`=3, `VerifiedBuild`=25996 WHERE `entry`=121713; -- 邪能传送门守卫
UPDATE `creature_template` SET `name`='邪能传送门守卫', `HealthModifier`=3, `VerifiedBuild`=25996 WHERE `entry`=118834; -- 邪能传送门守卫
UPDATE `creature_template` SET `name`='永默之书', `VerifiedBuild`=25996 WHERE `entry`=120727; -- 永默之书
UPDATE `creature_template` SET `name`='永冬之书', `VerifiedBuild`=25996 WHERE `entry`=118718; -- 永冬之书
UPDATE `creature_template` SET `name`='涌动邪能', `VerifiedBuild`=25996 WHERE `entry`=120257; -- 涌动邪能
UPDATE `creature_template` SET `name`='加泽拉克斯', `VerifiedBuild`=25996 WHERE `entry`=118723; -- 加泽拉克斯
UPDATE `creature_template` SET `name`='鬼火小鬼', `VerifiedBuild`=25996 WHERE `entry`=120371; -- 鬼火小鬼
UPDATE `creature_template` SET `name`='萨奇尔', `VerifiedBuild`=25996 WHERE `entry`=120246; -- 萨奇尔
UPDATE `creature_template` SET `name`='神奇图书馆', `ManaModifier`=0, `VerifiedBuild`=25996 WHERE `entry`=119897; -- 神奇图书馆
UPDATE `creature_template` SET `name`='神奇图书馆', `ManaModifier`=0, `VerifiedBuild`=25996 WHERE `entry`=122238; -- 神奇图书馆
UPDATE `creature_template` SET `name`='神奇图书馆', `ManaModifier`=0, `VerifiedBuild`=25996 WHERE `entry`=122237; -- 神奇图书馆
UPDATE `creature_template` SET `name`='神奇图书馆', `ManaModifier`=0, `VerifiedBuild`=25996 WHERE `entry`=122236; -- 神奇图书馆
UPDATE `creature_template` SET `name`='恐翼蝠', `VerifiedBuild`=25996 WHERE `entry`=121231; -- 恐翼蝠
UPDATE `creature_template` SET `name`='鬼焰女妖', `VerifiedBuild`=25996 WHERE `entry`=120366; -- 鬼焰女妖
UPDATE `creature_template` SET `VerifiedBuild`=25996 WHERE `entry`=119965; -- Doom Guard LT Stalker
UPDATE `creature_template` SET `name`='恐翼蝠', `VerifiedBuild`=25996 WHERE `entry`=119930; -- 恐翼蝠
UPDATE `creature_template` SET `name`='初生的花朵', `RequiredExpansion`=6, `VerifiedBuild`=25996 WHERE `entry`=121695; -- 初生的花朵
UPDATE `creature_template` SET `name`='狂暴的鞭笞者', `HealthModifier`=0.7, `VerifiedBuild`=25996 WHERE `entry`=119169; -- 狂暴的鞭笞者
UPDATE `creature_template` SET `name`='窒息藤蔓', `ManaModifier`=0, `VerifiedBuild`=25996 WHERE `entry`=119190; -- 窒息藤蔓
UPDATE `creature_template` SET `name`='绞藤鞭笞者', `VerifiedBuild`=25996 WHERE `entry`=119977; -- 绞藤鞭笞者
UPDATE `creature_template` SET `name`='恶魔卫士毁灭者', `VerifiedBuild`=25996 WHERE `entry`=120374; -- 恶魔卫士毁灭者
UPDATE `creature_template` SET `name`='阿格洛诺克斯', `subname`='堕落的管理员', `HealthModifier`=38, `VerifiedBuild`=25996 WHERE `entry`=117193; -- 阿格洛诺克斯
UPDATE `creature_template` SET `name`='狂暴的鞭笞者', `VerifiedBuild`=25996 WHERE `entry`=121318; -- 狂暴的鞭笞者
UPDATE `creature_template` SET `name`='喷怨鞭笞者', `VerifiedBuild`=25996 WHERE `entry`=118716; -- 喷怨鞭笞者
UPDATE `creature_template` SET `name`='恐翼蝠', `VerifiedBuild`=25996 WHERE `entry`=120556; -- 恐翼蝠
UPDATE `creature_template` SET `name`='邪疫猎犬', `VerifiedBuild`=25996 WHERE `entry`=118700; -- 邪疫猎犬
UPDATE `creature_template` SET `name`='狂暴的鞭笞者', `VerifiedBuild`=25996 WHERE `entry`=119978; -- 狂暴的鞭笞者
UPDATE `creature_template` SET `name`='鬼焰女妖', `VerifiedBuild`=25996 WHERE `entry`=118714; -- 鬼焰女妖
UPDATE `creature_template` SET `name`='杜尔扎克', `VerifiedBuild`=25996 WHERE `entry`=118704; -- 杜尔扎克
UPDATE `creature_template` SET `name`='邪脉植物学家', `VerifiedBuild`=25996 WHERE `entry`=118703; -- 邪脉植物学家
UPDATE `creature_template` SET `name`='抗魔联军士兵', `femaleName`='抗魔联军士兵', `VerifiedBuild`=25996 WHERE `entry`=120776; -- 抗魔联军士兵
UPDATE `creature_template` SET `name`='喷怨鞭笞者', `VerifiedBuild`=25996 WHERE `entry`=121711; -- 喷怨鞭笞者
UPDATE `creature_template` SET `name`='愤怒卫士入侵者', `VerifiedBuild`=25996 WHERE `entry`=120778; -- 愤怒卫士入侵者
UPDATE `creature_template` SET `name`='鬼火慰魂者', `femaleName`='鬼火慰魂者', `VerifiedBuild`=25996 WHERE `entry`=119923; -- 鬼火慰魂者
UPDATE `creature_template` SET `name`='鬼火邪能使者', `femaleName`='鬼火邪能使者', `VerifiedBuild`=25996 WHERE `entry`=120779; -- 鬼火邪能使者
UPDATE `creature_template` SET `name`='恶魔卫士毁灭者', `VerifiedBuild`=25996 WHERE `entry`=120770; -- 恶魔卫士毁灭者
UPDATE `creature_template` SET `name`='愤怒卫士入侵者', `VerifiedBuild`=25996 WHERE `entry`=120550; -- 愤怒卫士入侵者
UPDATE `creature_template` SET `name`='玛维·影歌', `VerifiedBuild`=25996 WHERE `entry`=120312; -- 玛维·影歌
UPDATE `creature_template` SET `name`='恶魔卫士毁灭者', `VerifiedBuild`=25996 WHERE `entry`=119952; -- 恶魔卫士毁灭者
UPDATE `creature_template` SET `name`='愤怒卫士入侵者', `VerifiedBuild`=25996 WHERE `entry`=118690; -- 愤怒卫士入侵者
UPDATE `creature_template` SET `name`='伊利丹·怒风', `VerifiedBuild`=25996 WHERE `entry`=120792; -- 伊利丹·怒风
UPDATE `creature_template` SET `name`='玛维·影歌', `VerifiedBuild`=25996 WHERE `entry`=119147; -- 玛维·影歌
UPDATE `creature_template` SET `name`='鬼火邪能使者', `femaleName`='鬼火邪能使者', `VerifiedBuild`=25996 WHERE `entry`=118724; -- 鬼火邪能使者
UPDATE `creature_template` SET `name`='鬼火小鬼', `VerifiedBuild`=25996 WHERE `entry`=118717; -- 鬼火小鬼
UPDATE `creature_template` SET `name`='虫语清道夫', `VerifiedBuild`=25996 WHERE `entry`=118719; -- 虫语清道夫
UPDATE `creature_template` SET `name`='游荡的硬壳龟', `VerifiedBuild`=25996 WHERE `entry`=91785; -- 游荡的硬壳龟

DELETE FROM `creature_questitem` WHERE (`CreatureEntry`=116323 AND `Idx`=0) OR (`CreatureEntry`=116944 AND `Idx`=0) OR (`CreatureEntry`=120405 AND `Idx`=1) OR (`CreatureEntry`=120405 AND `Idx`=0) OR (`CreatureEntry`=121231 AND `Idx`=1) OR (`CreatureEntry`=121231 AND `Idx`=0) OR (`CreatureEntry`=119930 AND `Idx`=1) OR (`CreatureEntry`=119930 AND `Idx`=0) OR (`CreatureEntry`=119977 AND `Idx`=1) OR (`CreatureEntry`=119977 AND `Idx`=0) OR (`CreatureEntry`=117193 AND `Idx`=1) OR (`CreatureEntry`=117193 AND `Idx`=0) OR (`CreatureEntry`=121318 AND `Idx`=1) OR (`CreatureEntry`=121318 AND `Idx`=0) OR (`CreatureEntry`=118716 AND `Idx`=1) OR (`CreatureEntry`=118716 AND `Idx`=0) OR (`CreatureEntry`=120556 AND `Idx`=1) OR (`CreatureEntry`=120556 AND `Idx`=0) OR (`CreatureEntry`=118700 AND `Idx`=1) OR (`CreatureEntry`=118700 AND `Idx`=0) OR (`CreatureEntry`=119978 AND `Idx`=1) OR (`CreatureEntry`=119978 AND `Idx`=0) OR (`CreatureEntry`=121711 AND `Idx`=1) OR (`CreatureEntry`=121711 AND `Idx`=0);
INSERT INTO `creature_questitem` (`CreatureEntry`, `Idx`, `ItemId`, `VerifiedBuild`) VALUES
(116323, 0, 143496, 25996), -- 下水道贱民
(116944, 0, 146696, 25996), -- 孟菲斯托斯
(120405, 1, 129888, 25996), -- 恐翼蝠
(120405, 0, 129888, 25996), -- 恐翼蝠
(121231, 1, 129888, 25996), -- 恐翼蝠
(121231, 0, 129888, 25996), -- 恐翼蝠
(119930, 1, 129888, 25996), -- 恐翼蝠
(119930, 0, 129888, 25996), -- 恐翼蝠
(119977, 1, 129131, 25996), -- 绞藤鞭笞者
(119977, 0, 129128, 25996), -- 绞藤鞭笞者
(117193, 1, 129131, 25996), -- 阿格洛诺克斯
(117193, 0, 129128, 25996), -- 阿格洛诺克斯
(121318, 1, 129131, 25996), -- 狂暴的鞭笞者
(121318, 0, 129128, 25996), -- 狂暴的鞭笞者
(118716, 1, 129131, 25996), -- 喷怨鞭笞者
(118716, 0, 129128, 25996), -- 喷怨鞭笞者
(120556, 1, 129888, 25996), -- 恐翼蝠
(120556, 0, 129888, 25996), -- 恐翼蝠
(118700, 1, 129888, 25996), -- 邪疫猎犬
(118700, 0, 129888, 25996), -- 邪疫猎犬
(119978, 1, 129131, 25996), -- 狂暴的鞭笞者
(119978, 0, 129128, 25996), -- 狂暴的鞭笞者
(121711, 1, 129131, 25996), -- 喷怨鞭笞者
(121711, 0, 129128, 25996); -- 喷怨鞭笞者

UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=97756 AND `Idx`=0); -- 伊克罗特
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=99895 AND `Idx`=0); -- 肮脏的老鼠
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=47544 AND `Idx`=0); -- 斯瓦诺斯
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=7977 AND `Idx`=0); -- 加莫里塔
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=82308 AND `Idx`=0); -- 影月追猎者
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=91860 AND `Idx`=0); -- 复生的弓箭手
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=122838 AND `Idx`=3); -- 暗影法师沃伦
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=122838 AND `Idx`=2); -- 暗影法师沃伦
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=122838 AND `Idx`=1); -- 暗影法师沃伦
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=122838 AND `Idx`=0); -- 暗影法师沃伦
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=115669 AND `Idx`=1); -- 雪羽龙王
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=115669 AND `Idx`=0); -- 雪羽龙王
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=95916 AND `Idx`=3); -- 凶猛的食岩元素
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=95916 AND `Idx`=2); -- 凶猛的食岩元素
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=95916 AND `Idx`=1); -- 凶猛的食岩元素
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=95916 AND `Idx`=0); -- 凶猛的食岩元素
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=116944 AND `Idx`=3); -- 孟菲斯托斯
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=116944 AND `Idx`=2); -- 孟菲斯托斯
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=116944 AND `Idx`=1); -- 孟菲斯托斯
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=91785 AND `Idx`=1); -- 游荡的硬壳龟
UPDATE `creature_questitem` SET `VerifiedBuild`=25996 WHERE (`CreatureEntry`=91785 AND `Idx`=0); -- 游荡的硬壳龟

DELETE FROM `gameobject_template` WHERE `entry` IN (249781 /*衣柜：熔火之心*/, 268663 /*Doodad_UL_Head_Female03*/, 268665 /*Doodad_UL_Head_Female04*/, 268664 /*Doodad_UL_Head_Male02*/, 268662 /*Doodad_UL_SkyRoom_Floor01*/, 273012 /*心跳*/, 273011 /*心跳*/, 268667 /*安全门*/, 273008 /*心跳*/, 273009 /*心跳*/, 273010 /*心跳*/, 273007 /*心跳*/, 268659 /*安全门*/, 273006 /*心跳*/, 270713 /*邮箱*/, 272379 /*安多哈尔之战*/, 272248 /*圆盘*/, 272243 /*联盟军旗*/, 272242 /*部落战旗*/, 272231 /*树*/, 272230 /*风车*/, 278492 /*冒险者的指令板*/, 278214 /*长椅*/, 278217 /*艾洛达尔水晶*/, 277355 /*万神殿的宝藏*/, 277477 /*277477*/, 272718 /*Doodad_7DU_ArgusRaid_GasEmitter003*/, 278831 /*278831*/, 272722 /*Doodad_7DU_ArgusRaid_GasEmitter007*/, 272721 /*Doodad_7DU_ArgusRaid_GasEmitter006*/, 278828 /*278828*/, 272717 /*Doodad_7DU_ArgusRaid_GasEmitter002*/, 272719 /*Doodad_7DU_ArgusRaid_GasEmitter004*/, 278830 /*278830*/, 272723 /*Doodad_7DU_ArgusRaid_GasEmitter008*/, 272720 /*Doodad_7DU_ArgusRaid_GasEmitter005*/, 272716 /*Doodad_7DU_ArgusRaid_GasEmitter001*/, 278829 /*278829*/, 277476 /*277476*/, 277180 /*门*/, 277179 /*门*/, 273686 /*门*/, 272868 /*神殿大门*/, 272486 /*神殿大门*/, 272485 /*神殿大门*/, 276474 /*导管*/, 276475 /*导管*/, 277531 /*277531*/, 276294 /*Doodad_7DU_ArgusRaid_EngineerGate006*/, 276293 /*Doodad_7DU_ArgusRaid_EngineerGate005*/, 276292 /*Doodad_7DU_ArgusRaid_EngineerGate004*/, 276290 /*Doodad_7DU_ArgusRaid_EngineerGate003*/, 276289 /*Doodad_7DU_ArgusRaid_EngineerGate002*/, 276288 /*Doodad_7DU_ArgusRaid_EngineerGate001*/, 276477 /*导管*/, 276476 /*导管*/, 273911 /*防爆门*/, 276503 /*生命的恩赐*/, 272683 /*帕拉克希斯号*/, 273688 /*门*/, 273687 /*门*/, 277381 /*传送门*/, 276917 /*枢纽传送门*/, 277521 /*277521*/, 277474 /*传送门*/, 277132 /*传送门*/, 277133 /*传送门*/, 277475 /*传送门*/, 268711 /*门*/, 268712 /*门*/, 268680 /*门*/, 269122 /*邪能屏障*/, 268710 /*门*/, 269222 /*Doodad_7DU_TombofSargeras_GardenDoor002*/, 269224 /*Doodad_7DU_TombofSargeras_GardenDoor004*/, 269121 /*邪能屏障*/, 268372 /*Doodad_7DU_TombofSargeras_CircularBookCase001*/, 268375 /*Doodad_7DU_TombofSargeras_CircularBookCase004*/, 268373 /*Doodad_7DU_TombofSargeras_CircularBookCase002*/, 268374 /*Doodad_7DU_TombofSargeras_CircularBookCase003*/, 269042 /*门*/, 268709 /*门*/, 268713 /*门*/, 269223 /*Doodad_7DU_TombofSargeras_GardenDoor003*/, 269221 /*Doodad_7DU_TombofSargeras_GardenDoor001*/, 268714 /*门*/);
INSERT INTO `gameobject_template` (`entry`, `type`, `displayId`, `IconName`, `unk1`, `size`, `Data0`, `Data1`, `Data2`, `Data3`, `Data4`, `Data5`, `Data6`, `Data7`, `Data8`, `Data9`, `Data10`, `Data11`, `Data12`, `Data13`, `Data14`, `Data15`, `Data16`, `Data17`, `Data18`, `Data19`, `Data20`, `Data21`, `Data22`, `Data23`, `Data24`, `Data25`, `Data26`, `Data27`, `Data28`, `Data29`, `Data30`, `Data31`, `Data32`, `RequiredLevel`, `VerifiedBuild`,`name`) VALUES
(249781, 22, 34257, '', '', 1, 211544, -1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '衣柜：熔火之心'), -- 衣柜：熔火之心
(268663, 5, 8104, '', '', 0.9999999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_UL_Head_Female03'), -- Doodad_UL_Head_Female03
(268665, 5, 8105, '', '', 0.9999999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_UL_Head_Female04'), -- Doodad_UL_Head_Female04
(268664, 5, 8106, '', '', 0.9999999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_UL_Head_Male02'), -- Doodad_UL_Head_Male02
(268662, 5, 43760, '', '', 1.081202, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_UL_SkyRoom_Floor01'), -- Doodad_UL_SkyRoom_Floor01
(273012, 5, 43887, '', '', 3.850586, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '心跳'), -- 心跳
(273011, 5, 43887, '', '', 4.260385, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '心跳'), -- 心跳
(268667, 0, 8081, '', '', 0.9999999, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '安全门'), -- 安全门
(273008, 5, 43887, '', '', 2.510904, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '心跳'), -- 心跳
(273009, 5, 43887, '', '', 2.510904, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '心跳'), -- 心跳
(273010, 5, 43887, '', '', 2.510904, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '心跳'), -- 心跳
(273007, 5, 43887, '', '', 2.510904, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '心跳'), -- 心跳
(268659, 0, 8081, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '安全门'), -- 安全门
(273006, 5, 43887, '', '', 3.153484, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '心跳'), -- 心跳
(270713, 19, 4591, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '邮箱'), -- 邮箱
(272379, 22, 10794, '', '', 2.5, 247457, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '安多哈尔之战'), -- 安多哈尔之战
(272248, 5, 8342, '', '', 0.25, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '圆盘'), -- 圆盘
(272243, 5, 43213, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '联盟军旗'), -- 联盟军旗
(272242, 5, 16335, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '部落战旗'), -- 部落战旗
(272231, 5, 43431, '', '', 0.22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '树'), -- 树
(272230, 5, 43430, '', '', 0.5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '风车'), -- 风车
(278492, 10, 47196, '', '', 1, 2824, 0, 0, 0, 0, 0, 0, 0, 0, 0, 256856, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 25996, '冒险者的指令板'), -- 冒险者的指令板
(278214, 7, 36331, '', '', 0.88, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '长椅'), -- 长椅
(278217, 10, 15949, 'questinteract', '', 0.5, 1690, 0, 0, 3000, 0, 0, 0, 0, 0, 0, 255962, 0, 0, 1, 35196, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '艾洛达尔水晶'), -- 艾洛达尔水晶
(277355, 3, 45022, '', '', 2, 1634, 75591, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 100, 0, 0, 0, 0, 2092, 0, 1, 0, 0, 75769, 0, 2, 110, 25996, '万神殿的宝藏'), -- 万神殿的宝藏
(277477, 35, 43840, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, ''), -- 277477
(272718, 10, 43753, '', '', 0.9999999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_GasEmitter003'), -- Doodad_7DU_ArgusRaid_GasEmitter003
(278831, 10, 46581, '', '', 3.839999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, ''), -- 278831
(272722, 10, 43753, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_GasEmitter007'), -- Doodad_7DU_ArgusRaid_GasEmitter007
(272721, 10, 43753, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_GasEmitter006'), -- Doodad_7DU_ArgusRaid_GasEmitter006
(278828, 10, 46578, '', '', 3.839999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, ''), -- 278828
(272717, 10, 43753, '', '', 0.9999999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_GasEmitter002'), -- Doodad_7DU_ArgusRaid_GasEmitter002
(272719, 10, 43753, '', '', 0.9999999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_GasEmitter004'), -- Doodad_7DU_ArgusRaid_GasEmitter004
(278830, 10, 46580, '', '', 3.839999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, ''), -- 278830
(272723, 10, 43753, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_GasEmitter008'), -- Doodad_7DU_ArgusRaid_GasEmitter008
(272720, 10, 43753, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_GasEmitter005'), -- Doodad_7DU_ArgusRaid_GasEmitter005
(272716, 10, 43753, '', '', 0.9999999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_GasEmitter001'), -- Doodad_7DU_ArgusRaid_GasEmitter001
(278829, 10, 46579, '', '', 3.839999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, ''), -- 278829
(277476, 0, 45144, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, ''), -- 277476
(277180, 0, 44191, '', '', 0.9294302, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(277179, 0, 44191, '', '', 0.9294302, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(273686, 0, 44191, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(272868, 0, 43841, '', '', 0.7349999, 0, 0, 3000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '神殿大门'), -- 神殿大门
(272486, 0, 43629, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '神殿大门'), -- 神殿大门
(272485, 0, 43629, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '神殿大门'), -- 神殿大门
(276474, 10, 44648, '', '', 1.8514, 0, 0, 0, 3000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '导管'), -- 导管
(276475, 10, 44648, '', '', 1.8514, 0, 0, 0, 3000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '导管'), -- 导管
(277531, 0, 45201, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, ''), -- 277531
(276294, 0, 44599, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_EngineerGate006'), -- Doodad_7DU_ArgusRaid_EngineerGate006
(276293, 0, 44599, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_EngineerGate005'), -- Doodad_7DU_ArgusRaid_EngineerGate005
(276292, 0, 44599, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_EngineerGate004'), -- Doodad_7DU_ArgusRaid_EngineerGate004
(276290, 0, 44599, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_EngineerGate003'), -- Doodad_7DU_ArgusRaid_EngineerGate003
(276289, 0, 44599, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_EngineerGate002'), -- Doodad_7DU_ArgusRaid_EngineerGate002
(276288, 0, 44599, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_ArgusRaid_EngineerGate001'), -- Doodad_7DU_ArgusRaid_EngineerGate001
(276477, 10, 44648, '', '', 2.048435, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '导管'), -- 导管
(276476, 10, 44648, '', '', 2.048435, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '导管'), -- 导管
(273911, 10, 44388, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '防爆门'), -- 防爆门
(276503, 3, 8628, '', '', 2, 1634, 75565, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 100, 0, 0, 0, 0, 2075, 0, 1, 0, 0, 75763, 0, 2, 110, 25996, '生命的恩赐'), -- 生命的恩赐
(272683, 43, 29031, '', '', 1, -1, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '帕拉克希斯号'), -- 帕拉克希斯号
(273688, 0, 44193, '', '', 0.9899999, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(273687, 0, 44193, '', '', 0.9899999, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(277381, 22, 44981, '', '', 1.45, 241923, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '传送门'), -- 传送门
(276917, 10, 44393, '', '', 0.72, 0, 0, 0, 3000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '枢纽传送门'), -- 枢纽传送门
(277521, 0, 45201, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, ''), -- 277521
(277474, 22, 44981, '', '', 3.211094, 241922, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '传送门'), -- 传送门
(277132, 10, 44394, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 241922, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '传送门'), -- 传送门
(277133, 10, 44395, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 240797, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '传送门'), -- 传送门
(277475, 22, 44981, '', '', 3.211094, 240797, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '传送门'), -- 传送门
(268711, 0, 40920, '', '', 0.6845066, 0, 0, 3000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(268712, 0, 40920, '', '', 0.6779474, 0, 0, 3000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(268680, 0, 41166, '', '', 0.7024186, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(269122, 0, 26056, '', '', 0.7014099, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '邪能屏障'), -- 邪能屏障
(268710, 0, 41166, '', '', 0.6598756, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(269222, 0, 41925, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_TombofSargeras_GardenDoor002'), -- Doodad_7DU_TombofSargeras_GardenDoor002
(269224, 0, 41925, '', '', 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_TombofSargeras_GardenDoor004'), -- Doodad_7DU_TombofSargeras_GardenDoor004
(269121, 0, 26056, '', '', 0.7014099, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '邪能屏障'), -- 邪能屏障
(268372, 0, 40938, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_TombofSargeras_CircularBookCase001'), -- Doodad_7DU_TombofSargeras_CircularBookCase001
(268375, 0, 40938, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_TombofSargeras_CircularBookCase004'), -- Doodad_7DU_TombofSargeras_CircularBookCase004
(268373, 0, 40938, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_TombofSargeras_CircularBookCase002'), -- Doodad_7DU_TombofSargeras_CircularBookCase002
(268374, 0, 40938, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_TombofSargeras_CircularBookCase003'), -- Doodad_7DU_TombofSargeras_CircularBookCase003
(269042, 0, 40920, '', '', 0.6779473, 0, 0, 3000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(268709, 0, 41166, '', '', 0.6598756, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(268713, 0, 40920, '', '', 0.6910657, 0, 0, 3000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'), -- 门
(269223, 0, 41925, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_TombofSargeras_GardenDoor003'), -- Doodad_7DU_TombofSargeras_GardenDoor003
(269221, 0, 41925, '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, 'Doodad_7DU_TombofSargeras_GardenDoor001'), -- Doodad_7DU_TombofSargeras_GardenDoor001
(268714, 0, 40920, '', '', 0.7044379, 0, 0, 3000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25996, '门'); -- 门


UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=244579; -- 缚法隔离层
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=244598; -- 下水道箱子
UPDATE `gameobject_template` SET `Data1`=62092, `VerifiedBuild`=25996 WHERE `entry`=244599; -- 下水道战利品
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=244578; -- 炼金烈焰
UPDATE `gameobject_template` SET `Data1`=0, `VerifiedBuild`=25996 WHERE `entry`=246519; -- 魔能机甲外壳
UPDATE `gameobject_template` SET `type`=3, `displayId`=6908, `size`=0.6, `Data3`=1, `Data30`=71644, `VerifiedBuild`=25996 WHERE `entry`=268084; -- 两个帝国
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=248863; -- 蜡烛
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=248865; -- 颅骨
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=248861; -- 宝典
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=248889; -- 座位
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=248864; -- 颅骨
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=248862; -- 蜡烛
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=249780; -- 衣柜：卡拉赞歌剧院
UPDATE `gameobject_template` SET `type`=10, `displayId`=8632, `IconName`='questinteract', `Data0`=93, `Data3`=3000, `Data10`=239337, `Data14`=133677, `Data23`=1, `VerifiedBuild`=25996 WHERE `entry`=268578; -- 传送台
UPDATE `gameobject_template` SET `type`=10, `displayId`=8504, `size`=3.194704, `Data3`=3000, `VerifiedBuild`=25996 WHERE `entry`=268666; -- 控制台
UPDATE `gameobject_template` SET `type`=10, `displayId`=8177, `Data3`=3000, `VerifiedBuild`=25996 WHERE `entry`=268480; -- 泰坦控制面板
UPDATE `gameobject_template` SET `type`=10, `displayId`=8632, `IconName`='questinteract', `Data0`=93, `Data3`=3000, `Data10`=238571, `Data14`=133677, `Data20`=1, `Data23`=1, `VerifiedBuild`=25996 WHERE `entry`=270857; -- 传送台
UPDATE `gameobject_template` SET `type`=10, `displayId`=42363, `IconName`='questinteract', `Data0`=43, `Data3`=5000, `Data10`=243534, `Data14`=131083, `Data20`=1, `Data23`=1, `VerifiedBuild`=25996 WHERE `entry`=270860; -- 能量导管
UPDATE `gameobject_template` SET `type`=10, `displayId`=42363, `IconName`='questinteract', `Data0`=43, `Data3`=3000, `Data10`=243533, `Data14`=131083, `Data20`=1, `Data23`=1, `VerifiedBuild`=25996 WHERE `entry`=270859; -- 能量导管
UPDATE `gameobject_template` SET `type`=10, `displayId`=42363, `IconName`='questinteract', `Data0`=43, `Data3`=10000, `Data10`=243531, `Data14`=131083, `Data20`=1, `Data23`=1, `VerifiedBuild`=25996 WHERE `entry`=270858; -- 能量导管
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=190768; -- 古旧的石箱
UPDATE `gameobject_template` SET `type`=50, `Data0`=38, `Data1`=51452, `Data3`=0, `Data4`=475, `Data5`=500, `Data6`=30, `Data12`=70, `Data13`=1, `Data18`=10, `Data19`=0, `RequiredLevel`=58, `VerifiedBuild`=25996 WHERE `entry`=191133; -- 泰坦神铁矿脉
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=201760; -- 映像大厅大门
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=201761; -- 萨隆矿坑闸门
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=201759; -- 灵魂洪炉闸门
UPDATE `gameobject_template` SET `Data1`=25395, `VerifiedBuild`=25996 WHERE `entry`=190702; -- 源血碎片
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=190350; -- 篝火
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=190779; -- 突出的泥土
UPDATE `gameobject_template` SET `Data1`=24861, `VerifiedBuild`=25996 WHERE `entry`=190778; -- 突出的泥土
UPDATE `gameobject_template` SET `Data26`=1, `VerifiedBuild`=25996 WHERE `entry`=190622; -- 坚韧的藤蔓
UPDATE `gameobject_template` SET `type`=50, `Data0`=29, `Data1`=51509, `Data3`=0, `Data4`=400, `Data5`=450, `Data6`=30, `Data9`=0, `Data12`=62, `Data13`=1, `Data18`=10, `Data19`=0, `RequiredLevel`=58, `VerifiedBuild`=25996 WHERE `entry`=190169; -- 卷丹
UPDATE `gameobject_template` SET `Data1`=25673, `VerifiedBuild`=25996 WHERE `entry`=192057; -- 水母群
UPDATE `gameobject_template` SET `Data1`=24368, `VerifiedBuild`=25996 WHERE `entry`=190533; -- 沙蕨
UPDATE `gameobject_template` SET `type`=50, `Data0`=29, `Data1`=51511, `Data3`=0, `Data4`=425, `Data5`=475, `Data6`=30, `Data9`=0, `Data12`=67, `Data13`=1, `Data18`=10, `Data19`=0, `RequiredLevel`=58, `VerifiedBuild`=25996 WHERE `entry`=191019; -- 蛇信草
UPDATE `gameobject_template` SET `type`=50, `Data0`=38, `Data1`=51308, `Data3`=0, `Data4`=425, `Data5`=475, `Data6`=30, `Data12`=65, `Data13`=1, `Data18`=10, `Data19`=0, `RequiredLevel`=58, `VerifiedBuild`=25996 WHERE `entry`=189980; -- 萨隆邪铁矿脉
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=189317; -- 篝火
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188106; -- 西部哨站阀门
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=187984; -- 西部哨站阀门
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188651; -- 熔炉
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188521; -- 升降梯
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188652; -- 铁砧
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=187268; -- 邮箱
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188514; -- Doodad_Nexus_Elevator_BaseStructure_01
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188454; -- 菲兹兰克伞兵传送器
UPDATE `gameobject_template` SET `Data1`=23094, `VerifiedBuild`=25996 WHERE `entry`=187689; -- 机灵鬼的物品
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=187985; -- 北部哨站阀门
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188107; -- 北部哨站阀门
UPDATE `gameobject_template` SET `Data26`=1, `VerifiedBuild`=25996 WHERE `entry`=187881; -- 塔尔拉玛斯天灾召唤法阵
UPDATE `gameobject_template` SET `Data1`=23168, `VerifiedBuild`=25996 WHERE `entry`=187898; -- 菲兹兰克备用零件
UPDATE `gameobject_template` SET `Data1`=23168, `VerifiedBuild`=25996 WHERE `entry`=187901; -- 菲兹兰克备用零件
UPDATE `gameobject_template` SET `Data1`=23168, `VerifiedBuild`=25996 WHERE `entry`=187899; -- 菲兹兰克备用零件
UPDATE `gameobject_template` SET `Data1`=23168, `VerifiedBuild`=25996 WHERE `entry`=187900; -- 菲兹兰克备用零件
UPDATE `gameobject_template` SET `type`=50, `Data0`=29, `Data1`=51510, `Data3`=0, `Data4`=385, `Data5`=435, `Data6`=30, `Data7`=0, `Data9`=0, `Data12`=60, `Data13`=1, `Data18`=10, `Data19`=0, `Data20`=191304, `RequiredLevel`=58, `VerifiedBuild`=25996 WHERE `entry`=191303; -- 火棘花
UPDATE `gameobject_template` SET `Data1`=23168, `VerifiedBuild`=25996 WHERE `entry`=187897; -- 菲兹兰克备用零件
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=191304; -- 火棘花陷阱
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=216714; -- 炉子
UPDATE `gameobject_template` SET `Data1`=23090, `VerifiedBuild`=25996 WHERE `entry`=187677; -- 疫病土壤
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=194026; -- 黄色传送器
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=194025; -- 紫色传送器
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=191225; -- 火盆
UPDATE `gameobject_template` SET `Data1`=23385, `VerifiedBuild`=25996 WHERE `entry`=188237; -- 部落军备
UPDATE `gameobject_template` SET `Data1`=23385, `VerifiedBuild`=25996 WHERE `entry`=188238; -- 部落军备
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=187908; -- 火盆
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188446; -- 魔网地图的影像
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188445; -- 魔网能量线焦点
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188534; -- 邮箱
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188344; -- Purple aura, tall
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188342; -- 大法师艾萨斯·夺日者的符文
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=177278; -- 月亮井
UPDATE `gameobject_template` SET `Data8`=1, `VerifiedBuild`=25996 WHERE `entry`=214516; -- Instance Portal (Party + Heroic)
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188419; -- 长者玛纳洛
UPDATE `gameobject_template` SET `type`=50, `Data0`=29, `Data1`=25094, `Data3`=0, `Data4`=375, `Data5`=425, `Data6`=30, `Data9`=0, `Data12`=63, `Data13`=1, `Data18`=10, `Data19`=0, `RequiredLevel`=58, `VerifiedBuild`=25996 WHERE `entry`=190173; -- 冰冷的草药
UPDATE `gameobject_template` SET `Data1`=23591, `VerifiedBuild`=25996 WHERE `entry`=188489; -- 红玉丁香
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=185563; -- Aura Trap Red Short
UPDATE `gameobject_template` SET `Data1`=24169, `VerifiedBuild`=25996 WHERE `entry`=189992; -- 红玉橡果
UPDATE `gameobject_template` SET `type`=50, `Data0`=29, `Data1`=51507, `Data3`=0, `Data4`=375, `Data5`=425, `Data6`=30, `Data9`=0, `Data12`=62, `Data13`=1, `Data18`=10, `Data19`=0, `RequiredLevel`=0, `VerifiedBuild`=25996 WHERE `entry`=189973; -- 金苜蓿
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=190236; -- 大门
UPDATE `gameobject_template` SET `Data1`=25834, `VerifiedBuild`=25996 WHERE `entry`=192773; -- 达莉亚之泪
UPDATE `gameobject_template` SET `type`=50, `Data3`=0, `Data4`=375, `Data5`=425, `Data6`=30, `Data12`=60, `Data13`=1, `Data18`=10, `Data19`=0, `Data23`=0, `Data24`=0, `RequiredLevel`=58, `VerifiedBuild`=25996 WHERE `entry`=189978; -- 钴矿脉
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188448; -- Nexus Sigil Blue 01
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=190019; -- Nexus Magic Orb Blue 01
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188474; -- 魔网能量线焦点
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=210108; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=210112; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=210111; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=210109; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=210110; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=174626; -- 通灵学院大门
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=3800; -- 温暖的小火
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=3799; -- 温暖的小火
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=170073; -- 木椅
UPDATE `gameobject_template` SET `type`=3, `displayId`=13911, `size`=0.7, `Data0`=43, `Data3`=1, `Data30`=74990, `VerifiedBuild`=25996 WHERE `entry`=272387; -- 时光宝箱
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=207972; -- 邮箱
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=187568; -- Turtle (Walker of Waves)
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=188511; -- Turtle (Green Island)
UPDATE `gameobject_template` SET `Data10`=1, `VerifiedBuild`=25996 WHERE `entry`=188712; -- Wintergarde Mine Cave In (2)
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=190352; -- Doodad_HU_Portcullis03
UPDATE `gameobject_template` SET `Data8`=1, `Data10`=1, `VerifiedBuild`=25996 WHERE `entry`=214536; -- Instance Portal (Raid 10/25 No Heroic)
UPDATE `gameobject_template` SET `Data8`=1, `Data10`=1, `VerifiedBuild`=25996 WHERE `entry`=214441; -- Instance Portal (Raid 4 Difficulties)
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=192622; -- 集合石
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=207971; -- 邮箱
UPDATE `gameobject_template` SET `type`=3, `displayId`=8128, `Data3`=1, `Data30`=71643, `VerifiedBuild`=25996 WHERE `entry`=268083; -- 七大王国
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259297; -- 长椅
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259445; -- 长椅
UPDATE `gameobject_template` SET `type`=3, `displayId`=7706, `size`=0.75, `Data3`=1, `Data30`=71637, `VerifiedBuild`=25996 WHERE `entry`=268077; -- 最后的守护者
UPDATE `gameobject_template` SET `type`=3, `displayId`=1128, `size`=0.75, `Data3`=1, `Data30`=71636, `VerifiedBuild`=25996 WHERE `entry`=268076; -- 卡多雷和永恒之井
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259458; -- 长椅
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259457; -- 长椅
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259456; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259455; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259454; -- 长椅
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259453; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259452; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259451; -- 长椅
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259450; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259449; -- 长椅
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259448; -- 沙发
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259447; -- 沙发
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259446; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259444; -- 长椅
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259443; -- 长椅
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259442; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259441; -- 沙发
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259440; -- 沙发
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259439; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259302; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259301; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259300; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259299; -- 椅子
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=259298; -- 长椅
UPDATE `gameobject_template` SET `Data0`=84506, `VerifiedBuild`=25996 WHERE `entry`=209081; -- 到奥格瑞玛的传送门
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=204878; -- 邮箱
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=204119; -- 熔炉
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=204118; -- 铁砧
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=257289; -- 精灵宝箱
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=181886; -- 紫色焰火
UPDATE `gameobject_template` SET `VerifiedBuild`=25996 WHERE `entry`=245606; -- 圆桶碰撞
UPDATE `gameobject_template` SET `type`=10, `displayId`=41470, `VerifiedBuild`=25996 WHERE `entry`=269173; -- 阿格拉玛之盾
UPDATE `gameobject_template` SET `type`=10, `displayId`=41376, `VerifiedBuild`=25996 WHERE `entry`=268708; -- Doodad_7DU_TombofSargeras_Mephistroth_RoomVFX_Fel001
UPDATE `gameobject_template` SET `type`=50, `displayId`=36117, `IconName`='openhand', `size`=0.8, `Data0`=43, `Data1`=73839, `Data6`=120, `Data12`=105, `Data15`=1, `Data17`=1631, `Data18`=5, `Data19`=1, `VerifiedBuild`=25996 WHERE `entry`=269939; -- 军团储物箱


UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=244579 AND `Idx`=0); -- 缚法隔离层
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=244578 AND `Idx`=0); -- 炼金烈焰
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=246519 AND `Idx`=0); -- 魔能机甲外壳
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=190702 AND `Idx`=0); -- 源血碎片
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=190778 AND `Idx`=0); -- 突出的泥土
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=190533 AND `Idx`=0); -- 沙蕨
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=187689 AND `Idx`=0); -- 机灵鬼的物品
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=187898 AND `Idx`=0); -- 菲兹兰克备用零件
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=187901 AND `Idx`=0); -- 菲兹兰克备用零件
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=187899 AND `Idx`=0); -- 菲兹兰克备用零件
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=187900 AND `Idx`=0); -- 菲兹兰克备用零件
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=187897 AND `Idx`=0); -- 菲兹兰克备用零件
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=187677 AND `Idx`=0); -- 疫病土壤
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=188237 AND `Idx`=0); -- 部落军备
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=188238 AND `Idx`=0); -- 部落军备
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=188489 AND `Idx`=0); -- 红玉丁香
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=189992 AND `Idx`=0); -- 红玉橡果
UPDATE `gameobject_questitem` SET `VerifiedBuild`=25996 WHERE (`GameObjectEntry`=192773 AND `Idx`=0); -- 达莉亚之泪

DELETE FROM `npc_text` WHERE `ID` IN (31424 /*31424*/, 32283 /*32283*/, 32182 /*32182*/, 32191 /*32191*/, 32190 /*32190*/, 32193 /*32193*/, 32192 /*32192*/, 32288 /*32288*/, 32102 /*32102*/, 32114 /*32114*/, 32109 /*32109*/, 32105 /*32105*/, 32110 /*32110*/, 32107 /*32107*/, 32111 /*32111*/, 32108 /*32108*/, 32101 /*32101*/, 32106 /*32106*/, 32185 /*32185*/, 32100 /*32100*/, 33196 /*33196*/, 33194 /*33194*/, 32452 /*32452*/, 32448 /*32448*/, 32450 /*32450*/, 33359 /*33359*/, 33354 /*33354*/, 33351 /*33351*/, 33355 /*33355*/, 33352 /*33352*/, 33356 /*33356*/, 33353 /*33353*/, 33019 /*33019*/, 31110 /*31110*/, 33041 /*33041*/, 32453 /*32453*/, 32550 /*32550*/, 32868 /*32868*/, 33006 /*33006*/, 31840 /*31840*/, 31838 /*31838*/, 31568 /*31568*/, 29658 /*29658*/, 29250 /*29250*/, 32117 /*32117*/);
INSERT INTO `npc_text` (`ID`, `Probability0`, `Probability1`, `Probability2`, `Probability3`, `Probability4`, `Probability5`, `Probability6`, `Probability7`, `BroadcastTextId0`, `BroadcastTextId1`, `BroadcastTextId2`, `BroadcastTextId3`, `BroadcastTextId4`, `BroadcastTextId5`, `BroadcastTextId6`, `BroadcastTextId7`, `VerifiedBuild`) VALUES
(31424, 1, 0, 0, 0, 0, 0, 0, 0, 128413, 0, 0, 0, 0, 0, 0, 0, 25996), -- 31424
(32283, 1, 0, 0, 0, 0, 0, 0, 0, 133116, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32283
(32182, 1, 1, 1, 0, 0, 0, 0, 0, 132557, 132558, 132559, 0, 0, 0, 0, 0, 25996), -- 32182
(32191, 1, 0, 0, 0, 0, 0, 0, 0, 132588, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32191
(32190, 1, 0, 0, 0, 0, 0, 0, 0, 132587, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32190
(32193, 1, 0, 0, 0, 0, 0, 0, 0, 132590, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32193
(32192, 1, 0, 0, 0, 0, 0, 0, 0, 132589, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32192
(32288, 1, 0, 0, 0, 0, 0, 0, 0, 133163, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32288
(32102, 1, 0, 0, 0, 0, 0, 0, 0, 132071, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32102
(32114, 1, 0, 0, 0, 0, 0, 0, 0, 132110, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32114
(32109, 1, 0, 0, 0, 0, 0, 0, 0, 132088, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32109
(32105, 1, 0, 0, 0, 0, 0, 0, 0, 132083, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32105
(32110, 1, 0, 0, 0, 0, 0, 0, 0, 132089, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32110
(32107, 1, 0, 0, 0, 0, 0, 0, 0, 132085, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32107
(32111, 1, 0, 0, 0, 0, 0, 0, 0, 132090, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32111
(32108, 1, 0, 0, 0, 0, 0, 0, 0, 132086, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32108
(32101, 1, 0, 0, 0, 0, 0, 0, 0, 132065, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32101
(32106, 1, 0, 0, 0, 0, 0, 0, 0, 132084, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32106
(32185, 1, 0, 0, 0, 0, 0, 0, 0, 132578, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32185
(32100, 1, 0, 0, 0, 0, 0, 0, 0, 132064, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32100
(33196, 1, 0, 0, 0, 0, 0, 0, 0, 138842, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33196
(33194, 1, 0, 0, 0, 0, 0, 0, 0, 138838, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33194
(32452, 1, 0, 0, 0, 0, 0, 0, 0, 134174, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32452
(32448, 1, 0, 0, 0, 0, 0, 0, 0, 134154, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32448
(32450, 1, 0, 0, 0, 0, 0, 0, 0, 134165, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32450
(33359, 1, 0, 0, 0, 0, 0, 0, 0, 141105, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33359
(33354, 1, 0, 0, 0, 0, 0, 0, 0, 141097, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33354
(33351, 1, 0, 0, 0, 0, 0, 0, 0, 141098, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33351
(33355, 1, 0, 0, 0, 0, 0, 0, 0, 141103, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33355
(33352, 1, 0, 0, 0, 0, 0, 0, 0, 141104, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33352
(33356, 1, 0, 0, 0, 0, 0, 0, 0, 141101, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33356
(33353, 1, 0, 0, 0, 0, 0, 0, 0, 141099, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33353
(33019, 1, 0, 0, 0, 0, 0, 0, 0, 137726, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33019
(31110, 1, 0, 0, 0, 0, 0, 0, 0, 125596, 0, 0, 0, 0, 0, 0, 0, 25996), -- 31110
(33041, 1, 0, 0, 0, 0, 0, 0, 0, 137799, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33041
(32453, 1, 0, 0, 0, 0, 0, 0, 0, 135867, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32453
(32550, 1, 0, 0, 0, 0, 0, 0, 0, 134912, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32550
(32868, 1, 0, 0, 0, 0, 0, 0, 0, 137285, 0, 0, 0, 0, 0, 0, 0, 25996), -- 32868
(33006, 1, 0, 0, 0, 0, 0, 0, 0, 137648, 0, 0, 0, 0, 0, 0, 0, 25996), -- 33006
(31840, 1, 0, 0, 0, 0, 0, 0, 0, 130645, 0, 0, 0, 0, 0, 0, 0, 25996), -- 31840
(31838, 1, 0, 0, 0, 0, 0, 0, 0, 130643, 0, 0, 0, 0, 0, 0, 0, 25996), -- 31838
(31568, 1, 0, 0, 0, 0, 0, 0, 0, 129242, 0, 0, 0, 0, 0, 0, 0, 25996), -- 31568
(29658, 1, 0, 0, 0, 0, 0, 0, 0, 115618, 0, 0, 0, 0, 0, 0, 0, 25996), -- 29658
(29250, 1, 1, 0, 0, 0, 0, 0, 0, 111824, 111823, 0, 0, 0, 0, 0, 0, 25996), -- 29250
(32117, 1, 0, 0, 0, 0, 0, 0, 0, 111412, 0, 0, 0, 0, 0, 0, 0, 25996); -- 32117

UPDATE `npc_text` SET `VerifiedBuild`=25996 WHERE `ID`=12714; -- 12714
UPDATE `npc_text` SET `VerifiedBuild`=25996 WHERE `ID`=26277; -- 26277
UPDATE `npc_text` SET `VerifiedBuild`=25996 WHERE `ID`=29022; -- 29022

